#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2017 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://oss.oracle.com/licenses/CDDL+GPL-1.1
# or LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes

#### Errors and exceptions (1-1000)
WSSPIPE0001.problem.mar.unmar=WSSPIPE001: JAXBContext\uC5D0\uC11C JAXB \uB9C8\uC15C\uB7EC/\uC5B8\uB9C8\uC15C\uB7EC\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uBB38\uC81C\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. JAXBcontext\uAC00 \uC62C\uBC14\uB974\uAC8C \uCD08\uAE30\uD654\uB418\uC5C8\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.

WSSPIPE0002.internal.server.error=WSSPIPE0002: \uBCF4\uC548 \uD30C\uC774\uD504: SOAPFault\uB97C \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0003.problem.printing.msg=WSSPIPE003: SOAP \uBA54\uC2DC\uC9C0\uB97C \uC778\uC1C4\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uBA54\uC2DC\uC9C0\uC758 XML \uD615\uC2DD \uC801\uD569\uC131 \uBB38\uC81C\uC77C \uC218 \uC788\uC2B5\uB2C8\uB2E4.

WSSPIPE0004.opt.path.not.yet.supported=WSSPIPE0004: \uC624\uB958 \uC815\uCC45 \uD655\uC778\uC5D0\uC11C \uCD5C\uC801\uD654\uB41C \uACBD\uB85C\uAC00 \uC544\uC9C1 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSSPIPE0005.problem.proc.soap.message=WSSPIPE0005: \uBCF4\uC548 \uD30C\uC774\uD504: JAXWS \uBA54\uC2DC\uC9C0\uB97C SAAJ SOAP \uBA54\uC2DC\uC9C0\uB85C \uBCC0\uD658\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0006.problem.init.out.proc.context=WSSPIPE0006: \uBCF4\uC548 \uD30C\uC774\uD504: \uC1A1\uC2E0 \uBCF4\uC548 \uCC98\uB9AC \uCEE8\uD14D\uC2A4\uD2B8\uB97C \uCD08\uAE30\uD654\uD558\uB294 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0007.problem.getting.eff.boot.policy=WSSPIPE0007: \uBCF4\uC548 \uD30C\uC774\uD504: \uC720\uD6A8\uD55C SecureConversation \uBD80\uD2B8\uC2A4\uD2B8\uB7A9 \uC815\uCC45\uC744 \uAC00\uC838\uC624\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0008.problem.building.protocol.policy=WSSPIPE0008: \uBCF4\uC548 \uD30C\uC774\uD504: \uD504\uB85C\uD1A0\uCF5C \uBA54\uC2DC\uC9C0\uC5D0 \uB300\uD55C \uC720\uD6A8\uD55C \uBCF4\uC548 \uC815\uCC45\uC744 \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0009.unsupported.callback.type.encountered=WSSPIPE0009: \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uB294 \uCF5C\uBC31 \uC720\uD615 {0}\uC774(\uAC00) \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0010.unknown.validator.type.config=WSSPIPE0010: \uAD6C\uC131 \uAC80\uC99D\uC5D0 \uC54C \uC218 \uC5C6\uB294 \uAC80\uC99D\uAE30 \uC720\uD615 {0}\uC774(\uAC00) \uC788\uC2B5\uB2C8\uB2E4.

WSSPIPE0011.could.not.find.user.class=WSSPIPE0011: \uC0AC\uC6A9\uC790 \uD074\uB798\uC2A4\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC74C: {0}.

WSSPIPE0012.problem.checking.reliable.message.enable=WSSPIPE0012: \uB0B4\uBD80 \uC624\uB958: Reliable Messaging\uC774 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC5C8\uB294\uC9C0 \uC5EC\uBD80\uB97C \uAC10\uC9C0\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSSPIPE0013.sec.policy.not.configured=WSSPIPE0013: {0} \uC791\uC5C5\uC5D0 \uB300\uD574 SecurityPolicy\uAC00 \uAD6C\uC131\uB418\uC9C0 \uC54A\uC558\uC9C0\uB9CC SecurityHeader\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0014.keystore.url.null.config.assertion=WSSPIPE0014: ConfigAssertion\uC5D0\uC11C KeyStore URL\uC744 NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0015.keystore.password.null.config.assertion=WSSPIPE0015: ConfigAssertion\uC5D0\uC11C KeyStore \uBE44\uBC00\uBC88\uD638\uB97C NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0016.truststore.url.null.config.assertion=WSSPIPE0016: ConfigAssertion\uC5D0\uC11C TrustStore URL\uC744 NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0017.truststore.password.null.config.assertion=WSSPIPE0017: ConfigAssertion\uC5D0\uC11C TrustStore \uBE44\uBC00\uBC88\uD638\uB97C NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0018.null.or.empty.xwss.callback.handler.classname=WSSPIPE0018: xwssCallbackHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0019.null.or.empty.username.handler.classname=WSSPIPE0019: usernameHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0020.null.or.empty.password.handler.classname=WSSPIPE0020: passwordHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0021.null.or.empty.saml.handler.classname=WSSPIPE0021: samlHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

# {0} - validator name
WSSPIPE0022.null.or.empty.validator.classname=WSSPIPE0022: {0}\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC80\uC99D\uAE30 \uD074\uB798\uC2A4 \uC774\uB984\uC774 \uC124\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSPIPE0023.error.creating.new.instance.sec.client.pipe=WSSPIPE0023: SecurityClientPipe\uC758 \uC0C8 \uC778\uC2A4\uD134\uC2A4\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0024.error.securing.outbound.msg=WSSPIPE0024: \uC544\uC6C3\uBC14\uC6B4\uB4DC \uBA54\uC2DC\uC9C0\uB97C \uBCF4\uC548\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0025.error.verify.inbound.msg=WSSPIPE0025: \uC778\uBC14\uC6B4\uB4DC \uBA54\uC2DC\uC9C0\uC5D0\uC11C \uBCF4\uC548\uC744 \uD655\uC778\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0026.no.policy.found.for.sc=WSSPIPE0026: SecureConversation\uC744 \uC2DC\uC791\uD560 \uC218 \uC5C6\uC74C - SecureConversation \uAC80\uC99D\uC744 \uC815\uCC45\uC5D0\uC11C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSSPIPE0027.error.configure.client.handler=WSSPIPE0027: \uD074\uB77C\uC774\uC5B8\uD2B8 \uBCF4\uC548 \uCF5C\uBC31 \uCC98\uB9AC\uAE30\uB97C \uAD6C\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0028.error.creating.new.instance.sec.server.pipe=WSSPIPE0028: SecurityServerPipe\uC758 \uC0C8 \uC778\uC2A4\uD134\uC2A4\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0029.error.session.creation=WSSPIPE0029: RST-SCT \uBC1C\uD589 \uC694\uCCAD\uC73C\uB85C \uBCF4\uC548 \uC138\uC158 \uC0DD\uC131\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0030.unsupported.operation.exception=WSSPIPE0030: RequestType {0}\uC740(\uB294) \uBCF4\uC548 \uC138\uC158 \uC0DD\uC131\uC5D0 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSSPIPE0031.error.invoke.sc.contract=WSSPIPE0031: \uBCF4\uC548 \uCEE8\uBC84\uC138\uC774\uC158 \uACC4\uC57D\uC744 \uD638\uCD9C\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0032.error.configure.server.handler=WSSPIPE0027: \uC11C\uBC84 \uBCF4\uC548 \uCF5C\uBC31 \uCC98\uB9AC\uAE30\uB97C \uAD6C\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSPIPE0033.invalid.callback.handler.class=WSSPIPE0033: \uC9C0\uC815\uB41C CallbackHandler \uD074\uB798\uC2A4 {0}\uC740(\uB294) \uC801\uD569\uD55C javax.security.auth.callback.CallbackHandler\uAC00 \uC544\uB2D9\uB2C8\uB2E4.

WSSPIPE0034.faulty.response.msg=WSSPIPE0034: \uD074\uB77C\uC774\uC5B8\uD2B8 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC774 SOAP \uC624\uB958\uB97C \uC218\uC2E0\uD568: {0}.

WSSPIPE0035.error.issuedtoken.creation=WSSPIPE0035: IssuedToken \uC0DD\uC131 \uC911 \uC608\uC678 \uC0AC\uD56D\uC744 \uC218\uC2E0\uD588\uC2B5\uB2C8\uB2E4.

#### Info, Fine and Warning messages ####
#### Codes starting from 1000+


# For Tubes

#Logging Error codes

#### Errors and exceptions (1-1000)
WSSTUBE0001.problem.mar.unmar=WSSTUBE001: JAXBContext\uC5D0\uC11C JAXB \uB9C8\uC15C\uB7EC/\uC5B8\uB9C8\uC15C\uB7EC\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uBB38\uC81C\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. JAXBcontext\uAC00 \uC62C\uBC14\uB974\uAC8C \uCD08\uAE30\uD654\uB418\uC5C8\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.

WSSTUBE0002.internal.server.error=WSSTUBE0002: \uBCF4\uC548 \uD29C\uBE0C: SOAPFault\uB97C \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0003.problem.printing.msg=WSSTUBE003: SOAP \uBA54\uC2DC\uC9C0\uB97C \uC778\uC1C4\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uBA54\uC2DC\uC9C0\uC758 XML \uD615\uC2DD \uC801\uD569\uC131 \uBB38\uC81C\uC77C \uC218 \uC788\uC2B5\uB2C8\uB2E4.

WSSTUBE0004.opt.path.not.yet.supported=WSSTUBE0004: \uC624\uB958 \uC815\uCC45 \uD655\uC778\uC5D0\uC11C \uCD5C\uC801\uD654\uB41C \uACBD\uB85C\uAC00 \uC544\uC9C1 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSSTUBE0005.problem.proc.soap.message=WSSTUBE0005: \uBCF4\uC548 \uD29C\uBE0C: JAXWS \uBA54\uC2DC\uC9C0\uB97C SAAJ SOAP \uBA54\uC2DC\uC9C0\uB85C \uBCC0\uD658\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0006.problem.init.out.proc.context=WSSTUBE0006: \uBCF4\uC548 \uD29C\uBE0C: \uC1A1\uC2E0 \uBCF4\uC548 \uCC98\uB9AC \uCEE8\uD14D\uC2A4\uD2B8\uB97C \uCD08\uAE30\uD654\uD558\uB294 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0007.problem.getting.eff.boot.policy=WSSTUBE0007: \uBCF4\uC548 \uD29C\uBE0C: \uC720\uD6A8\uD55C SecureConversation \uBD80\uD2B8\uC2A4\uD2B8\uB7A9 \uC815\uCC45\uC744 \uAC00\uC838\uC624\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0008.problem.building.protocol.policy=WSSTUBE0008: \uBCF4\uC548 \uD29C\uBE0C: \uD504\uB85C\uD1A0\uCF5C \uBA54\uC2DC\uC9C0\uC5D0 \uB300\uD55C \uC720\uD6A8\uD55C \uBCF4\uC548 \uC815\uCC45\uC744 \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0009.unsupported.callback.type.encountered=WSSTUBE0009: \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uB294 \uCF5C\uBC31 \uC720\uD615 {0}\uC774(\uAC00) \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0010.unknown.validator.type.config=WSSTUBE0010: \uAD6C\uC131 \uAC80\uC99D\uC5D0 \uC54C \uC218 \uC5C6\uB294 \uAC80\uC99D\uAE30 \uC720\uD615 {0}\uC774(\uAC00) \uC788\uC2B5\uB2C8\uB2E4.

WSSTUBE0011.could.not.find.user.class=WSSTUBE0011: \uC0AC\uC6A9\uC790 \uD074\uB798\uC2A4\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC74C: {0}.

WSSTUBE0012.problem.checking.reliable.message.enable=WSSTUBE0012: \uB0B4\uBD80 \uC624\uB958: Reliable Messaging\uC774 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC5C8\uB294\uC9C0 \uC5EC\uBD80\uB97C \uAC10\uC9C0\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSSTUBE0013.sec.policy.not.configured=WSSTUBE0013: {0} \uC791\uC5C5\uC5D0 \uB300\uD574 SecurityPolicy\uAC00 \uAD6C\uC131\uB418\uC9C0 \uC54A\uC558\uC9C0\uB9CC SecurityHeader\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0014.keystore.url.null.config.assertion=WSSTUBE0014: ConfigAssertion\uC5D0\uC11C KeyStore URL\uC744 NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0015.keystore.password.null.config.assertion=WSSTUBE0015: ConfigAssertion\uC5D0\uC11C KeyStore \uBE44\uBC00\uBC88\uD638\uB97C NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0016.truststore.url.null.config.assertion=WSSTUBE0016: ConfigAssertion\uC5D0\uC11C TrustStore URL\uC744 NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0017.truststore.password.null.config.assertion=WSSTUBE0017: ConfigAssertion\uC5D0\uC11C TrustStore \uBE44\uBC00\uBC88\uD638\uB97C NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0018.null.or.empty.xwss.callback.handler.classname=WSSTUBE0018: xwssCallbackHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0019.null.or.empty.username.handler.classname=WSSTUBE0019: usernameHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0020.null.or.empty.password.handler.classname=WSSTUBE0020: passwordHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0021.null.or.empty.saml.handler.classname=WSSTUBE0021: samlHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

# {0} - validator name
WSSTUBE0022.null.or.empty.validator.classname=WSSTUBE0022: {0}\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC80\uC99D\uAE30 \uD074\uB798\uC2A4 \uC774\uB984\uC774 \uC124\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSSTUBE0023.error.creating.new.instance.sec.client.tube=WSSTUBE0023: SecurityClientPipe\uC758 \uC0C8 \uC778\uC2A4\uD134\uC2A4\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0024.error.securing.outbound.msg=WSSTUBE0024: \uC544\uC6C3\uBC14\uC6B4\uB4DC \uBA54\uC2DC\uC9C0\uB97C \uBCF4\uC548\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0025.error.verify.inbound.msg=WSSTUBE0025: \uC778\uBC14\uC6B4\uB4DC \uBA54\uC2DC\uC9C0\uC5D0\uC11C \uBCF4\uC548\uC744 \uD655\uC778\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0026.no.policy.found.for.sc=WSSTUBE0026: SecureConversation\uC744 \uC2DC\uC791\uD560 \uC218 \uC5C6\uC74C - SecureConversation \uAC80\uC99D\uC744 \uC815\uCC45\uC5D0\uC11C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSSTUBE0027.error.configure.client.handler=WSSTUBE0027: \uD074\uB77C\uC774\uC5B8\uD2B8 \uBCF4\uC548 \uCF5C\uBC31 \uCC98\uB9AC\uAE30\uB97C \uAD6C\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0028.error.creating.new.instance.sec.server.tube=WSSTUBE0028: SecurityServerTube\uC758 \uC0C8 \uC778\uC2A4\uD134\uC2A4\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0029.error.session.creation=WSSTUBE0029: RST-SCT \uBC1C\uD589 \uC694\uCCAD\uC73C\uB85C \uBCF4\uC548 \uC138\uC158 \uC0DD\uC131\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0030.unsupported.operation.exception=WSSTUBE0030: RequestType {0}\uC740(\uB294) \uBCF4\uC548 \uC138\uC158 \uC0DD\uC131\uC5D0 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSSTUBE0031.error.invoke.sc.contract=WSSTUBE0031: \uBCF4\uC548 \uCEE8\uBC84\uC138\uC774\uC158 \uACC4\uC57D\uC744 \uD638\uCD9C\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0032.error.configure.server.handler=WSSTUBE0027: \uC11C\uBC84 \uBCF4\uC548 \uCF5C\uBC31 \uCC98\uB9AC\uAE30\uB97C \uAD6C\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0033.invalid.callback.handler.class=WSSTUBE0033: \uC9C0\uC815\uB41C CallbackHandler \uD074\uB798\uC2A4 {0}\uC740(\uB294) \uC801\uD569\uD55C javax.security.auth.callback.CallbackHandler\uAC00 \uC544\uB2D9\uB2C8\uB2E4.

WSSTUBE0034.faulty.response.msg=WSSTUBE0034: \uD074\uB77C\uC774\uC5B8\uD2B8 \uC751\uC6A9 \uD504\uB85C\uADF8\uB7A8\uC774 SOAP \uC624\uB958\uB97C \uC218\uC2E0\uD568: {0}.

WSSTUBE0035.error.issuedtoken.creation=WSSTUBE0035: IssuedToken \uC0DD\uC131 \uC911 \uC608\uC678 \uC0AC\uD56D\uC744 \uC218\uC2E0\uD588\uC2B5\uB2C8\uB2E4.

WSSTUBE0036.error.instatiate.webservice.context.delegate=WSSTUBE: \uC6F9 \uC11C\uBE44\uC2A4 \uCEE8\uD14D\uC2A4\uD2B8 \uC704\uC784\uC744 \uC778\uC2A4\uD134\uC2A4\uD654\uD558\uB294 \uC911 \uC608\uC678 \uC0AC\uD56D\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

#### Info, Fine and Warning messages ####
#### Codes starting from 1000+
