#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2017 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://oss.oracle.com/licenses/CDDL+GPL-1.1
# or LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes

#### Errors and exceptions (1-1000)
WSITPVD0001.problem.mar.unmar=WSITPVD001: se ha producido un problema al crear el marshaller/unmarshaller de JAXB con JAXBContext. Compruebe si JAXBcontext se ha inicializado correctamente.

WSITPVD0002.internal.server.error=WSITPVD0002: Proveedor de seguridad: se ha producido un error interno al intentar crear un elemento SOAPFault.

WSITPVD0003.problem.printing.msg=WSITPVD003: se ha producido un error al intentar imprimir el mensaje de SOAP. Puede que exista un problema de formato correcto con el c\u00F3digo XML del mensaje.

WSITPVD0004.opt.path.not.yet.supported=WSITPVD0004: la ruta de acceso optimizada a\u00FAn no est\u00E1 soportada.

WSITPVD0005.problem.proc.soap.message=WSITPVD0005: Proveedor de seguridad: se ha producido un error al convertir el mensaje de JAX-WS en un mensaje de SOAP SAAJ.

WSITPVD0006.problem.init.out.proc.context=WSITPVD0006: Proveedor de seguridad: se ha producido un error interno al inicializar el contexto de procesamiento de seguridad de salida.

WSITPVD0007.problem.getting.eff.boot.policy=WSITPVD0007: Proveedor de seguridad: se ha producido un error al intentar obtener la pol\u00EDtica de inicializaci\u00F3n de datos SecureConversation efectiva.

WSITPVD0008.problem.building.protocol.policy=WSITPVD0008: Proveedor de seguridad: se ha producido un error al intentar crear una pol\u00EDtica de seguridad efectiva para el mensaje de protocolo.

WSITPVD0009.unsupported.callback.type.encountered=WSITPVD0009: se ha encontrado un tipo de devoluci\u00F3n de llamada {0} no soportado.

WSITPVD0010.unknown.validator.type.config=WSITPVD0010: tipo de validador desconocido {0} en ConfigAssertion.

WSITPVD0011.could.not.find.user.class=WSITPVD0011: No se ha encontrado la clase de usuario: {0}.

WSITPVD0012.problem.checking.reliable.message.enable=WSITPVD0012: Error interno: no se ha podido detectar si los mensajes fiables est\u00E1n activados.

WSITPVD0013.sec.policy.not.configured=WSITPVD0013: SecurityPolicy no se ha configurado para la operaci\u00F3n {0}, pero se ha encontrado SecurityHeader.

WSITPVD0014.keystore.url.null.config.assertion=WSITPVD0014: la URL de KeyStore obtenida de ConfigAssertion es nula.

WSITPVD0015.keystore.password.null.config.assertion=WSITPVD0015: la contrase\u00F1a de KeyStore obtenida de ConfigAssertion es nula.

WSITPVD0016.truststore.url.null.config.assertion=WSITPVD0016: la URL de TrustStore obtenida de ConfigAssertion es nula.

WSITPVD0017.truststore.password.null.config.assertion=WSITPVD0017: la contrase\u00F1a de TrustStore obtenida de ConfigAssertion es nula.

WSITPVD0018.null.or.empty.xwss.callback.handler.classname=WSITPVD0018: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase xwssCallbackHandler.

WSITPVD0019.null.or.empty.username.handler.classname=WSITPVD0019: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase usernameHandler.

WSITPVD0020.null.or.empty.password.handler.classname=WSITPVD0020: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase passwordHandler.

WSITPVD0021.null.or.empty.saml.handler.classname=WSITPVD0021: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase samlHandler.

# {0} - validator name
WSITPVD0022.null.or.empty.validator.classname=WSITPVD0022: se ha definido un nombre de clase de validador nulo o vac\u00EDo para {0}

WSITPVD0023.could.not.load.callback.handler.class=WSITPVD0023: Error interno: no se ha podido cargar la clase CallbackHandler: {0}.

WSITPVD0024.null.client.auth.context=WSITPVD0024: Error: el contexto de autenticaci\u00F3n de cliente no se ha inicializado.

WSITPVD0025.null.packet=WSITPVD0025: Error interno: no se ha proporcionado a getAuthContext() el paquete necesario para iniciar una sesi\u00F3n segura.

WSITPVD0026.error.starting.sc=WSITPVD0026: error al iniciar SecureConversation.

# ACC = Application Client Container.
WSITPVD0027.error.populating.client.config.prop=WSITPVD0027: error al rellenar las propiedades de la configuraci\u00F3n de seguridad de un cliente de contenedor de clientes de aplicaciones o cliente web.

WSITPVD0028.error.init.auth.module=WSITPVD0028: error al inicializar el m\u00F3dulo de autenticaci\u00F3n.

WSITPVD0029.error.securing.outbound.msg=WSITPVD0029: error al proteger el mensaje saliente.

WSITPVD0030.no.policy.found.for.sc=WSITPVD0030: no se puede iniciar SecureConversation; no se ha encontrado ninguna afirmaci\u00F3n de SecureConversation en la pol\u00EDtica.

WSITPVD0031.invalid.callback.handler.class=WSITPVD0031: la clase CallbackHandler {0} especificada no es un valor javax.security.auth.callback.CallbackHandler v\u00E1lido

WSITPVD0032.error.configure.client.handler=WSITPVD0032: error al configurar el elemento CallbackHandler del cliente.

WSITPVD0033.error.validate.response=WSITPVD0033: excepci\u00F3n de SOAP al validar el mensaje de respuesta segura.

WSITPVD0034.faulty.response.msg=WSITPVD0034: Fallo en el mensaje de respuesta al validar: {0}.

WSITPVD0035.error.verify.inbound.msg=WSITPVD0035: error al verificar la seguridad del mensaje entrante.

WSITPVD0036.error.proc.req.packet=WSITPVD0036: error al procesar el paquete de solicitud al inicio de la conversaci\u00F3n segura.

WSITPVD0037.null.subject=WSITPVD0037: Error al desechar el asunto: valor nulo para el asunto.

WSITPVD0038.error.creating.new.instance.wsit.client.sec.pipe=WSITPVD0038: error al crear una nueva instancia del proveedor de seguridad del cliente de WSIT.

WSITPVD0039.error.processing.incoming.packet=WSITPVD0039: error al procesar el paquete entrante en el cliente de WSIT.

WSITPVD0040.error.clean.subject =WSITPVD0040: Error al desechar el asunto del contexto de autenticaci\u00F3n del cliente: valor nulo para el asunto.

#WSITPVD0041.error.verify.inbound.msg=WSITPVD0041: Error in Verifying Security in Inbound Message.

#WSITPVD0042.error.securing.outbound.msg=WSITPVD0042: Error in Securing Outbound Message.

WSITPVD0043.error.configure.server.handler=WSITPVD0043: error al configurar el elemento CallbackHandler de seguridad del servidor.

# RST = Request Security Token. SCT = Security Context Token.
WSITPVD0044.error.session.creation=WSITPVD0044: fallo al crear una sesi\u00F3n segura con la solicitud de emisi\u00F3n de token de seguridad de solicitud-token de contexto de seguridad.

WSITPVD0045.unsupported.operation.exception=WSITPVD0045: tipo de solicitud {0} no soportado para crear una sesi\u00F3n segura.

WSITPVD0046.error.invoke.sc.contract=WSITPVD0046: error al llamar al contrato de la conversaci\u00F3n segura.

WSITPVD0047.error.creating.new.instance.wsit.server.sec.pipe=WSITPVD0038: error al crear una nueva instancia del proveedor de seguridad del servidor de WSIT.

WSITPVD0048.error.populating.server.config.prop=WSITPVD0048: Proveedor de seguridad: error al rellenar las propiedades de configuraci\u00F3n de seguridad del servicio web.

WSITPVD0049.error.cancel.security.context.token=WSITPVD0049: error al cancelar el token de contexto de seguridad.

WSITPVD0050.error.secure.request=WSITPVD0050: error al proteger el mensaje de respuesta.
WSITPVD0051.null.or.empty.jmac.callback.handler.classname=WSITPVD0051: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase jmacCallbackHandler.
WSITPVD0052.error.issuedtoken.creation=WSITPVD0052: se ha recibido una excepci\u00F3n durante la creaci\u00F3n de IssuedToken.
WSITPVD0053.error.validate.request=WSITPVD0053: se ha producido un error al validar la solicitud
WSITPVD0054.error.secure.response=WSITPVD0054: error al proteger la respuesta
WSITPVD0055.ws.error.next.pipe=WSSPVD0055: error de servicio web al procesar el siguiente canal
WSITPVD0056.null.response=WSITPVD0056: la llamada al servicio ha devuelto un paquete de respuesta nula
WSITPVD0057.error.process.response=WSITPVD0057: error al procesar la respuesta
WSITPVD0058.error.secure.request=WSITPVD0058: error al proteger la solicitud
WSITPVD0059.jmac.factory.cannot.write.file=WSITPVD0059: Error: la f\u00E1brica de jmac no puede escribir en el archivo
WSITPVD0060.jmac.jmac.factory.unableto.load.provider=WSITPVD0060: la f\u00E1brica de jmac no puede cargar el proveedor {0}
WSITPVD0061.jmac.authconfig.loader.failure=WSITPVD0061: fallo del cargador de configuraci\u00F3n de autenticaci\u00F3n de jmac
WSITPVD0062.error.load.default.providers=WSITPVD0062: excepci\u00F3n al cargar los proveedores por defecto
WSITPVD0064.error.clean.subject=WSITPVD0064: error al limpiar el asunto
WSITPVD0065.error.resolving.alternatives=WSSPVD0065: error al resolver la pol\u00EDtica de fallos de la alternativa
WSITPVD0066.servlet.context.notfound=WSSPVD0066: no se ha encontrado ServletContext
#### Info, Fine and Warning messages ####
#### Codes starting from 1000+


