#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2017 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://oss.oracle.com/licenses/CDDL+GPL-1.1
# or LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes


#config from 100 to 120

WSS0100.createFor.creating.impl=WSS0100: m\u00E9todo Processor.createFor criando a inst\u00E2ncia de {0}



#Filter Messages from 121 to 299

#WSS0121.no.jce.provider=WSS0121: Unable to locate a JCE provider for {0}



WSS0126.unsupported.privatekey.type=WSS0126: tipo de PrivateKey n\u00E3o suportado

WSS0126.diag.cause.1=Tipo de algoritmo n\u00E3o suportado. S\u00F3 RSA \u00E9 suportado.

WSS0126.diag.check.1=Verifique se o algoritmo de assinatura \u00E9 RSA



WSS0127.unableto.sign.message=WSS0127: n\u00E3o \u00E9 poss\u00EDvel assinar a mensagem



WSS0128.unableto.encrypt.message=WSS0128: n\u00E3o \u00E9 poss\u00EDvel criptografar o elemento



WSS0129.no.dssignature.in.security.headerblock=WSS0129: n\u00E3o \u00E9 poss\u00EDvel recuperar o elemento ds:Signature do bloco do cabe\u00E7alho wsse:Security, obteve a Exce\u00E7\u00E3o [ {0} ]

WSS0129.diag.cause.1=Elemento ds:Signature da mensagem incorreto n\u00E3o encontrado do bloco do cabe\u00E7alho de wsse:Security

WSS0129.diag.check.1=Verifique se a assinatura adequada foi gerada ao assinar



WSS0131.dskeyinfo.doesnot.contain.refto.sectoken=WSS0131: ds:KeyInfo da mensagem n\u00E3o cont\u00E9m uma refer\u00EAncia para um token de seguran\u00E7a



WSS0133.exception.while.verifying.signature=WSS0133: exce\u00E7\u00E3o [ {0} ] ao verificar a assinatura


WSS0134.unableto.initialize.xml.cipher=WSS0134: n\u00E3o \u00E9 poss\u00EDvel inicializar a Cifra de XML

WSS0134.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel Inicializar XMLCipher com a Chave fornecida

WSS0134.diag.check.1=Verifique se XMLCipher foi inicializado adequadamente



WSS0135.unableto.encrypt.symmetric.key=WSS0135: Exce\u00E7\u00E3o [ {0} ] ao tentar criptografar a chave sim\u00E9trica



WSS0137.unableto.decrypt.message=WSS0137: exce\u00E7\u00E3o [ {0} ] ao tentar decriptografar a mensagem

WSS0137.diag.cause.1=Um provedor de JCE apropriado n\u00E3o foi configurado no JRE

WSS0137.diag.check.1=Verifique a exce\u00E7\u00E3o raiz para obter mais dicas



WSS0138.unableto.find.wsse.keyidentifier=WSS0138: n\u00E3o \u00E9 poss\u00EDvel localizar wsse:KeyIdentifier



WSS0139.unableto.find.matching.privatekey=WSS0139: exce\u00E7\u00E3o [ {0} ] ao tentar localizar o PrivateKey correspondente



WSS0140.encryptedkey.doesnot.contain.chiperdata=WSS0140: xenc:EncryptedKey da mensagem n\u00E3o cont\u00E9m xenc:CipherData/xenc:CipherValue



WSS0141.unableto.decrypt.symmetric.key=WSS0141: exce\u00E7\u00E3o [ {0} ] ao tentar decriptografar a chave sim\u00E9trica



WSS0144.unableto.decode.base64.data=WSS0144: exce\u00E7\u00E3o [ {0} ] ao tentar decodificar os dados codificados de Base64

WSS0144.diag.cause.1=A exce\u00E7\u00E3o de Base64Decoding \u00E9 a causa-raiz

WSS0144.diag.check.1=Verifique se os dados s\u00E3o codificados por base64



WSS0147.unableto.use.stylesheet=WSS0147: exce\u00E7\u00E3o [ {0} ] ao tentar usar a planilha de estilo

WSS0147.diag.cause.1=Exce\u00E7\u00E3o de TransformationConfiguration ao tentar usar a planilha de estilo para impress\u00E3o v\u00E1lida

WSS0147.diag.check.1=Certifique-se de que a planilha de estilo \u00E9 v\u00E1lida



WSS0148.unableto.process.soapmessage=WSS0148: exce\u00E7\u00E3o [ {0} ] ao processar SOAPMessage

WSS0148.diag.cause.1=Exce\u00E7\u00E3o ao tentar impress\u00E3o v\u00E1lida usando a transforma\u00E7\u00E3o

WSS0148.diag.check.1=Certifique-se de que a Mensagem SOAP e a planilha de estilo est\u00E3o corretas



WSS0156.exception.in.cert.validate=WSS0156: exce\u00E7\u00E3o [ {0} ] ao validar o certificado

WSS0156.diag.cause.1=Erro no certificado usado para valida\u00E7\u00E3o

WSS0156.diag.check.1=Verifique se o token cont\u00E9m um Certificado v\u00E1lido



WSS0161.unableto.find.matching.privatekey=WSS0161: n\u00E3o \u00E9 poss\u00EDvel localizar a PrivateKey correspondente



WSS0165.unable.to.encrypt=WSS0165: o XPath n\u00E3o corresponde a um elemento DOM

WSS0165.diag.cause.1=O XPath n\u00E3o corresponde a um elemento DOM

WSS0165.diag.check.1=Verifique se o n\u00F3 representado pelo XPath \u00E9 um elemento DOM v\u00E1lido



WSS0166.no.binary.security.token.in.header=WSS0166: n\u00E3o foi poss\u00EDvel recuperar um Token de Seguran\u00E7a Bin\u00E1rio necess\u00E1rio para Verificar a Assinatura do cabe\u00E7alho wsse:Security, obteve a Exce\u00E7\u00E3o [ {0} ]



WSS0167.signature.verification.failed=WSS0167: falha na Verifica\u00E7\u00E3o da Assinatura

WSS0167.diag.cause.1=Assinatura inv\u00E1lida; falha na verifica\u00E7\u00E3o

WSS0167.diag.check.1=Certifique-se de que a assinatura n\u00E3o foi violada em tr\u00E2nsito



WSS0168.failedto.generate.random.symmetrickey=WSS0168: exce\u00E7\u00E3o [ {0} ] ao tentar gerar a chave sim\u00E9trica aleat\u00F3ria

WSS0168.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel gerar uma chave sim\u00E9trica aleat\u00F3ria

WSS0168.diag.check.1=Verifique se o KeyGenerator foi inicializado adequadamente



WSS0169.token.not.set.parameter.list=WSS0169: o token a ser exportado n\u00E3o foi definido na Lista de Par\u00E2metros

WSS0169.diag.cause.1=O valor de FilterParameterConstants.BINARY_SEC_TOKEN n\u00E3o foi definido

WSS0169.diag.check.1=Verifique se a estrat\u00E9gia de refer\u00EAncia direta foi definida antes da exporta\u00E7\u00E3o do certificado



WSS0181.subject.not.authorized=WSS0181: a pessoa [ {0} ] n\u00E3o est\u00E1 autorizada

WSS0181.diag.cause.1=Indiv\u00EDduo n\u00E3o autorizado; falha na valida\u00E7\u00E3o

WSS0181.diag.check.1=Verifique se o usu\u00E1rio est\u00E1 autorizado 

 

WSS0182.referencelist.parameter.null=WSS0182: o par\u00E2metro xenc:Referencelist necess\u00E1rio pelo filtro DecryptReferenceList \u00E9 nulo.

WSS0182.diag.cause.1=O par\u00E2metro FilterParameterConstants.REFERENCE_LIST tem um valor nulo

WSS0182.diag.check.1=A lista de refer\u00EAncia que precisa ser decriptografada geralmente \u00E9 definida por ImportEncryptedKeyFilter



WSS0183.couldnot.locate.symmetrickey=WSS0183: a chave sim\u00E9trica necess\u00E1ria para decriptografia n\u00E3o foi encontrada.

WSS0183.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel localizar uma chave sim\u00E9trica necess\u00E1ria para decriptografia.

WSS0183.diag.check.1=O valor da chave sim\u00E9trica parece ser nulo. Verifique seu valor.



WSS0184.securitydomain.null=WSS0184: dom\u00EDnio de Seguran\u00E7a n\u00E3o definido da Mensagem

WSS0184.diag.cause.1=N\u00E3o foi poss\u00EDvel recuperar o dom\u00EDnio de seguran\u00E7a da mensagem SOAP do Securable

WSS0184.diag.check.1=Certifique-se de que a factory SecurityEnvironment definiu o ambiente de seguran\u00E7a correto.



WSS0185.filterparameter.not.set=WSS0185: par\u00E2metro [ {0} ] do filtro n\u00E3o definido

WSS0185.diag.cause.1=N\u00E3o foi poss\u00EDvel localizar o certificado associado \u00E0 estrat\u00E9gia de refer\u00EAncia direta

WSS0185.diag.check.1=Verifique se o URI \u00E9 v\u00E1lido e se o par\u00E2metro subjectkeyidentifier foi definido na configura\u00E7\u00E3o



WSS0186.certificate.not.found=WSS0186: nenhum identificador de chave foi definido (impl\u00EDcita ou explicitamente) e nenhum certificado pode ser encontrado no thread de chamada.



WSS0187.prefix.null=WSS0187: o prefixo n\u00E3o pode ser nulo

WSS0187.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel instanciar/inicializar o filtro com prefixo nulo



WSS0188.prefix.null=WSS0188: o namespace n\u00E3o pode ser nulo

WSS0188.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel instanciar/inicializar o filtro com namespace nulo



WSS0189.unsupported.data.decryption.algorithm=WSS0189: algoritmo de decriptografia de dados n\u00E3o suportado

WSS0189.diag.cause.1=Algoritmo de decriptografia de dados deve ser Triple-DES, AES128-CBC, AES256-CBC

WSS0189.diag.check.1=Verifique se o algoritmo de criptografia usado \u00E9 3DES, AES128_CBC, AES256_CBC



WSS0190.encryption.requirements.not.met=WSS0190: o n\u00FAmero de elementos criptografado \u00E9 menor que o obrigat\u00F3rio/permitido

WSS0190.diag.cause.1=O n\u00FAmero de elementos criptografado \u00E9 menor que o obrigat\u00F3rio/permitido

WSS0190.diag.check.1=Verifique se as refer\u00EAncias de dados de criptografia (na mensagem) correspondem aos requisitos



WSS0191.symmetrickey.not.set=WSS0191: SymmetricKey n\u00E3o definido para criptografia 

WSS0191.diag.cause.1=Um SymmetricKey n\u00E3o foi gerado anteriormente, isto \u00E9 definido no thread de chamada

WSS0191.diag.cause.2=O KeyName especificado n\u00E3o p\u00F4de localizar uma chave no ambiente de seguran\u00E7a

WSS0191.diag.check.1=Verifique se ExportEncryptedKeyFilter foi chamado antes 

WSS0191.diag.check.2=Verifique se um URL da \u00C1rea de Armazenamento de Chaves v\u00E1lido \u00E9 usado para instanciar o SecurityEnvironment e se ele cont\u00E9m um SecretKey correspondente



WSS0192.encryption.targets.not.specified=WSS0192: alvos de criptografia n\u00E3o especificados

WSS0192.diag.cause.1=Pelo menos um alvo precisa ser especificado para criptografia

WSS0192.diag.check.1=Verifique se uma lista de alvos n\u00E3o nulos \u00E9 usada para instanciar o filtro



WSS0193.invalid.target=WSS0193: o alvo n\u00E3o corresponde a uma parte da mensagem v\u00E1lida

WSS0193.diag.cause.1=O alvo especificado n\u00E3o corresponde a uma parte da mensagem v\u00E1lida

WSS0193.diag.check.1=Verifique se um XPath/QName/wsuId v\u00E1lido foi especificado



WSS0194.illegal.target=WSS0194: n\u00E3o \u00E9 poss\u00EDvel criptografar: {0}

WSS0194.diag.cause.1=SOAP-ENV:o cabe\u00E7alho n\u00E3o pode ser totalmente criptografado

WSS0194.diag.cause.2=SOAP-ENV:o corpo n\u00E3o pode ser totalmente criptografado

WSS0194.diag.check.1=Verifique se um XPath/QName/wsuId v\u00E1lido foi especificado conforme a especifica\u00E7\u00E3o.



WSS0195.referencelist.not.set=WSS0195: ReferenceListBlock n\u00E3o definido no thread de chamada

WSS0195.diag.cause.1=ReferenceListBlock n\u00E3o definido no thread de chamada

# Usage not found. TODO Remove
#WSS0195.diag.check.1=Check that ExportEncryptedKeyFilter is called before
# Usage not found. TODO Remove
#WSS0195.diag.check.2=Check that ExportReferenceListFilter is called before



WSS0196.securityenvironment.not.set=WSS0196: SecurityEnvironment n\u00E3o definido em SecurableSoapMessage

WSS0196.diag.cause.1=Uma inst\u00E2ncia da classe SecurityEnvironment do ambiente operacional n\u00E3o foi definida em SecurableSoapMessage

WSS0196.diag.check.1=Verifique se SetSecurityEnvironmentFilter foi processado na mensagem antes 



WSS0197.keyinfostrategy.null=WSS0197: KeyInfoStrategy deve ser n\u00E3o nulo

WSS0197.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel instanciar o filtro com KeyInfoStrategy nulo



WSS0198.unsupported.signature.algorithm=WSS0198: Algoritmo: {0} de Assinatura N\u00E3o Suportado

WSS0198.diag.cause.1=S\u00F3 o algoritmo de Assinatura RSA_SHA1 \u00E9 suportado

WSS0198.diag.check.1=Verifique se o algoritmo de assinatura RSA_SHA1 foi especificado



WSS0199.null.creation.time=WSS0199: o hor\u00E1rio de cria\u00E7\u00E3o do timestamp n\u00E3o pode ser nulo

WSS0199.diag.cause.1=O hor\u00E1rio de cria\u00E7\u00E3o do timestamp n\u00E3o pode ser nulo

WSS0199.diag.check.1=Verifique se o hor\u00E1rio de cria\u00E7\u00E3o n\u00E3o nulo \u00E9 usado para instanciar o filtro



WSS0200.ineffective.callback.handler=WSS0200: XWSSCallbackHandler Ineficiente

WSS0200.diag.cause.1=O CallbackHandler para obter o Nome do usu\u00E1rio/Senha no runtime era ineficiente



# {0} - most likely an exception message
WSS0201.ineffective.callback.handler=WSS0201: XWSSCallbackHandler Ineficiente em decorr\u00EAncia de: {0}

WSS0201.diag.cause.1=O CallbackHandler para obter o Nome do usu\u00E1rio no runtime era ineficiente



WSS0202.missing.security.header=WSS0202: Nenhum elemento wsse:Security na mensagem

WSS0202.diag.cause.1=Nenhum wsse:Security na mensagem



WSS0203.policy.violation.exception=WSS0203: elemento {0} inesperado no cabe\u00E7alho

WSS0203.diag.cause.1=Bloco do cabe\u00E7alho correspondente ao requisito desejado n\u00E3o encontrado

WSS0203.diag.check.1=Verifique se a mensagem atende aos requisitos de seguran\u00E7a 



WSS0204.illegal.header.block=WSS0204: elemento {0} inesperado no cabe\u00E7alho

WSS0204.diag.cause.1=Bloco do cabe\u00E7alho de seguran\u00E7a inv\u00E1lido encontrado no cabe\u00E7alho de seguran\u00E7a

WSS0204.diag.check.1=Verifique se a mensagem \u00E9 compat\u00EDvel com a especifica\u00E7\u00E3o de Seguran\u00E7a SOAP



WSS0205.policy.violation.exception=WSS0205: requisito para wsu:Timestamp n\u00E3o atendido

WSS0205.diag.cause.1=O requisito para wsu:Timestamp n\u00E3o foi atendido

WSS0205.diag.check.1=Verifique se a mensagem atende aos requisitos de seguran\u00E7a



WSS0206.policy.violation.exception=WSS0206: a seguran\u00E7a na mensagem de entrada n\u00E3o atende \u00E0 SecurityPolicy configurada no Destinat\u00E1rio.
WSS0206.diag.cause.1=A mensagem de entrada n\u00E3o cont\u00E9m a seguran\u00E7a obrigat\u00F3ria.

WSS0206.diag.check.1=Verifique se a seguran\u00E7a na mensagem de entrada corresponde \u00E0 pol\u00EDtica de seguran\u00E7a configurada no Destinat\u00E1rio



WSS0207.unsupported.operation.exception=WSS0207: opera\u00E7\u00E3o n\u00E3o suportada no objeto de chamada

WSS0207.diag.cause.1=Opera\u00E7\u00E3o n\u00E3o suportada no objeto de chamada



WSS0208.policy.violation.exception=WSS0208: foi detectada seguran\u00E7a extra al\u00E9m da exigida 

WSS0208.diag.cause.1=Seguran\u00E7a extra que a exigida pela pol\u00EDtica do receptor encontrada na mensagem

WSS0208.diag.check.1=Verifique se a mensagem atende rigorosamente aos requisitos de seguran\u00E7a



WSS0209.unexpected.header.block=WSS0209: esperava {0}; encontrou {1} no cabe\u00E7alho de seguran\u00E7a

WSS0209.diag.cause.1=O filtro da mensagem est\u00E1 configurado incorretamente para processar uma mensagem de entrada

WSS0209.diag.check.1=Verifique se os filtros est\u00E3o configurados corretamente para processar mensagens de entrada



WSS0210.unsupported.key.encryption.algorithm=WSS0210: algoritmo: {0} de Criptografia de Chave N\u00E3o Suportado

WSS0210.diag.cause.1=S\u00F3 o Algoritmo de Criptografia da Chave RSAv1.5 \u00E9 suportado

WSS0210.diag.check.1=Verifique se o Algoritmo de Criptografia de Chave usado na mensagem de entrada \u00E9 RSAv1.5



WSS0211.error.decrypting.key=WSS0211: erro ao decriptografar a chave de criptografia

WSS0211.diag.cause.1=S\u00F3 as Chaves TripleDES s\u00E3o suportadas



WSS0212.policy.violation.exception=WSS0212: requisito do receptor para senha compilada n\u00E3o atendido

WSS0212.diag.cause.1=Requisito do receptor para senha compilada em UsernameToken n\u00E3o atendido

WSS0212.diag.check.1=Verifique se a mensagem atende aos requisitos de seguran\u00E7a



WSS0213.policy.violation.exception=WSS0213: requisito do receptor para usar nonce n\u00E3o atendido

WSS0213.diag.cause.1=Requisito do receptor para nonce em UsernameToken n\u00E3o atendido

WSS0213.diag.check.1=Verifique se a mensagem atende aos requisitos de seguran\u00E7a



WSS0214.failed.sender.authentication=WSS0214: falha na Autentica\u00E7\u00E3o de UsernameToken

WSS0214.diag.cause.1=Par de Nome do usu\u00E1rio/Senha inv\u00E1lido no token



WSS0215.failed.propertycallback=WSS0215: falha de handler ao tratar PropertyCallback, obteve a Exce\u00E7\u00E3o

WSS0215.diag.cause.1=a chamada de handle() para um PropertyCallback no handler gerou uma exce\u00E7\u00E3o

WSS0215.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler 



WSS0216.callbackhandler.handle.exception=WSS0216: ocorreu um Erro ao usar CallbackHandler para: {0}

WSS0216.diag.cause.1=a chamada de handle() no handler gerou uma exce\u00E7\u00E3o

WSS0216.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler 



WSS0217.callbackhandler.handle.exception.log=WSS0217: ocorreu um Erro ao usar o M\u00E9todo handle() de CallbackHandler handle().

WSS0217.diag.cause.1=a chamada de handle() no handler gerou uma exce\u00E7\u00E3o

WSS0217.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler 



WSS0218.cannot.locate.default.cert=WSS0218: n\u00E3o \u00E9 poss\u00EDvel localizar um certificado default usando CallbackHandler. Se estiver usando WSIT, certifique-se de que as asser\u00E7\u00F5es da \u00C1rea de Armazenamento de Chaves/\u00C1rea de Armazenamento Confi\u00E1vel est\u00E3o presentes em wsit-client.xml/wsit-*.xml.

WSS0218.diag.cause.1=falha na chamada de handle() ao definir o Callback

WSS0218.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler para SignatureKeyCallback.DefaultPrivKeyCertRequest



WSS0219.cannot.locate.default.privkey=WSS0219: n\u00E3o \u00E9 poss\u00EDvel localizar uma chave privada default usando CallbackHandler

WSS0219.diag.cause.1=falha na chamada de handle() ao definir o Callback

WSS0219.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler para SignatureKeyCallback.DefaultPrivKeyCertRequest



WSS0220.cannot.locate.symmetrickey.for.decrypt=WSS0220: n\u00E3o \u00E9 poss\u00EDvel localizar a chave sim\u00E9trica para decriptografia usando CallbackHandler

WSS0220.diag.cause.1=falha na chamada de handle() ao definir o Callback

WSS0220.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler para DecryptionKeyCallback.AliasSymmetricKeyRequest



# {0} - "Signature"/"Key Encryption"/client name/alias name e.g.: Unable to locate matching certificate for xws-security-server using CallbackHandler.
WSS0221.cannot.locate.cert=WSS0221: n\u00E3o \u00E9 poss\u00EDvel localizar o certificado correspondente para {0} usando CallbackHandler.

WSS0221.diag.cause.1=falha na chamada de handle() ao definir o Callback

WSS0221.diag.check.1=Verifique a implementa\u00E7\u00E3o do handler para SignatureKeyCallback e/ou EncryptionKeyCallback, verifique as \u00E1reas de armazenamento de chave e \u00E1reas de armazenamento confi\u00E1vel



# {0} - "Signature"/"Key Encryption"/client name/alias name e.g.: Unable to locate matching certificate for xws-security-server using CallbackHandler.
WSS0222.cannot.locate.privkey=WSS0222: n\u00E3o \u00E9 poss\u00EDvel localizar a chave privada correspondente para {0} usando CallbackHandler.

WSS0222.diag.cause.1=falha na chamada de handle() ao definir o Callback

WSS0222.diag.check.1=Verifique o caminho da \u00E1rea de armazenamento de chave e certifique-se de que as chaves corretas est\u00E3o presentes


WSS0223.failed.certificate.validation=WSS0223: falha na valida\u00E7\u00E3o do certificado

WSS0224.unsupported.AssociatedSubject=WSS0224: este ambiente n\u00E3o tem um Assunto associado

WSS0225.failed.PasswordValidationCallback=WSS0225: exce\u00E7\u00E3o no Callback de Valida\u00E7\u00E3o de Senha

WSS0226.failed.Validating.DefaultCreationTime=WSS0226: ocorreu um Erro ao fazer parse do hor\u00E1rio de cria\u00E7\u00E3o default no formato de Data.

WSS0227.invalid.older.CreationTime=WSS0227: o hor\u00E1rio de cria\u00E7\u00E3o \u00E9 anterior a (currenttime-timestamp-freshness-limit-max-clock-skew)

WSS0228.invalid.ahead.CreationTime=WSS0227: o hor\u00E1rio de cria\u00E7\u00E3o \u00E9 posterior ao hor\u00E1rio atual

WSS0229.failed.Validating.TimeStamp=WSS0229: ocorreu uma exce\u00E7\u00E3o ao validar o Timestamp

WSS0230.unsupported.Validating.SAMLIssuer=WSS0230: valida\u00E7\u00E3o do Emissor SAML ainda n\u00E3o suportada.

WSS0231.unsupported.Validating.SAMLUser=WSS0231: valida\u00E7\u00E3o do Usu\u00E1rio SAML ainda n\u00E3o suportada.

WSS0232.expired.Message=WSS0232: Mensagem Expirada

WSS0233.invalid.expire.before.creation=WSS0233: o hor\u00E1rio de Expira\u00E7\u00E3o \u00E9 anterior ao de Cria\u00E7\u00E3o

WSS0234.failed.Validate.SAMLAssertion=WSS0234: ocorreu um Erro ao Validar a Asser\u00E7\u00E3o SAML na Pol\u00EDtica.

WSS0235.failed.locate.SAMLAssertion=WSS0235: falha ao localizar a Asser\u00E7\u00E3o SAML

WSS0236.null.SAMLAssertion=WSS0236: Asser\u00E7\u00E3o SAML n\u00E3o definida na Pol\u00EDtica pelo CallbackHandler.

WSS0237.failed.DynamicPolicyCallback=WSS0237: ocorreu um Erro ao preencher a Pol\u00EDtica de SAML no Callback de Pol\u00EDtica Din\u00E2mica

WSS0238.failed.Resolve.SAMLAssertion=WSS0238: falha ao resolver a Asser\u00E7\u00E3o SAML

WSS0239.failed.process.SecurityTokenReference=WSS0239: falha ao processar a Refer\u00EAncia de Token de Seguran\u00E7a

WSS0240.invalid.EncryptedKeySHA1.reference=WSS0240: refer\u00EAncia EncryptedKeySHA1 incorreta

WSS0241.unableto.set.EKSHA1.OnContext=WSS0241: falha ao definir o valor de EKSHA1 nas propriedades de Contexto

# SCT = Security Context Token.
WSS0242.unableto.locate.SCT=WSS0242: falha ao localizar o SCT com o ID fornecido

WSS0243.invalid.valueType.NonSCTToken=WSS0243: ValueType incorreto especificado para um Token N\u00E3o SCT

WSS0244.invalid.level.DKT=WSS0244: um Token de Chave derivado deve ser um bind de chave de n\u00EDvel superior

WSS0245.failed.resolve.SecurityToken=WSS0245: exce\u00E7\u00E3o ao tentar resolver o token de seguran\u00E7a

WSS0246.unableto.locate.SecureConversationSession=WSS0246: n\u00E3o foi poss\u00EDvel localizar a sess\u00E3o SecureConversation para o Id

WSS0247.failed.resolve.DerivedKeyToken=WSS0247: falha ao resolver o Token da Chave Derivada

WSS0248.null.STR=WSS0248: Token de DerivedKey Inv\u00E1lido encontrado; nenhum STR encontrado

WSS0249.unsupported.TokenType.DKT=WSS0249: TokenType n\u00E3o suportado no Token DerivedKey

WSS0250.failed.process.STR=WSS0250: falha ao processar a refer\u00EAncia do token de Seguran\u00E7a

WSS0251.invalid.SecurityPolicyInstance=WSS0251: a inst\u00E2ncia SecurityPolicy deve ser do tipo WSSPolicy OU MessagePolicy OU DynamicSecurityPolicy

WSS0252.failedto.getChildElement=WSS0252: falha ao obter o elemento filho

WSS0253.invalid.Message=WSS0253: a mensagem n\u00E3o atende \u00E0 pol\u00EDtica configurada: nenhum Cabe\u00E7alho de Seguran\u00E7a encontrado na mensagem

WSS0254.failedto.process.primaryORsecondary.policy=WSS0254: falha ao processar a Pol\u00EDtica Prim\u00E1ria ou Secund\u00E1ria

WSS0255.invalid.configuredPolicy.Timestamp=WSS0255: o timestamp n\u00E3o foi encontrado na pol\u00EDtica configurada, apenas na mensagem

WSS0256.failed.configure.ASC=WSS0256: exce\u00E7\u00E3o ao tentar configurar a Configura\u00E7\u00E3o de Seguran\u00E7a da Aplica\u00E7\u00E3o

WSS0257.failedto.append.SecurityPolicy.MessagePolicy=WSS0257: falha ao anexar a pol\u00EDtica de seguran\u00E7a na pol\u00EDtica da mensagem

WSS0258.invalid.requirements=WSS0258: mais requisitos do Receptor especificados que os presentes na mensagem

WSS0259.invalid.SEC.username=WSS0259: mais de um elemento wsse:UsernameToken presente no cabe\u00E7alho de seguran\u00E7a

WSS0260.invalid.DSP=WSS0260: pol\u00EDtica de seguran\u00E7a din\u00E2mica inv\u00E1lida retornada pelo handler de callback

WSS0261.invalid.Message.policyset=WSS0261: a mensagem n\u00E3o atende \u00E0 pol\u00EDtica configurada. O conjunto de pol\u00EDticas n\u00E3o est\u00E1 presente nos requisitos do receptor

WSS0262.invalid.Message.policytype=WSS0262: a mensagem n\u00E3o atende \u00E0 pol\u00EDtica configurada. O conjunto de pol\u00EDticas n\u00E3o est\u00E1 presente nos requisitos do receptor

WSS0263.invalid.Message.policy=WSS0263: a mensagem n\u00E3o atende \u00E0 pol\u00EDtica configurada

WSS0264.failedto.first.primary.policy=WSS0265: falha ao obter a Primeira Pol\u00EDtica Principal

WSS0265.error.primary.policy=WSS0265: ocorreu Viola\u00E7\u00E3o da Pol\u00EDtica Principal

WSS0266.failedto.process.secondary.policy=WSS0266: falha ao processar a Pol\u00EDtica Secund\u00E1ria

WSS0267.invalid.configuredPolicy.Username=WSS0267: erro na Verifica\u00E7\u00E3o da Pol\u00EDtica; UsernameToken n\u00E3o encontrado na pol\u00EDtica configurada, apenas na mensagem

WSS0268.error.policy.verification=WSS0268: erro na verifica\u00E7\u00E3o da Pol\u00EDtica; Elemento de Assinatura N\u00E3o Encontrado

WSS0269.error.Encryptionpolicy.verification=WSS0269: erro de verifica\u00E7\u00E3o da Pol\u00EDtica de Criptografia; elemento de criptografia n\u00E3o encontrado

WSS0270.failedto.get.SecurityPolicy.MessagePolicy=WSS0270: falha ao obter a pol\u00EDtica de seguran\u00E7a da pol\u00EDtica da mensagem

WSS0271.failedto.resolve.policy=WSS0271: a pol\u00EDtica deve ser resolvida para MessagePolicy

WSS0272.failedto.derefer.targets=WSS0272: falha ao Cancelar a refer\u00EAncia dos alvos

WSS0273.failedto.process.policy=WSS0273: falha ao processar a pol\u00EDtica de mensagens

WSS0274.invalid.SEC.Timestamp=WSS0274: mais de um elemento wsu:Timestamp presente no cabe\u00E7alho de seguran\u00E7a

WSS0275.invalid.policy.NoUsername.SecHeader=WSS0275: a mensagem n\u00E3o atende \u00E0 pol\u00EDtica configurada. O elemento UsernameToken n\u00E3o foi encontrado no cabe\u00E7alho de seguran\u00E7a

WSS0276.invalid.policy.NoTimestamp.SecHeader=WSS0276: a mensagem n\u00E3o atende \u00E0 pol\u00EDtica configurada. O elemento Timestamp n\u00E3o foi encontrado no cabe\u00E7alho de seguran\u00E7a

WSS0277.invalid.AddtionalSEC.Message.policy=WSS0277: a mensagem encontrada n\u00E3o atende \u00E0 seguran\u00E7a Adicional da pol\u00EDtica configurada exigida

WSS0278.failedto.get.localName=WSS0278: exce\u00E7\u00E3o ao obter localName de SOAPElement

WSS0279.failed.check.secSecurity=WSS0279: falha ao verificar a Seguran\u00E7a Secund\u00E1ria Extra

WSS0280.failed.create.UsernameToken=WSS0280: exce\u00E7\u00E3o ao tentar criar o token do nome do usu\u00E1rio

WSS0281.unsupported.operation=WSS0281: 'opera\u00E7\u00E3o getTokenValue() n\u00E3o suportada no UsernameToken'

WSS0282.unsupported.KeyIdentifier.Reference.DKT=WSS0282: KeyIdentifierReference n\u00E3o suportada em DerivedKey

WSS0283.unsupported.ReferenceType.DKT=WSS0283: ReferenceType N\u00E3o Suportada em DerivedKey

WSS0284.WSS.SOAP.Fault.Exception=WSS0284: ocorreu uma Exce\u00E7\u00E3o de Falha de SOAP


WSS0285.error.NoElement=WSS0285: n\u00E3o existe elementos com Id/WsuId

WSS0286.invalid.NoofElements=WSS0286: existe mais de um elemento com Id/WsuId

WSS0287.error.extracting.attachmentpart=WSS0287: exce\u00E7\u00E3o ao tentar extrair a parte do anexo

WSS0288.failed.getMessageParts.Qname=WSS0288: falha ao obter as Partes da Mensagem que usam targetype de QName

WSS0289.failed.getMessageParts.XPath=WSS0289: falha ao obter as Partes da Mensagem que usam targettype de XPath

WSS0290.failed.getMessageParts.URI=WSS0290: falha ao obter as Partes da Mensagem que usam targettype de URI

WSS0291.unsupported.operation.getAttachment=WSS0291: Anexo da Opera\u00E7\u00E3o de obten\u00E7\u00E3o N\u00E3o Suportado

WSS0292.unsupported.operation.removeAttachment=WSS0291: Anexo da Opera\u00E7\u00E3o de remo\u00E7\u00E3o N\u00E3o Suportado

WSS0293.failed.RSAKeyValue=WSS0293: exce\u00E7\u00E3o ao tentar obter o Valor de Chave de RSA

WSS0294.failed.X509Data=WSS0294: exce\u00E7\u00E3o ao tentar adicionar o Certificado X509 nos Dados X509

WSS0295.password.val.not.config.username.val=WSS0295: erro - nenhum PasswordValidator Configurado para Valida\u00E7\u00E3o de UsernameToken.

WSS0296.null.chain.cert=WSS0296: erro - cadeia de certificado vazia retornada por PrivateKeyCallback.

WSS0298.X509.expired=WSS0298: X509Certificate Expirado.

WSS0299.X509.notValid=WSS0299: falha na Validade do Certificado X509.


#WSS Messages from 300 to 399

WSS0300.no.jce.provider=WSS0300: n\u00E3o \u00E9 poss\u00EDvel localizar um provedor de JCE para {0}

WSS0301.unableto.decode.data=WSS0301: n\u00E3o \u00E9 poss\u00EDvel decodificar os dados do token

WSS0301.diag.cause.1=Dados incorreto. Erro de codifica\u00E7\u00E3o de Base64

WSS0301.diag.check.1=Verifique se os dados s\u00E3o codificados por base64



WSS0302.unableto.create.x509cert=WSS0302: n\u00E3o \u00E9 poss\u00EDvel criar X509Certificate dos dados no token

WSS0302.diag.cause.1=Problema de parse do certificado

WSS0302.diag.check.1=O fluxo de dados usado para criar o certificado x509 pode estar danificado



WSS0303.unableto.get.encoded.x509cert=WSS0303: n\u00E3o \u00E9 poss\u00EDvel obter representa\u00E7\u00E3o codificada de X509Certificate

WSS0303.diag.cause.1=Exce\u00E7\u00E3o de codifica\u00E7\u00E3o do certificado

WSS0303.diag.check.1=Verifique se os dados de x509 s\u00E3o v\u00E1lidos. N\u00E3o foi poss\u00EDvel extrair bytes brutos dele.



WSS0304.message.doesnot.contain.header=WSS0304: a mensagem n\u00E3o cont\u00E9m um Cabe\u00E7alho



WSS0305.message.doesnot.contain.secheaderblock=WSS0305: a mensagem n\u00E3o cont\u00E9m o bloco do cabe\u00E7alho wsse:Security



WSS0306.invalid.passwd.type=WSS0306: tipo de senha inv\u00E1lido. Deve ser um {0} ou {1}

WSS0306.diag.cause.1=Tipo de senha inv\u00E1lido

WSS0306.diag.check.1=O tipo de senha deve corresponder ao especificado pela especifica\u00E7\u00E3o WSS



WSS0307.nonce.enctype.invalid=WSS0307: tipo de codifica\u00E7\u00E3o de nonce inv\u00E1lido

WSS0307.diag.cause.1=Falha na verifica\u00E7\u00E3o de namespace de codifica\u00E7\u00E3o de nonce

WSS0307.diag.check.1=O namespace do tipo de codifica\u00E7\u00E3o de nonce \u00E9 inv\u00E1lido



WSS0308.couldnot.decode.hex.nonce=WSS0308: exce\u00E7\u00E3o [ {0} ] ao decodificar o nonce hexadecimal



WSS0309.couldnot.decode.base64.nonce=WSS0309: exce\u00E7\u00E3o [ {0} ] ao decodificar o nonce base64



WSS0310.no.such.algorithm=WSS0310: {0}, nenhum algoritmo encontrado

WSS0310.diag.cause.1=NoSuchAlgorithmException: algoritmo inv\u00E1lido

WSS0310.diag.check.1=Verifique se o algoritmo informado ao SecureRandom \u00E9 v\u00E1lido



WSS0311.passwd.digest.couldnot.be.created=WSS0311: Exce\u00E7\u00E3o [ {0} ] ao criar a Compila\u00E7\u00E3o de Senha.

WSS0311.diag.cause.1=A compila\u00E7\u00E3o de senha n\u00E3o p\u00F4de ser criada 

WSS0311.diag.check.1=Verifique se o algoritmo informado ao MessageDigest \u00E9 v\u00E1lido

 

WSS0312.exception.in.certpath.validate=WSS0312: exce\u00E7\u00E3o [ {0} ] ao validar certPath



WSS0313.cert.is.null=WSS0313: o Certificado \u00E9 nulo



WSS0314.cert.not.trusted.remote.cert=WSS0314: o certificado n\u00E3o \u00E9 um certificado remoto confi\u00E1vel



WSS0315.not.a.cert.entry=WSS0315: a entrada da \u00C1rea de Armazenamento de Chaves com o alias={0} n\u00E3o \u00E9 uma entrada certificada



WSS0316.enctype.invalid=WSS0316: tipo de codifica\u00E7\u00E3o inv\u00E1lido

WSS0316.diag.cause.1=O tipo de Codifica\u00E7\u00E3o do Token BinarySecurity \u00E9 inv\u00E1lido

WSS0316.diag.check.1=Verifique se o valor de codifica\u00E7\u00E3o para BinarySecurityToken \u00E9 v\u00E1lido, conforme especifica\u00E7\u00E3o.



# {0} - most likely an exception message
WSS0317.cannot.find.x509cert.because=WSS0317: n\u00E3o \u00E9 poss\u00EDvel localizar X509Certificate em decorr\u00EAncia de {0}

WSS0317.diag.cause.1=N\u00E3o foi poss\u00EDvel localizar o certificado X.509

WSS0317.diag.check.1=Verifique se o caminho do certificado n\u00E3o est\u00E1 vazio e se o tipo de certificado est\u00E1 correto



WSS0318.exception.while.creating.keyinfoblock=WSS0318: exce\u00E7\u00E3o ao construir o bloco do Cabe\u00E7alho de KeyInfo

WSS0318.diag.cause.1=Erro ao fazer parse e criar a inst\u00E2ncia de KeyInfo

WSS0318.diag.check.1=Verifique os valores informados para o construtor KeyInfo



WSS0319.exception.adding.keyname=WSS0319: exce\u00E7\u00E3o ao adicionar o keyname ao bloco do Cabe\u00E7alho de KeyInfo

WSS0319.diag.cause.1=N\u00E3o foi poss\u00EDvel adicionar o keyname ao bloco do Cabe\u00E7alho de KeyInfo

WSS0319.diag.check.1=Verifique se KeyInfo e KeyName foram instanciados sem exce\u00E7\u00F5es



WSS0320.exception.getting.keyname=WSS0320: exce\u00E7\u00E3o ao obter o keyname do bloco do Cabe\u00E7alho de KeyInfo

WSS0320.diag.cause.1=N\u00E3o foi poss\u00EDvel obter KeyName de KeyInfo

WSS0320.diag.check.1=Certifique-se de que KeyName exista em KeyInfo 



WSS0321.exception.converting.keyinfo.tosoapelem=WSS0321: exce\u00E7\u00E3o ao converter o bloco do Cabe\u00E7alho de KeyInfo para SOAPElement

WSS0321.diag.cause.1=N\u00E3o foi poss\u00EDvel recuperar o elemento de KeyInfo ou importar o n\u00F3

WSS0321.diag.check.1=Verifique o elemento a ser convertido para SOAPElement



WSS0322.exception.creating.signatureblock=WSS0322: exce\u00E7\u00E3o ao criar o bloco do Cabe\u00E7alho de Assinatura

WSS0322.diag.cause.1=Exce\u00E7\u00E3o ao fazer parse e criar o elemento Signature

WSS0322.diag.check.1=Verifique se uma Assinatura XML totalmente inicializada foi informada



WSS0323.exception.while.signing=WSS0323: exce\u00E7\u00E3o ao assinar

WSS0323.diag.cause.1=Exce\u00E7\u00E3o ao tentar assinar

WSS0323.diag.check.1=Verifique a chave usada para assinar



WSS0324.exception.in.getting.signaturevalue=WSS0324: exce\u00E7\u00E3o ao obter SignatureValue

WSS0324.diag.cause.1=N\u00E3o foi poss\u00EDvel recuperar bytes de valor da Assinatura

WSS0324.diag.check.1=Verifique a causa da falha de getSignatureValue da implementa\u00E7\u00E3o de DSIG de XML



WSS0325.exception.adding.reference.to.signedinfo=WSS0325: exce\u00E7\u00E3o ao adicionar uma Refer\u00EAncia para SignedInfo

WSS0325.diag.cause.1=Exce\u00E7\u00E3o ao adicionar uma Refer\u00EAncia com URI, transforma\u00E7\u00F5es e URI do algoritmo de Compila\u00E7\u00E3o ao SignedInfo

WSS0325.diag.check.1=Verifique se os valores informados ao construtor de XMLSignature.addDocument informados para implementa\u00E7\u00E3o Dsig de XML est\u00E3o corretos



WSS0326.exception.verifying.signature=WSS0326: exce\u00E7\u00E3o ao verificar a assinatura

WSS0326.diag.cause.1=N\u00E3o foi poss\u00EDvel validar a assinatura com base na chave p\u00FAblica do certificado informado

WSS0326.diag.check.1=Verifique se a mensagem foi assinada usando a chave privada correspondente e n\u00E3o foi violada



WSS0327.exception.converting.signature.tosoapelement=WSS0327: exce\u00E7\u00E3o ao converter o bloco de assinatura para SOAPElement

WSS0327.diag.cause.1=N\u00E3o foi poss\u00EDvel recuperar o elemento de Signature ou importar o n\u00F3

WSS0327.diag.check.1=Verifique o elemento a ser convertido para SOAPElement



WSS0328.error.parsing.creationtime=WSS0328: erro ao fazer parse do hor\u00E1rio de cria\u00E7\u00E3o

WSS0328.diag.cause.1=Erro ao fazer parse da data. 

WSS0328.diag.check.1=Verifique se o formato de data est\u00E1 em UTC. Verifique se \u00E9 "aaaa-MM-dd'T'HH:mm:ss'Z'" ou "aaaa-MM-dd'T'HH:mm:ss'.'sss'Z'" 



WSS0329.usernametoken.expected=WSS0329: esperava o Elemento UsernameToken, mas encontrou [ {0} ]

WSS0329.diag.cause.1=Esperando o Elemento UsernameToken

WSS0329.diag.check.1=Verifique se o pr\u00F3ximo elemento \u00E9 UsernameToken



WSS0330.usernametoken.firstchild.mustbe.username=WSS0330: o primeiro filho de um Elemento UsernameToken deve ser um Username

WSS0330.diag.cause.1=Username n\u00E3o \u00E9 o primeiro filho de UsernameToken

WSS0330.diag.check.1=Certifique-se de que o filho de wsse:UsernameToken seja Username no namespace wsse



WSS0331.invalid.usernametoken=WSS0331: o elemento informado n\u00E3o era um SOAPElement ou n\u00E3o \u00E9 um UsernameToken adequado

WSS0331.diag.cause.1=O elemento n\u00E3o pode ser um UsernameToken adequado

WSS0331.diag.check.1=Verifique se o UsernameToken corresponde ao esquema de token



WSS0332.usernametoken.null.username=WSS0332: o token do Username n\u00E3o cont\u00E9m o nome do usu\u00E1rio

WSS0332.diag.cause.1=O nome do usu\u00E1rio era nulo

WSS0332.diag.check.1=Verifique se o UsernameToken cont\u00E9m um Username v\u00E1lido



WSS0333.javax.net.ssl.keyStore.notset=WSS0333: propriedade javax.net.ssl.keyStore obrigat\u00F3ria para inicializar o Ambiente de Seguran\u00E7a n\u00E3o definido

WSS0333.diag.cause.1=O URL da \u00C1rea de Armazenamento de Chaves \u00E9 nulo

WSS0333.diag.check.1=Verifique se a propriedade javax.net.ssl.keyStore foi definida adequadamente



WSS0334.unsupported.keyidentifier=WSS0334:o Tipo de Refer\u00EAncia KeyIdentifier n\u00E3o suportado foi encontrado 

WSS0334.diag.cause.1=KeyIdentifier mant\u00E9m o ValueType inv\u00E1lido

WSS0334.diag.check.1=Verifique o valor do ValueType de KeyIdentifier



WSS0335.unsupported.referencetype=WSS0335: tipo de Refer\u00EAncia n\u00E3o suportado encontrado 

WSS0335.diag.cause.1=Tipo de KeyReference n\u00E3o suportado

WSS0335.diag.check.1=O tipo de KeyReference deve ser um dos seguintes: KeyIdentifier, Refer\u00EAncia, X509Data



WSS0336.cannot.locate.publickey.for.signature.verification=WSS0336: n\u00E3o foi poss\u00EDvel localizar a chave p\u00FAblica para verifica\u00E7\u00E3o de assinatura 

WSS0336.diag.cause.1=N\u00E3o \u00E9 poss\u00EDvel localizar a chave p\u00FAblica

WSS0336.diag.check.1=A verifica\u00E7\u00E3o da chave p\u00FAblica recuperada n\u00E3o deve ser nula



WSS0337.unsupported.directref.mechanism=WSS0337: mecanismo DirectReference {0} n\u00E3o suportado

WSS0337.diag.cause.1=N\u00E3o foi poss\u00EDvel resolver o URI

WSS0337.diag.check.1=Verifique o ValueType de DirectReference; ele n\u00E3o \u00E9 suportado



WSS0338.unsupported.reference.mechanism=WSS0338: mecanismo de Refer\u00EAncia N\u00E3o Suportado

WSS0338.diag.cause.1=Mecanismo de Refer\u00EAncia da Chave n\u00E3o suportado

WSS0338.diag.check.1=A refer\u00EAncia da verifica\u00E7\u00E3o \u00E9 uma das seguintes: X509IssuerSerial, DirectReference, KeyIdentifier 



WSS0339.unsupported.keyinfo=WSS0339: bloco keyinfo n\u00E3o suportado encontrado

WSS0339.diag.cause.1=Suporte para processar informa\u00E7\u00F5es no ds:KeyInfo fornecido n\u00E3o existente

WSS0339.diag.check.1=Verifique se ds:KeyInfo corresponde ao esquema



WSS0340.created.ahead.of.current=WSS0340: o hor\u00E1rio de cria\u00E7\u00E3o \u00E9 posterior ao atual.

WSS0340.diag.cause.1= O hor\u00E1rio de cria\u00E7\u00E3o n\u00E3o pode ser posterior ao hor\u00E1rio UTC atual

WSS0340.diag.check.1=Verifique o hor\u00E1rio do sistema e certifique-se de que ele esteja correto



WSS0341.created.older.than.timestamp.freshness=WSS0341: o hor\u00E1rio de cria\u00E7\u00E3o \u00E9 anterior a currenttime - timestamp-freshness-limit - max-clock-skew

WSS0341.diag.cause.1= O hor\u00E1rio de cria\u00E7\u00E3o \u00E9 muito antigo

WSS0341.diag.check.1=Verifique o hor\u00E1rio do sistema e certifique-se de que ele esteja correto



WSS0342.valtype.invalid=WSS0342: o tipo ValueType \u00E9 inv\u00E1lido

WSS0342.diag.cause.1=O tipo de Valor do Token BinarySecurity \u00E9 inv\u00E1lido

WSS0342.diag.check.1=Verifique se valueType do token BinarySecurity \u00E9 v\u00E1lido conforme a especifica\u00E7\u00E3o.



WSS0343.error.creating.bst=WSS0343: erro ao criar o BinarySecurityToken

# BST = Binary Security Token. {0} - most likely an exception message
WSS0343.diag.cause.1=Erro ao criar o BST em decorr\u00EAncia de {0} 

WSS0343.diag.check.1=Verifique se todos os valores obrigat\u00F3rios foram definidos no Token de Seguran\u00E7a Bin\u00E1rio, inclusive o valor de TextNode. 



# wss messages

WSS0344.error.decoding.bst=WSS0344: BinarySecurityToken n\u00E3o foi Codificado por Base64

WSS0344.diag.cause.1=Os dados bin\u00E1rios no Token de Seguran\u00E7a n\u00E3o podem ser decodificados; esperava a codifica\u00E7\u00E3o por Base64

WSS0344.diag.check.1=Verifique se o formato de codifica\u00E7\u00E3o do Token de Seguran\u00E7a Bin\u00E1rio \u00E9 Base64Binary



WSS0345.error.creating.edhb=WSS0345: erro ao criar o Bloco do Cabe\u00E7alho de EncryptedData em decorr\u00EAncia de {0}

WSS0345.diag.cause.1=Erro ao criar SOAPElement para EncryptedDataHeaderBlock

WSS0345.diag.check.1=Se SOAPElement for usado para criar EncryptedData HeaderBlock, verifique se ele \u00E9 v\u00E1lido, conforme especifica\u00E7\u00E3o. 



# {0} - element name
WSS0346.error.creating.edhb=WSS0346: esperava xenc:EncryptedData SOAPElement; encontrou {0}

WSS0346.diag.cause.1=SOAPElement Inv\u00E1lido informado ao construtor EncryptedDataHeaderBlock

WSS0346.diag.check.1=Verifique se o SOAPElement informado para EncryptedDataHeaderBlock \u00E9 v\u00E1lido, conforme especifica\u00E7\u00E3o.



WSS0347.missing.cipher.data=WSS0347: CipherData no EncryptedType n\u00E3o est\u00E1 presente

WSS0347.diag.cause.1=O SOAPElement usado para inicializar EncryptedType pode n\u00E3o ter o elemento CipherData

WSS0347.diag.cause.2=Pode ser que CipherData n\u00E3o tenha sido definido no EncryptedType

WSS0347.diag.check.1=Verifique se o SOAPElement usado para inicializar EncryptedType tem CipherData

WSS0347.diag.check.2=Verifique se setCipherData() foi chamado no EncryptedType



# {0} - exception message
WSS0348.error.creating.ekhb=WSS0348: erro ao criar EncryptedKeyHeaderBlock em decorr\u00EAncia de {0}

WSS0348.diag.cause.1=Erro ao criar SOAPElement para EncryptedKeyHeaderBlock

WSS0348.diag.check.1=Se SOAPElement for usado para criar EncryptedKeyHeaderBlock, verifique se ele \u00E9 v\u00E1lido, conforme especifica\u00E7\u00E3o. 


# {0} - element name
WSS0349.error.creating.ekhb=WSS0349: esperava xenc:EncryptedKey SOAPElement; encontrou {0}

WSS0349.diag.cause.1=SOAPElement inv\u00E1lido informado ao EncryptedKeyHeaderBlock()

WSS0349.diag.check.1=Verifique se o SOAPElement informado para EncryptedKeyHeaderBlock() \u00E9 v\u00E1lido, conforme especifica\u00E7\u00E3o.



# {0} - exception message
WSS0350.error.setting.ciphervalue=WSS0350: erro ao definir CipherValue em EncryptedKey em decorr\u00EAncia de {0}

WSS0350.diag.cause.1=Erro ao criar/atualizar CipherData SOAPElement (em EncryptedKeyHeaderBlock)

WSS0350.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



# {0} - exception message
WSS0351.error.setting.encryption.method=WSS0351: erro ao definir o m\u00E9todo de Criptografia em EncryptedType em decorr\u00EAncia de {0}

WSS0351.diag.cause.1=Erro ao criar EncryptionMethod SOAPElement

WSS0351.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



# {0} - exception message
WSS0352.error.getting.cipherValues=WSS0352: erro ao obter CipherValues em CipherData em decorr\u00EAncia de {0}

WSS0352.diag.cause.1=Erro ao criar javax.xml.soap.Name para wsu.Id para CipherValue

WSS0352.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0353.missing.cipherValue=WSS0353: CipherValue ausente em CipherData

WSS0353.diag.cause.1=Nenhum elemento de CipherValue presente em CipherData

WSS0353.diag.check.1=Verifique se setCipherValue() foi chamado em EncryptedType



WSS0354.error.initializing.encryptedType=WSS0354: erro ao inicializar EncryptedType em decorr\u00EAncia de {0}

WSS0354.diag.cause.1=Pode ter ocorrido um erro ao criar javax.xml.soap.Name para EncryptionMethod

WSS0354.diag.cause.2=Pode ter ocorrido um erro ao criar javax.xml.soap.Name para KeyInfo 

WSS0354.diag.cause.3=Pode ter ocorrido um erro ao criar javax.xml.soap.Name para CipherData 

WSS0354.diag.cause.4=Pode ter ocorrido um erro ao criar javax.xml.soap.Name para EncryptionProperties

WSS0354.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ 



# {0} - "DSA"/"RSA"/"" (no typo here, do not add space after this placeholder), {1} - exception message
WSS0355.error.creating.keyvalue=WSS0355: erro ao criar {0}KeyValue em decorr\u00EAncia de {1}

WSS0355.diag.cause.1=Erro ao criar org.apache.xml.security.keys.content.keyvalues.DSAKeyValue

WSS0355.diag.cause.2=Erro ao criar org.apache.xml.security.keys.content.keyvalues.RSAKeyValue

WSS0355.diag.cause.3=Erro ao criar org.apache.xml.security.keys.content.KeyValue

WSS0355.diag.check.1=Verifique se um SOAPElement n\u00E3o nulo foi informado para addXXXKeyValue()



WSS0356.error.creating.x509data=WSS0356: erro ao criar X509Data em decorr\u00EAncia de {0}

WSS0356.diag.cause.1=Erro ao criar org.apache.xml.security.keys.content.X509Data

WSS0356.diag.check.1=Verifique se um SOAPElement n\u00E3o nulo foi informado para addX509Data()



WSS0357.error.getting.keyvalue=WSS0357: n\u00E3o \u00E9 poss\u00EDvel obter KeyValue do \u00EDndice [{0}] em decorr\u00EAncia de {1}

WSS0357.diag.cause.1=Erro ao obter KeyValue de KeyInfo do \u00EDndice fornecido

WSS0357.diag.check.1=Verifique se o elemento ds:KeyInfo tem os elementos ds:KeyValue

WSS0357.diag.check.2=Verifique se o \u00EDndice (come\u00E7ando com 0) usado para fazer refer\u00EAncia ao elemento ds:KeyValue \u00E9 v\u00E1lido



WSS0358.error.getting.x509data=WSS0358: n\u00E3o \u00E9 poss\u00EDvel obter X509Data para o \u00EDndice [{0}] em decorr\u00EAncia de {1}

WSS0358.diag.cause.1=Erro ao obter X509Data de KeyInfo do \u00EDndice fornecido

WSS0358.diag.check.1=Verifique se o elemento ds:KeyInfo tem os elementos ds:X509Data

WSS0358.diag.check.2=Verifique se o \u00EDndice (come\u00E7ando com 0) usado para fazer refer\u00EAncia ao elemento ds:X509Data \u00E9 v\u00E1lido



WSS0359.error.adding.x509data=WSS0359: erro ao adicionar X509Data em decorr\u00EAncia de {0}

WSS0359.diag.cause.1=Erro ao adicionar org.apache.xml.security.keys.content.X509Data para KeyInfo

WSS0359.diag.check.1=Verifique se um org.apache.xml.security.keys.content.X509Data v\u00E1lido (conforme especifica\u00E7\u00E3o) foi informado para addX509Data()



WSS0360.error.creating.rlhb=WSS0360: n\u00E3o \u00E9 poss\u00EDvel criar ReferenceListHeaderBlock em decorr\u00EAncia de {0}

WSS0360.diag.cause.1=Pode ter ocorrido um erro ao criar javax.xml.soap.Name para ReferenceList

WSS0360.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0361.error.creating.rlhb=WSS0361: erro ao criar ReferenceListHeaderBlock em decorr\u00EAncia de {0}

WSS0361.diag.cause.1=Pode ter ocorrido um erro ao criar org.w3c.dom.Element para ReferenceList

WSS0361.diag.cause.2=O objeto org.w3c.dom.Document informado em ReferenceListHeaderBlock() pode ser nulo

WSS0361.diag.check.1=Verifique se o Namespace especificado n\u00E3o cont\u00E9m caracteres inv\u00E1lidos, conforme especifica\u00E7\u00E3o do XML 1.0 

WSS0361.diag.check.2=Verifique se o QName especificado est\u00E1 incorreto (Consulte a Documenta\u00E7\u00E3o do J2SE para obter mais informa\u00E7\u00F5es)

WSS0361.diag.check.3=Verifique se um Documento n\u00E3o Nulo foi informado ao ReferenceListHeaderBlock()



WSS0362.error.creating.rlhb=WSS0362: esperava xenc:ReferenceList SOAPElement; encontrou {0}

WSS0362.diag.cause.1=SOAPElement Inv\u00E1lido informado ao ReferenceListHeaderBlock()

WSS0362.diag.check.1=Verifique se o SOAPElement informado para ReferenceListHeaderBlock() \u00E9 v\u00E1lido, conforme especifica\u00E7\u00E3o.



WSS0363.error.adding.datareference=WSS0363: n\u00E3o \u00E9 poss\u00EDvel adicionar o elemento xenc:DataReference para xenc:ReferenceList em decorr\u00EAncia de {0}

WSS0363.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement para xenc:DataReference

WSS0363.diag.cause.2=Erro ao adicionar xenc:DataReference (SOAPElement) como elemento filho de xenc:DataReference (SOAPElement)

WSS0363.diag.cause.3=Erro ao definir o atributo do URL em javax.xml.soap.SOAPElement para xenc:DataReference

WSS0363.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0364.error.apache.xpathAPI=WSS0364: n\u00E3o foi poss\u00EDvel localizar os elementos de xenc:EncryptedData em decorr\u00EAncia de {0}

WSS0364.diag.cause.1=Ocorreu um erro interno de transforma\u00E7\u00E3o de XPathAPI 



WSS0365.error.creating.namespaceNode=WSS0365: erro ao criar o n\u00F3 do namespace em decorr\u00EAncia de {0}

WSS0365.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement para o n\u00F3 do espa\u00E7o

WSS0365.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0366.multiple.encrypteddata.found=WSS0366: mais de um xenc:EncryptedData encontrado

WSS0366.diag.cause.1=Mais de um xenc:EncryptedData tem o mesmo valor de atributo do Id


WSS0367.no.encrypteddata.found=WSS0367: nenhum xenc:EncryptedData encontrado

WSS0367.diag.cause.1=Um elemento xenc:EncryptedData v\u00E1lido n\u00E3o foi mencionado a partir do xenc:ReferenceList



# {0} - most likely an exception message
WSS0368.soap.exception=WSS0368: erro ao obter SOAPEnvelope de SOAPPart em decorr\u00EAncia de {0}

WSS0368.diag.cause.1=Erro ao obter SOAPEnvelope de SOAPPart

WSS0368.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ


WSS0369.soap.exception=WSS0369: erro ao obter SOAPHeader de SOAPEnvelope em decorr\u00EAncia de {0}

WSS0369.diag.cause.1=Erro ao obter SOAPHeader de SOAPEnvelope

WSS0369.diag.cause.2=Erro ao criar SOAPHeader 

WSS0369.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0370.error.deleting.secheader=WSS0370: erro ao deletar SecurityHeader em decorr\u00EAncia da exce\u00E7\u00E3o.

WSS0370.error.processing.secheader=WSS0370: erro ao processar SecurityHeader


WSS0371.error.generate.fault=WSS0371: erro ao gerar a mensagem de falha em decorr\u00EAncia de {0}

WSS0371.diag.cause.1=Erro ao obter o SOAPBody de SOAPMessage

WSS0371.diag.cause.2=Erro ao criar javax.xml.soap.Name para definir a falha em SOAPBody

WSS0371.diag.cause.3=Erro ao adicionar a falha a SOAPBody

WSS0371.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0372.error.apache.xpathAPI=WSS0372: n\u00E3o \u00E9 poss\u00EDvel localizar um elemento com o atributo do Id em decorr\u00EAncia de {0}

WSS0372.diag.cause.1=Ocorreu um erro interno de transforma\u00E7\u00E3o de XPathAPI 



WSS0373.error.apache.xpathAPI=WSS0373: n\u00E3o \u00E9 poss\u00EDvel localizar elementos com o atributo wsu:Id em decorr\u00EAncia de {0}

WSS0373.diag.cause.1=Ocorreu um erro interno de transforma\u00E7\u00E3o de XPathAPI 



WSS0374.error.apache.xpathAPI=WSS0374: n\u00E3o \u00E9 poss\u00EDvel localizar o elemento com o valor {0} do atributo wsu:Id em decorr\u00EAncia de {1}

WSS0374.diag.cause.1=Ocorreu um erro interno de transforma\u00E7\u00E3o de XPathAPI



WSS0375.error.apache.xpathAPI=WSS0375: n\u00E3o \u00E9 poss\u00EDvel localizar o elemento com o valor {0} do atributo em decorr\u00EAncia de {1}

WSS0375.diag.cause.1=Ocorreu um erro interno de transforma\u00E7\u00E3o de XPathAPI

WSS0376.error.inserting.header=WSS0376: n\u00E3o \u00E9 poss\u00EDvel inserir o bloco do cabe\u00E7alho em decorr\u00EAncia de {0}

WSS0376.diag.cause.1=Erro ao importar o SOAPElement representando o bloco do cabe\u00E7alho para o documento correspondente a SOAPMessage ao qual o cabe\u00E7alho est\u00E1 sendo adicionado

WSS0376.diag.check.1=Verifique se SecurityHeaderBlock pode ser transformado em um SOAPElement v\u00E1lido

WSS0376.diag.check.2=Consulte a Documenta\u00E7\u00E3o do J2SE para obter mais



WSS0377.error.creating.str=WSS0377: n\u00E3o \u00E9 poss\u00EDvel criar SecurityTokenReference em decorr\u00EAncia de {0}

WSS0377.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement para SecurityTokenReference 

WSS0377.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0378.error.creating.str=WSS0378: n\u00E3o \u00E9 poss\u00EDvel criar SecurityTokenReference em decorr\u00EAncia de {0}

WSS0378.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement para SecurityTokenReference 

WSS0378.diag.check.1=Verifique se o objeto org.w3c.dom.Document informado para SecurityTokenReference() \u00E9 n\u00E3o nulo

WSS0378.diag.check.2=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0379.error.creating.str=WSS0379: esperava wsse:SecurityTokenReference SOAPElement; encontrou {0} 

WSS0379.diag.cause.1=SOAPElement informado para SecurityTokenReference() n\u00E3o \u00E9 um elemento SecurityTokenReference v\u00E1lido conforme especifica\u00E7\u00E3o. 

WSS0379.diag.check.1=Verifique se um SOAPElement v\u00E1lido, conforme especifica\u00E7\u00E3o, foi informado para SecurityTokenReference()



WSS0380.error.setting.reference=WSS0380: n\u00E3o \u00E9 poss\u00EDvel definir ds:Reference na SecurityTokenReference

WSS0380.diag.cause.1=A ds:Reference j\u00E1 foi definida usando os construtores

WSS0380.diag.check.1=Verifique se um SOAPElement com ds:Reference (elemento filho) n\u00E3o foi usado para instanciar SecurityTokenReference



WSS0381.error.setting.reference=WSS0381: n\u00E3o \u00E9 poss\u00EDvel definir ds:Reference na SecurityTokenReference

WSS0381.diag.cause.1=Erro ao definir o ReferenceElement informado na SecurityTokenReference

WSS0381.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0382.error.appending.object=WSS0382: n\u00E3o \u00E9 poss\u00EDvel anexar ds:Object em decorr\u00EAncia de {0}

WSS0382.diag.cause.1=Erro ao anexar o elemento ds:Object em ds:Signature

WSS0382.diag.check.1=Verifique se um ds:Object SOAPElement v\u00E1lido (conforme especifica\u00E7\u00E3o) foi informado para appendObject()

WSS0382.diag.check.2=Verifique se um SOAPElement n\u00E3o nulo foi informado para appendObject()



WSS0383.document.not.set=WSS0383: documento do propriet\u00E1rio de ds:Signature SOAPElement n\u00E3o definido

WSS0383.diag.cause.1=Documento do propriet\u00E1rio de ds:Signature SOAPElement nulo

WSS0383.diag.check.1=Verifique se o Documento usado para instanciar SignatureHeaderBlock() \u00E9 n\u00E3o nulo



WSS0384.error.creating.timestamp=WSS0384: n\u00E3o \u00E9 poss\u00EDvel criar Timestamp em decorr\u00EAncia de {0}

WSS0384.diag.cause.1=Erro ao criar javax.xml.soap.Name para wsu.Id para Timestamp

WSS0384.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0385.error.creating.timestamp=WSS0385: esperava wsu:Timestamp SOAPElement; encontrou {0}

WSS0385.diag.cause.1=O SOAPElement usado para instanciar Timestamp() n\u00E3o \u00E9 v\u00E1lido (conforme especifica\u00E7\u00E3o)

WSS0385.diag.check.1=Verifique se Localname e NamespaceURI de SOAPElement usados para criar Timestamp() est\u00E3o corretos, conforme especifica\u00E7\u00E3o.



WSS0386.error.creating.timestamp=WSS0386: n\u00E3o \u00E9 poss\u00EDvel criar a representa\u00E7\u00E3o de SOAPElement de Timestamp em decorr\u00EAncia de {0}

WSS0386.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement para Timestamp

WSS0386.diag.cause.2=Erro ao adicionar SOAPElements filhos ao elemento Timestamp

WSS0386.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0387.error.creating.usernametoken=WSS0387: nome do usu\u00E1rio n\u00E3o definido

WSS0387.diag.cause.1=O Nome do usu\u00E1rio n\u00E3o foi definido

WSS0387.diag.check.1=Verifique se um Nome do usu\u00E1rio foi informado por meio do arquivo de configura\u00E7\u00E3o ou por meio do handler de callback



WSS0388.error.creating.usernametoken=WSS0388: erro ao criar a representa\u00E7\u00E3o de SOAPElement de UsernameToken em decorr\u00EAncia de {0}

WSS0388.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement para o UsernameToken

WSS0388.diag.cause.2=Erro ao adicionar SOAPElements filhos ao elemento UsernameToken

WSS0388.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0389.unrecognized.nonce.encoding=WSS0389: esperava EncodingType Base64; encontrou {0}

WSS0389.diag.cause.1=Tipo de codifica\u00E7\u00E3o de nonce Base64 n\u00E3o especificado

WSS0389.diag.check.1=Verifique se o tipo de codifica\u00E7\u00E3o nonce usado para criar UsernameToken \u00E9 Base64



WSS0390.unsupported.charset.exception=WSS0390: Charset UTF-8 N\u00E3o Suportado

WSS0390.diag.cause.1=UTF-8 Charset n\u00E3o suportado para a codifica\u00E7\u00E3o de byte (uma string)

WSS0390.diag.check.1=Consulte a Documenta\u00E7\u00E3o do J2SE



WSS0391.error.creating.X509SecurityToken=WSS0391: esperava wsse:BinarySecurityToken; encontrou {0}

WSS0391.diag.cause.1=Localname e NamespaceURI do SOAPElement usado para criar o token

WSS0391.diag.check.1=Verifique se Localname e NamespaceURI de SOAPElement usados para criar X509SecurityToken s\u00E3o v\u00E1lidos (conforme especifica\u00E7\u00E3o).



WSS0392.invalid.X509cert.version=WSS0392: a vers\u00E3o [3] do X509Certificate era esperada; vers\u00E3o encontrada: [{0}]

WSS0392.diag.cause.1=Uma vers\u00E3o [3] de X509Certificate era esperada



WSS0393.current.ahead.of.expires=WSS0393: a hora atual \u00E9 posterior \u00E0 hora da expira\u00E7\u00E3o no Timestamp"

WSS0393.diag.cause.1= O hor\u00E1rio de expira\u00E7\u00E3o no Timestamp n\u00E3o pode ser anterior ao hor\u00E1rio de UTC atual

WSS0393.diag.check.1=Verifique o hor\u00E1rio do sistema e certifique-se de que ele esteja correto



WSS0394.error.parsing.expirationtime=WSS0394: ocorreu um Erro ao fazer parse do hor\u00E1rio de expira\u00E7\u00E3o/cria\u00E7\u00E3o para o formato de Data.

WSS0394.diag.cause.1=Erro ao fazer parse da data. 

# Format should not be changed. Letters can be translated but the user should known that java.text.SimpleDateFormat is responsible for formatting (meaning of symbols can be found at http://docs.oracle.com/javase/tutorial/i18n/format/simpleDateFormat.html).
WSS0394.diag.check.1=Verifique se o formato de data est\u00E1 em UTC. Verifique se \u00E9 "aaaa-MM-dd'T'HH:mm:ss'Z'" ou "aaaa-MM-dd'T'HH:mm:ss'.'sss'Z'"



WSS0395.creating.cipherData=WSS0395: erro ao criar CipherData

WSS0395.diag.cause.1=Erro ao criar um elemento CipherData

WSS0395.diag.check.1=Consulte as APIs do SAAJ



WSS0396.notchild.securityHeader=WSS0396: o Elemento {0} n\u00E3o \u00E9 filho de SecurityHeader

WSS0396.diag.cause.1=O elemento deve ser filho do Cabe\u00E7alho de Seguran\u00E7a

WSS0396.diag.check.1=O pai do filho deve ser SecurityHeader


WSS0397.soap.factory.exception=WSS0397: erro ao obter a inst\u00E2ncia de SOAPFactory

WSS0398.soap.body.exception=WSS0398: erro ao obter SOAPBody

WSS0399.soap.envelope.exception=WSS0399: erro ao obter SOAPEnvelope


#add log msgs for XMLUtil



#SAML related log messages

WSS0400.saml.null.input=WSS0400: Entrada Nula



WSS0401.saml.incorrect.input=WSS0401: Entrada Incorreta



WSS0402.saml.missing.element.value=WSS0402: o Valor deste Elemento n\u00E3o foi encontrado



WSS0403.saml.invalid.action=WSS0403: a a\u00E7\u00E3o \u00E9 inv\u00E1lida em seu namespace especificado



WSS0404.saml.invalid.version=WSS0404: vers\u00E3o de SAML inv\u00E1lida Encontrada.



WSS0405.saml.list.add.error=WSS0405: falha ao adicionar um objeto \u00E0 lista



WSS0406.saml.invalid.element=WSS0406: a entrada tem um elemento inv\u00E1lido



WSS0407.saml.missing.attribute=WSS0407: atributo n\u00E3o encontrado



WSS0408.saml.element.overflow=WSS0408: tentativa de adicionar mais elementos que o permitido



WSS0409.saml.missing.statement=WSS0409: a Asser\u00E7\u00E3o n\u00E3o tem instru\u00E7\u00F5es



WSS0410.saml.element.underflow=WSS0410: tentativa de adicionar menos elementos que o necess\u00E1rio



WSS0411.saml.missing.element=WSS0411: elemento n\u00E3o encontrado



WSS0412.saml.condition.not.supported=WSS0412: a condi\u00E7\u00E3o especificada n\u00E3o \u00E9 suportada



WSS0413.saml.invalid.date.format=WSS0413: formato de data inv\u00E1lido



WSS0414.saml.missing.attribute.value=WSS0414: valor do atributo n\u00E3o encontrado



WSS0415.saml.empty.element=WSS0415: o elemento n\u00E3o tem conte\u00FAdo



WSS0416.saml.signature.invalid=WSS0416: a assinatura na Asser\u00E7\u00E3o SAML \u00E9 inv\u00E1lida

WSS0417.saml.timestamp.invalid=WSS0417: falha na valida\u00E7\u00E3o da condi\u00E7\u00E3o(notBefore, notOnOrAfter) da asser\u00E7\u00E3o SAML

WSS0418.saml.import.exception=WSS0418: exce\u00E7\u00E3o ao importar o Token de SAML

WSS0419.saml.signature.verify.failed=WSS0419: exce\u00E7\u00E3o durante a verifica\u00E7\u00E3o de Assinatura na Asser\u00E7\u00E3o SAML

WSS0420.saml.cannot.find.subjectconfirmation.keyinfo=WSS0420: n\u00E3o \u00E9 poss\u00EDvel localizar KeyInfo dentro do elemento SubjectConfirmation da Asser\u00E7\u00E3o SAML

WSS0421.saml.cannot.subjectconfirmation.keyinfo.not.unique=WSS0421: KeyInfo n\u00E3o exclusivo no SubjectConfirmation de SAML 

WSS0422.saml.issuer.validation.failed=WSS0422: falha na valida\u00E7\u00E3o do emissor da Asser\u00E7\u00E3o SAML

WSS0423.saml.subject.nameid.validation.failed=WSS0423: falha na valida\u00E7\u00E3o de NameIdentifier do Assunto da Asser\u00E7\u00E3o SAML

WSS0424.null.OwnerDocument.element=WSS0424: o elemento n\u00E3o tem um documento de propriet\u00E1rio

WSS0425.unableto.resolve.xpath=WSS0425: n\u00E3o \u00E9 poss\u00EDvel resolver XPath

WSS0426.failed.DSAKeyValue=WSS0426: exce\u00E7\u00E3o ao tentar obter o Valor da Chave DSA

WSS0427.unableto.decode.base64=WSS0427: n\u00E3o \u00E9 poss\u00EDvel decodificar dados codificados por Base64

WSS0428.saml.not.found=WSS0428: nenhuma Asser\u00E7\u00E3o SAML encontrada na mensagem

WSS0429.saml.authInstant.or.session.parse.failed=WSS0429: erro ao fazer parse de authnInstantDate ou de  sessionNotOnOrAfter

WSS0430.saml.getNotBeforeDate.or.getNotOnOrAfterDate.parse.failed=WSS0430: erro ao fazer parse de getNotBefore ou de getNotOnOrAfter

# configuration framework messages from 500

# Adding diagnostics for SEVERE messages only



WSS0500.class.not.messagefilter=WSS0500: a classe {0} n\u00E3o implementa MessageFilter

WSS0500.diag.cause.1=O nome da classe n\u00E3o \u00E9 reconhecido para um MessageFilter

WSS0500.diag.check.1=Verifique se a classe implementa MessageFilter



WSS0501.property.not.defined=WSS0501: propriedade {0} n\u00E3o definida. Retornando nulo



WSS0502.bad.reader.state.1=WSS0502: estado do leitor inv\u00E1lido. Esperava {0}, mas obteve {1}

WSS0502.diag.cause.1=O elemento encontrado n\u00E3o corresponde ao elemento esperado

WSS0502.diag.check.1=Verifique se o arquivo xml segue o esquema para defini\u00E7\u00E3o da configura\u00E7\u00E3o



WSS0503.bad.reader.state.2=WSS0503: estado do leitor inv\u00E1lido. Esperava {0} ou {1} ou {2}, mas obteve {3}

WSS0503.diag.cause.1=O elemento encontrado n\u00E3o corresponde ao elemento esperado v\u00E1lido

WSS0503.diag.check.1=Verifique se o arquivo xml segue o esquema para defini\u00E7\u00E3o da configura\u00E7\u00E3o



WSS0504.class.not.found=WSS0504: a Classe {0} n\u00E3o foi encontrada no caminho de classe



WSS0505.using.default.target.values=WSS0505: alvo n\u00E3o especificado. Usando valores default.



WSS0506.target.not.specified.verify=WSS0506: alvo n\u00E3o especificado na verifica\u00E7\u00E3o.



WSS0507.target.not.specified.decrypt=WSS0507: alvo n\u00E3o especificado na decriptografia.



WSS0508.unableto.set.defaults=WSS0508: n\u00E3o \u00E9 poss\u00EDvel especificar defini\u00E7\u00F5es default ap\u00F3s as defini\u00E7\u00F5es personalizadas serem adicionadas

WSS0508.diag.cause.1=As defini\u00E7\u00F5es default n\u00E3o podem ser especificadas ap\u00F3s as defini\u00E7\u00F5es personalizadas serem especificadas

WSS0508.diag.check.1=Verifique se nenhuma opera\u00E7\u00E3o do remetente ou requisitos do destinat\u00E1rio foram especificados em um arquivo de configura\u00E7\u00E3o.

WSS0508.diag.check.2=Verifique se as defini\u00E7\u00F5es do remetente ou do destinat\u00E1rio foram adicionadas de forma programada



WSS0509.defaults.already.set=WSS0509: n\u00E3o \u00E9 poss\u00EDvel especificar defini\u00E7\u00F5es personalizadas ap\u00F3s as defini\u00E7\u00F5es default serem adicionadas

WSS0509.diag.cause.1=As defini\u00E7\u00F5es default n\u00E3o podem ser especificadas ap\u00F3s as defini\u00E7\u00F5es default serem especificadas

WSS0509.diag.check.1=Verifique se as defini\u00E7\u00F5es default foram adicionadas de forma programada



WSS0510.cannot.use.keyname=WSS0510: as informa\u00E7\u00F5es de Chave P\u00FAblica para verificar uma assinatura devem ser divulgadas na mensagem

WSS0510.diag.cause.1=As chaves com nome n\u00E3o podem ser usadas para divulgar informa\u00E7\u00F5es de chave p\u00FAblica



WSS0511.illegal.boolean.value=WSS0511: as strings de valor booliano podem ser "verdadeiro"|"falso", encontrada(s): {0}

WSS0511.diag.cause.1=String de valor booliano n\u00E3o permitida - as strings v\u00E1lidas s\u00E3o "verdadeiro" e "falso"

WSS0511.diag.check.1=Verifique se as strings de valor booliano s\u00E3o "verdadeiro" ou "falso"


# {0} - attribute name, {1} - element name (e.g.: xwss:X509Token, xwss:Target)
WSS0512.illegal.attribute.name=WSS0512: atributo inesperado: {0} em {1}

WSS0512.diag.cause.1=Atributo n\u00E3o permitido em um elemento de Configura\u00E7\u00E3o de Seguran\u00E7a

WSS0512.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



WSS0513.illegal.configuration.element=WSS0513: elemento inesperado: {0} em xwss:SecurityConfiguration

WSS0513.diag.cause.1=Elemento n\u00E3o permitido em xwss:SecurityConfiguration

WSS0513.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



WSS0514.illegal.nested.element=WSS0514: elemento filho: {0} inesperado em {1}

WSS0514.diag.cause.1=Elemento filho n\u00E3o permitido em um elemento de Configura\u00E7\u00E3o de Seguran\u00E7a

WSS0514.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



WSS0515.illegal.keyreference=WSS0515: valor n\u00E3o permitido para a string de refer\u00EAncia da chave: {0}

WSS0515.diag.cause.1=Valor n\u00E3o permitido para a string de refer\u00EAncia da chave

WSS0515.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a


# {0} - e.g. http://java.sun.com/xml/ns/xwss/config#Timestamp, {1} - element name
WSS0516.duplicate.configuration.element=WSS0516: elemento duplicado: {0} em {1}

WSS0516.diag.cause.1=Elemento duplicado n\u00E3o permitido em um Elemento de Configura\u00E7\u00E3o de Seguran\u00E7a

WSS0516.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



# Usage not found. TODO Remove
#WSS0517.duplicate.configuration.element=WSS0517: Multiple configuration elements not allowed on: {0}

WSS0517.diag.cause.1=Elemento duplicado n\u00E3o permitido em um Elemento de Configura\u00E7\u00E3o de Seguran\u00E7a

WSS0517.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



WSS0518.illegal.contentOnly.use=WSS0518: o flag ContentOnly flag s\u00F3 pode ser apresentado nos elementos do Alvo que s\u00E3o filhos de Encrypt ou requireEncryption



WSS0519.illegal.attribute.value=WSS0519: valor do atributo Inv\u00E1lido/N\u00E3o Encontrado para: {0}

WSS0519.diag.cause.1=Valor do atributo n\u00E3o permitido/n\u00E3o encontrado

WSS0519.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



WSS0520.illegal.configuration.state=WSS0520: estado de configura\u00E7\u00E3o do elemento inv\u00E1lido

WSS0520.diag.cause.1=xwss:SymmetricKey n\u00E3o \u00E9 permitido com xwss:X509Token

WSS0520.diag.check.1=Verifique se o arquivo de configura\u00E7\u00E3o \u00E9 consistente com o esquema de configura\u00E7\u00E3o de seguran\u00E7a



# helpers/ messages from 600

# Adding diagnostics for SEVERE messages only



WSS0600.illegal.token.reference=WSS0600: a chave n\u00E3o pode ser localizada para o TokenReference (ds:KeyInfo)

WSS0600.diag.cause.1=Uma Chave n\u00E3o pode ser localizada no SecurityEnvironment da Refer\u00EAncia de Token

WSS0600.diag.check.1=Verifique se o certificado mencionado \u00E9 v\u00E1lido e est\u00E1 presente nas \u00C1reas de armazenamento de chave



WSS0601.unsupported.keyinfoWSS0601.illegal.key.value=WSS0601: a chave n\u00E3o pode ser localizada para o KeyValue (ds:KeyInfo) em decorr\u00EAncia de {0}

WSS0601.diag.cause.1=Uma Chave n\u00E3o pode ser localizada no SecurityEnvironment para o KeyValue

WSS0601.diag.check.1=Verifique se o certificado mencionado \u00E9 v\u00E1lido e est\u00E1 presente nas \u00C1reas de armazenamento de chave



WSS0602.illegal.x509.data=WSS0602: a chave n\u00E3o pode ser localizada para X509Data (ds:KeyInfo) em decorr\u00EAncia de {0}

WSS0602.diag.cause.1=Uma Chave n\u00E3o pode ser localizada no SecurityEnvironment para X509Data

WSS0602.diag.check.1=Verifique se o certificado mencionado \u00E9 v\u00E1lido e est\u00E1 presente nas \u00C1reas de armazenamento de chave



WSS0603.xpathapi.transformer.exception=WSS0603: XPathAPI TransformerException em decorr\u00EAncia de {0} ao localizar elemento com wsu:Id/Id/SAMLAssertionID correspondente 

WSS0603.diag.cause.1=XPathAPI TransformerException ao localizar elemento com wsu:Id/Id/SAMLAssertionID correspondente

WSS0603.diag.check.1=Consulte a documenta\u00E7\u00E3o de XPathAPI



WSS0604.cannot.find.element=WSS0604: n\u00E3o \u00E9 poss\u00EDvel encontrar o elemento com wsu:Id/Id/SAMLAssertionID correspondente

WSS0604.diag.cause.1=Um elemento com o wsu:Id/Id/SAMLAssertionID fornecido n\u00E3o pode ser localizado



WSS0605.str.transform.exception=WSS0605: erro ao aplicar a Transforma\u00E7\u00E3o de STR em decorr\u00EAncia de {0}

WSS0605.diag.cause.1=Erro ao aplicar a Transforma\u00E7\u00E3o de STR



WSS0606.str.transform.exception=WSS0606: O N\u00F3 de Entrada Definido para Transforma\u00E7\u00E3o de STR est\u00E1 vazio

WSS0606.diag.cause.1=O N\u00F3 de Entrada Definido para Transforma\u00E7\u00E3o de STR est\u00E1 vazio

WSS0606.diag.check.1=Verifique se o N\u00F3 Mencionado (a ser Transformado em STR) em ds:SignedInfo \u00E9 v\u00E1lido



WSS0607.str.transform.exception=WSS0607: DOMException na atualiza\u00E7\u00E3o de SOAPElement representando o X509Token

WSS0607.diag.cause.1=DOMException na remo\u00E7\u00E3o do atributo "EncodingType" no SOAPElement representando o X509Token



WSS0608.illegal.reference.mechanism=WSS0608: Mecanismo de Refer\u00EAncia Inv\u00E1lido na SecurityTokenReference

WSS0608.diag.cause.1=O Mecanismo de Refer\u00EAncia no SecurityTokenReference n\u00E3o \u00E9 suportado

WSS0608.diag.check.1=Verifica se o Mecanismo de Refer\u00EAncia \u00E9 Direct/KeyIdentifier/X509IssuerSerial



# impl/ messages from 650

# Adding diagnostics for SEVERE messages only



WSS0650.userpwd.file.notfound=WSS0650: o arquivo de dados do Nome do usu\u00E1rio/Senha n\u00E3o foi encontrado

WSS0650.diag.cause.1=O arquivo de dados do Nome do usu\u00E1rio/Senha n\u00E3o foi encontrado

WSS0650.diag.check.1=Verifique se a propriedade do sistema com.sun.xml.wss.usersFile foi definida



WSS0651.parser.config.error=WSS0651: falha ao criar a inst\u00E2ncia DocumentBuilder de JAXP

WSS0651.diag.cause.1=Falha ao criar a inst\u00E2ncia DocumentBuilder de JAXP



WSS0652.error.parsing.file=WSS0652: erro ao fazer parse do arquivo {0}

WSS0652.diag.cause.1=Erro ao fazer parse do arquivo xws-security-users



WSS0653.error.reading.file=WSS0653: erro ao ler o arquivo {0}

WSS0653.diag.cause.1=Erro ao ler o arquivo xws-security-users



WSS0654.soap.exception=WSS0654: erro ao criar javax.xml.soap.Name para wsu:Id em decorr\u00EAncia de {0}

WSS0654.diag.cause.1=Erro ao criar javax.xml.soap.Name para wsu.Id

WSS0654.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0655.error.creating.headerblock=WSS0655: erro ao criar uma inst\u00E2ncia do bloco do cabe\u00E7alho do elemento {0}

SS0655.diag.cause.1=O objeto de Classe n\u00E3o corresponde a um bloco do cabe\u00E7alho identificado por SOAPElement

WSS0655.diag.check.1=Verifique se o objeto de Classe corresponde ao bloco do cabe\u00E7alho identificado por SOAPElement



WSS0656.keystore.file.notfound=WSS0656: o arquivo da \u00C1rea de Armazenamento de Chaves n\u00E3o foi encontrado

WSS0656.diag.cause.1=O URL da \u00C1rea de Armazenamento de Chaves n\u00E3o foi especificado/\u00E9 inv\u00E1lido no server.xml 

WSS0656.diag.cause.2=Um arquivo da \u00C1rea de Armazenamento de Chaves n\u00E3o existe em $user.home

WSS0656.diag.check.1=Verifique se o atributo keystoreFile foi especificado no elemento do Conector Coyote HTTP/1.1 de SSL no server.xml e \u00E9 v\u00E1lido

WSS0656.diag.check.2=Verifique se um arquivo da \u00E1rea de armazenamento de chave existe em $user.home



WSS0657.config.file.notfound=WSS0657: tomcat-users.xml n\u00E3o encontrado

WSS0657.diag.cause.1=tomcat-users.xml n\u00E3o encontrado



# keyinfo/ messages from 700

# Adding diagnostics for SEVERE messages only



WSS0700.security.environment.notset=WSS0700: uma inst\u00E2ncia de SecurityEnvironment n\u00E3o definida em SecurableSoapMessage

WSS0700.diag.cause.1=Uma inst\u00E2ncia de SecurityEnvironment n\u00E3o definida em SecurableSoapMessage

WSS0700.diag.check.1=Verifique se setSecurityEnvironment() foi chamado na SecurableSoapMessage

WSS0700.diag.check.2=Verifique se SetSecurityEnvironmentFilter foi aplicado em SecurableSoapMessage



WSS0701.cannot.locate.certificate=WSS0701: n\u00E3o \u00E9 poss\u00EDvel localizar um Certificado X509v3 para obter o valor de KeyIdentifier para o alias: {0}

WSS0701.diag.cause.1=Nenhum Certificado X509v3 pode ser localizado para o alias na \u00C1rea de Armazenamento de Chaves

WSS0701.diag.cause.2=Se nenhum alias foi especificado para assinatura, nenhum certificado default fica dispon\u00EDvel

WSS0701.diag.check.1=Verifique se um certificado default est\u00E1 dispon\u00EDvel e/ou um alias v\u00E1lido \u00E9 usado



WSS0702.no.subject.keyidentifier=WSS0702: o Certificado X509v3 (para o alias: [{0}]) n\u00E3o cont\u00E9m um Identificador de Chave do Indiv\u00EDduo

WSS0702.diag.cause.1=O Certificador X509v3 para o alias fornecido n\u00E3o cont\u00E9m um identificador de chave do indiv\u00EDduo

WSS0702.diag.check.1=Verifique se um Certificado X509v3 v\u00E1lido est\u00E1 presente nas \u00C1reas de Armazenamento de Chave



WSS0703.unsupported.operation=WSS0703: Opera\u00E7\u00E3o N\u00E3o Suportada - insertKey(SecurityTokenReference, SecurableSoapMessage) - em KeyNameStrategy

WSS0703.diag.cause.1=insertKey(SecurityTokenReference, SecurableSoapMessage) n\u00E3o suportado em KeyNameStrategy



WSS0704.null.session.key=WSS0704: o KeyName da Sess\u00E3o foi definido na inst\u00E2ncia SecurityEnvironment

WSS0704.diag.cause.1=Nome do contrato: SESSION-KEY-VALUE, foi definido na inst\u00E2ncia SecurityEnvironment

WSS0704.diag.check.1=Verifique se o nome do contrato: SESSION-KEY-VALUE, foi definido em SecurityEnvironment usando setAgreementProperty() 



WSS0705.unsupported.operation=WSS0705: Opera\u00E7\u00E3o N\u00E3o Suportada - setCertificate(X509Certificate) - em KeyNameStrategy

WSS0705.diag.cause.1=setCertificate(X509Certificate) n\u00E3o suportado em KeyNameStrategy

# {0} - key type e.g.: No Matching Certificate for : SunPKCS11-NSS RSA public key, 1024 bits (id 373, session object) modulus: 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 public exponent: 65537 found in KeyStore or TrustStore
WSS0706.no.matching.cert=WSS0706: Erro: nenhum Certificado Correspondente para : {0} encontrado na \u00C1rea de Armazenamento de Chaves ou na \u00C1rea de Armazenamento Confi\u00E1vel.

WSS0707.null.truststore=WSS0707: Erro: nenhuma entrada na \u00C1rea de Armazenamento de Chaves preenchida por TrustStoreCallback.

WSS0708.no.digest.algorithm=WSS0708: algoritmo de compila\u00E7\u00E3o SHA-1 n\u00E3o encontrado

WSS0709.error.getting.rawContent=WSS0709: erro ao obter o conte\u00FAdo bruto do certificado

# {0} - key type e.g.: No Matching Certificate for : SunPKCS11-NSS RSA public key, 1024 bits (id 373, session object) modulus: 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 public exponent: 65537 found in KeyStore
WSS0710.no.matching.cert.keystore=WSS0710: Erro: nenhum Certificado Correspondente para : {0} encontrado na \u00C1rea de Armazenamento de Chaves.

WSS0711.error.match.cert.for.decoded.string=WSS0711: erro: ocorreu um Erro ao corresponder a certifica\u00E7\u00E3o da String Decodificada.

WSS0712.error.adjust.skew.freshness.time=WSS0712: ocorreu um Erro ao ajustar o hor\u00E1rio Atual com hor\u00E1rio de atualiza\u00E7\u00E3o e desviado.
WSS0713.error.in.certstore.lookup=WSS0713: ocorreu uma Exce\u00E7\u00E3o ao pesquisar o Certstore
WSS0714.error.getting.userClass=WSS0714: n\u00E3o foi poss\u00EDvel localizar a Classe do Usu\u00E1rio {0}
WSS0715.exception.creating.newinstance=WSS0715: exce\u00E7\u00E3o ao criar a nova inst\u00E2ncia
WSS0716.failed.validateSAMLAssertion=WSS0716: falha ao validar a Asser\u00E7\u00E3o SAML
WSS0717.no.SAMLCallbackHandler=WSS1507: um CallBackHandler do SAML Obrigat\u00F3rio n\u00E3o foi especificado na configura\u00E7\u00E3o. N\u00E3o \u00E9 Poss\u00EDvel Preencher a Asser\u00E7\u00E3o SAML
WSS0718.exception.invoking.samlHandler=WSS0718: ocorreu uma exce\u00E7\u00E3o ao chamar o CallbackHandler do SAML fornecido pelo usu\u00E1rio
WSS0719.error.getting.longValue=WSS0719: erro ao obter o valor longo
# reference/ messages from 750

# Adding diagnostics for SEVERE messages only



WSS0750.soap.exception=WSS0750: erro ao criar javax.xml.soap.SOAPElement para {0} em decorr\u00EAncia de {1}

WSS0750.diag.cause.1=Erro ao criar javax.xml.soap.SOAPElement

WSS0750.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0751.invalid.data.reference=WSS0751: SOAPElement ({0}) inv\u00E1lido informado para DirectReference()

WSS0751.diag.cause.1=O localname de SOAPElement informado n\u00E3o \u00E9 "Refer\u00EAncia"

WSS0751.diag.cause.2=O URI do namespace do SOAPElement informado n\u00E3o atende \u00E0 especifica\u00E7\u00E3o de WSS

WSS0751.diag.check.1=Verifique se foi informado um SOAPElement de acordo com a especifica\u00E7\u00E3o



WSS0752.invalid.embedded.reference=WSS0751: SOAPElement ({0}) inv\u00E1lido informado para EmbeddedReference()

WSS0752.diag.cause.1=O localname de SOAPElement informado n\u00E3o \u00E9 "Incorporado"

WSS0752.diag.cause.2=O URI do namespace do SOAPElement informado n\u00E3o atende \u00E0 Especifica\u00E7\u00E3o de WSS

WSS0752.diag.check.1=Verifique se foi informado um SOAPElement de acordo com a especifica\u00E7\u00E3o



WSS0753.missing.embedded.token=WSS0753: token incorporado n\u00E3o encontrado no elemento wsse:Embedded

WSS0753.diag.cause.1=Um token incorporado n\u00E3o encontrado no elemento wsse:Embedded

WSS0753.diag.check.1=Verifique se o elemento do token est\u00E1 de acordo com a especifica\u00E7\u00E3o WSS



WSS0754.token.already.set=WSS0754: o token na EmbeddedReference j\u00E1 foi definido

WSS0754.diag.cause.1=O Token na EmbeddedReference j\u00E1 foi definido

WSS0754.diag.cause.2=Uma representa\u00E7\u00E3o SOAPElement de EmbeddedReference que cont\u00E9m o Token \u00E9 usada para criar a inst\u00E2ncia EmbeddedReference



WSS0755.soap.exception=WSS0755: erro ao incorporar o token na TokenReference em decorr\u00EAncia de {0}

WSS0755.diag.cause.1=Erro ao incorporar o token na TokenReference



WSS0756.invalid.key.identifier=WSS0756: SOAPElement ({0}) inv\u00E1lido informado para KeyIdentifier()

WSS0756.diag.cause.1=Erro ao criar SOAPElement para wsse:KeyIdentifier

WSS0756.diag.check.1=Verifique a Documenta\u00E7\u00E3o da API do SAAJ



WSS0757.error.setting.reference=WSS0757: erro ao adicionar o Valor de KeyIdentifier para wsse:KeyIdentifier

WSS0757.diag.cause.1=Erro ao adicionar o valor de KeyIdentifier para wsse:KeyIdentifer

WSS0757.diag.check.1=Verifique a Documenta\u00E7\u00E3o da API do SAAJ



WSS0758.soap.exception=WSS0758: erro ao criar javax.xml.soap.Name para {0} em decorr\u00EAncia de {1}

WSS0758.diag.cause.1=Erro ao criar javax.xml.soap.Name 

WSS0758.diag.check.1=Consulte a Documenta\u00E7\u00E3o da API do SAAJ



WSS0759.error.creating.issuerserial=WSS0759: erro ao criar a inst\u00E2ncia X509IssuerSerial

WSS0759.diag.cause.1=Uma inst\u00E2ncia X509IssuerSerial n\u00E3o pode ser criada

WSS0759.diag.check.1=Verifique se o SOAPElement informado para o construtor est\u00E1 de acordo com a especifica\u00E7\u00E3o (e tem os elementos filhos X509IssuerSerial)



WSS0760.warning.optionaltarget.enforce.ignored=WSS0760: Advert\u00EAncia. O valor do atributo de imposi\u00E7\u00E3o 'true' no Alvo Opcional foi ignorado.



WSS0761.context.not.instanceof.servletendpointcontext=WSS0761: o contexto fornecido n\u00E3o \u00E9 uma inst\u00E2ncia de ServletEndpointContext ou de com.sun.xml.wss.ProcessingContext

WSS0761.diag.cause.1=exige que o argumento de contexto seja ServletEndpointContext ou com.sun.xml.wss.ProcessingContext

WSS0761.diag.check.1=Verifique o argumento de contexto informado para getRequesterSubject



WSS0762.unsupported.encodingtype=WSS0762: EncodingType {0} N\u00E3o Suportado no KeyIdentifier

WSS0762.diag.cause.1=O encodingType no KeyIdentifier n\u00E3o \u00E9 suportado

WSS0762.diag.check.1=Verifique o valor da propriedade encodingType no KeyIdentifier



WSS0763.exception.issuername=WSS0763: exce\u00E7\u00E3o {0} ao obter o Nome do Emissor

WSS0763.diag.cause.1=Exce\u00E7\u00E3o ao obter o Nome do Emissor

WSS0763.diag.check.1=Verifique se IssuerName est\u00E1 presente corretamente na Mensagem SOAP





#################



#Policy related logs from 0801-0900

WSS0801.illegal.securitypolicy=Tipo de SecurityPolicy Inv\u00E1lido 

WSS0801.diag.cause.1=Tipo de SecurityPolicy inv\u00E1lido

WSS0801.diag.check.1=Verifique se a pol\u00EDtica \u00E9 uma das seguintes:  WSSPolicy ou MessagePolicy ou ApplicationSecurityConfiguration



WSS0802.securitypolicy.notsatisfied=SecurityPolicy {0} n\u00E3o satisfeita

WSS0802.diag.cause.1=SecurityPolicy n\u00E3o atendida

WSS0802.diag.check.1=Certifique-se de que todos os requisitos da pol\u00EDtica s\u00E3o v\u00E1lidos e foram atendidos



WSS0803.soapmessage.notset=O par\u00E2metro javax.xml.soap.SOAPMessage n\u00E3o foi definido no ProcessingContext

WSS0803.diag.cause.1=SOAPMessage \u00E9 nulo

WSS0803.diag.check.1=Certifique-se de que o handler SOAPMessage foi definido adequadamente no ProcessingContext



WSS0804.callback.handler.notset=SecurityEnvironment/javax.security.auth.callback. Implementa\u00E7\u00E3o de CallbackHandler n\u00E3o definido no ProcessingContext

WSS0804.diag.cause.1=O handler de callback \u00E9 nulo

WSS0804.diag.check.1=Certifique-se de que o handler de Callback foi definido adequadamente no ProcessingContext



#warning

WSS0805.policy.null=A pol\u00EDtica \u00E9 nula



WSS0806.static.context.null=O contexto est\u00E1tico \u00E9 nulo



WSS0807.no.body.element=Nenhum elemento do corpo encontrado

WSS0807.diag.cause.1=O elemento SOAPBody n\u00E3o foi encontrado na mensagem

WSS0807.diag.check.1=Verifique a exce\u00E7\u00E3o subjacente para obter dicas



WSS0808.no.body.element.operation=Nenhum elemento do corpo que identifica uma opera\u00E7\u00E3o foi encontrado

WSS0808.diag.cause.1=Elemento SOAPBody que identifica a opera\u00E7\u00E3o n\u00E3o foi encontrado

WSS0808.diag.check.1=SOAPBody deve conter filho com a opera\u00E7\u00E3o


WSS0809.fault.WSSSOAP=WSS0809: ocorreu Falha de SOAP de WSS
WSS0810.method.invocation.failed=WSS0810: falha na Chamada do M\u00E9todo
WSS0811.exception.instantiating.aliasselector=WSS0811: exce\u00E7\u00E3o ao instanciar AliasSelector fornecido pelo Usu\u00E1rio
WSS0812.exception.instantiating.certselector=WSS0812: exce\u00E7\u00E3o ao instanciar CertSelector fornecido pelo Usu\u00E1rio
WSS0813.failedto.getcertificate=WSS0813: ocorreu Exce\u00E7\u00E3o de E/S: falha ao obter o certificado da \u00E1rea de armazenamento confi\u00E1vel
# {0} - target in policy (e.g.: "MessageID"/"BinarySecurityToken ") , {1} - "Signature"/"Encryption" (policy type) e.g.: Policy verification error:Missing target BinarySecurityToken for Signature
WSS0814.policy.verification.error.missing.target=WSS0814: erro na verifica\u00E7\u00E3o da pol\u00EDtica, alvo {0} para {1} n\u00E3o encontrado
WSS0815.Nonce.repeated.error=WSS: Nonce Repetido: o Cache Nonce j\u00E1 cont\u00E9m o valor {0} de nonce
WSS0816.base64.decoding.error=WSS0816: exce\u00E7\u00E3o de decodifica\u00E7\u00E3o Base64
WSS0817.keystore.login.module.login.error=WSS0817: erro ao fazer log-in no keystoreloginmodule
WSS0818.error.putting.certificate.epridentity=WSS0818: erro ao colocar o certificado do servidor na Identidade de EPR
WSS0819.error.getting.certificate.epridentity=WSS0819: erro ao tentar obter o certificado da extens\u00E3o da Identidade

WSS0820.error.validate.certificate.epridentity=WSS0820: exce\u00E7\u00E3o durante a valida\u00E7\u00E3o do certificado do servidor obtido da Identidade de PER
WSS0821.certificate.not.found.for.alias=WSS0821: certificado n\u00E3o encontrado correspondente ao apelido {0}
WSS0822.error.validating.server.certificate=WSS0822: n\u00E3o foi poss\u00EDvel validar o certificado do servidor, ele n\u00E3o est\u00E1 sendo utilizado
WSS0823.alias.notfound.for.aliasSelector=WSS0823: apelido recuperado usando o aliasSelector \u00E9 nulo
WSS0824.using.server.certificate.from.eprIdentity=WSS0824: o certificado encontrado no wsdl do servidor ou pela propriedade do certificado do servidor \u00E9 v\u00E1lido, ent\u00E3o est\u00E1 sendo utilizado

WSS0825.error.validate.nonce=WSS0825: erro ao validar Nonce do Armazenamento Complementar
WSS0826.error.initialize.backingstore=WSS0826: erro durante a inicializa\u00E7\u00E3o do armazenamento Complementar
WSS0827.error.removing.expired.entries=WSS0827: erro ao remover as entradas expiradas do armazenamento Complementar
###########

# Adding BSP related requirement failures

BSP3227.Single.Timestamp=BSP3227: um SECURITY_HEADER n\u00E3o deve conter mais de um TIMESTAMP.

BSP3203.Onecreated.Timestamp=BSP3203: um TIMESTAMP deve ter exatamente um filho do elemento wsu:Created.

BSP3224.Oneexpires.Timestamp=BSP3203: um TIMESTAMP deve ter exatamente um filho do elemento wsu:Expires.

BSP3222.element_not_allowed_under_timestmp = BSP3222: {0} n\u00E3o \u00E9 permitido em TIMESTAMP. 

BSP3221.CreatedBeforeExpires.Timestamp=BSP3221: wsu:Expires deve aparecer ap\u00F3s wsu:Created no Timestamp

BSP3225.createdValueType.Timestamp=BSP3225: um elemento wsu:Created dentro de um TIMESTAMP n\u00E3o deve incluir um atributo ValueType.

BSP3226.expiresValueType.Timestamp=BSP3226: um elemento wsu:Expires dentro de um TIMESTAMP n\u00E3o deve incluir um atributo ValueType.

BSP4201.PasswordType.Username=BSP4201: Um elemento wsse:UsernameToken/wsse:Password em um SECURITY_HEADER deve especificar um atributo Type.

BSP3029.EncodingType.NotPresent=BSP3029: qualquer wsse:BinarySecurityToken em um SECURE_ENVELOPE deve ter um atributo EncodingType.

BSP3030.EncodingType.Invalid=BSP3030: o valor do atributo EncodingType em wsse:BinarySecurityToken \u00E9 inv\u00E1lido.

BSP3031.ValueType.NotPresent=BSP3031: qualquer elemento wsse:BinarySecurityToken em um SECURE_ENVELOPE deve ter um atributo ValueType.
BSP3104.envelopedSignature.discoraged = BSP3104: a Assinatura Envelopada n\u00E3o \u00E9 recomendada por BSP 1.1
BSP5602.encryptedkey.recipient = BSP5602 : EncryptedKey com ID {0} n\u00E3o deve conter o atributo Destinat\u00E1rio.
BSP5603.encryptedkey.encryptionmehod = BSP5603: o elemento EncryptedKey com o ID {0} deve conter um elemento filho EncryptionMethod.
BSP5622.encryptedkey.mimetype = BSP 5622 : o elemento EncryptedKey com o ID {0} n\u00E3o deve conter um atributo MimeType.
BSP5623.encryptedkey.encoding = BSP 5623 : o elemento EncryptedKey com o ID {0} deve conter um atributo de codifica\u00E7\u00E3o.
BSP5601.encrypteddata.encryptionmethod = BSP 5601: o elemento EncryptedData com o ID {0} deve conter um elemento filho EncryptionMethod.
BSP5624.encrypteddata.idattribute = BSP 5624 : o elemento EncryptedData deve ter o atributo do ID.
BSP5629.encrypteddata.keyinfo = BSP 5629 : EncryptedData deve conter o elemento filho KeyInfo, pois ele n\u00E3o est\u00E1 sendo referenciado do elemento EncryptedKey.
BSP5426.encryptedkeyinfo = BSP 5426 : o elemento KeyInfo em EncryptedKey ou EncryptedData com o ID {0} deve conter o elemento filho SecurityTokenReference.
BSP5608.encrypteddata.refuri = BSP 5608 : o elemento DataReference em EncryptedData deve conter um atributo de URI que cont\u00E9m um XPointer de Resumo.
BSP3006.encryptedkey.refuri =  BSP 3006 : o elemento DataReference em EncryptedKey deve conter um atributo de URI que cont\u00E9m um XPointer de Resumo.

BSP5620.encrypteddata.uri = BSP 5620 : o algoritmo de criptografia de dados deve ser um dos seguintes: "http://www.w3.org/2001/04/xmlenc#tripledes-cbc","http://www.w3.org/2001/04/xmlenc#aes128-cbc" ou "http://www.w3.org/2001/04/xmlenc#aes256-cbc".
BSP5626.keyencryptionalgo = BSP 5626 : o algoritmo de criptografia de chave deve ser: "http://www.w3.org/2001/04/xmlenc#rsa-1_5" ou "http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" ou "http://www.w3.org/2001/04/xmlenc#kw-tripledes" ou "http://www.w3.org/2001/04/xmlenc#kw-aes128" ou "http://www.w3.org/2001/04/xmlenc#kw-aes256".
BSP3057.str.not.ref.str = BSP 3057 : o elemento de refer\u00EAncia em SecurityTokenReference n\u00E3o deve fazer refer\u00EAncia a outro elemento SecurityTokenReference.
BSP3064.str.not.ref.str.embedded = BSP 3064 : o elemento de refer\u00EAncia em wsse:SecurityTokenReference n\u00E3o deve fazer refer\u00EAncia ao elemento wsse:Embedded que \u00E9 um elemento filho de outro elemento wsse:SecurityTokenReference.
BSP3059.str.value.type = BSP 3059 : o elemento de refer\u00EAncia em wsse:SecurityTokenReference deve ter um atributo ValueType.
BSP3058.str.value.type.notempty = BSP 3058 : o atributo ValueType do elemento de refer\u00EAncia em wsse:SecurityTokenReference deve ter um valor especificado.
BSP3062.str.uriattribute = BSP 3062 : o elemento de refer\u00EAncia em wsse:SecurityTokenReference deve ter um atributo de URI.
BSP3027.str.key.name = BSP 3027 : wsse:SecurityTokenReference n\u00E3o deve conter KeyName como ds:KeyName.
BSP3028.str.keyidentifier = BSP 3028 : o atributo ValueType do elemento wsse:SecurityTokenReference n\u00E3o deve ser vazio.
BSP3071.str.encodingType = BSP 3071 : o atributo EncodingType do elemento wsse:SecurityTokenReference deve ter um valor "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary".
BSP5204.str.internal.str.reference = BSP 5204 : wsse:SecurityTokenReference para um token de seguran\u00E7a interno que tem um atributo de ID deve conter um atributo de URI com um valor de XPointer resumido.
BSP5416.signature_transform = BSP 5416 : uma Assinatura deve conter um elemento filho de Transforma\u00E7\u00E3o.
BSP5423.signature_transform_algorithm = BSP 5423 : um algoritmo de transforma\u00E7\u00E3o deve ter um valor de "http://www.w3.org/2001/10/xml-exc-c14n#" ou "http://www.w3.org/2002/06/xmldsig-filter2" ou "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#STR-Transform" ou "http://www.w3.org/2000/09/xmldsig#enveloped-signature" ou "http://docs.oasis-open.org/wss/oasis-wss-SwAProfile-1.1#Attachment-Content-Signature-Transform" ou "http://docs.oasis-open.org/wss/oasis-wss-SwAProfile-1.1#Attachment-Complete-Signature-Transform".
BSP5420.digest.method = BSP 5420 : um algoritmo de Compila\u00E7\u00E3o deve ter o valor "http://www.w3.org/2000/09/xmldsig#sha1".
BSP5421.signature.method = BSP5421 : o M\u00E9todo de Assinatura deve ter o valor de "http://www.w3.org/2000/09/xmldsig#hmac-sha1" ou de "http://www.w3.org/2000/09/xmldsig#rsa-sha1".

#copied from impl-opt domain logger
WSS1601.ssl.not.enabled = WSS1601: os Requisitos de Seguran\u00E7a n\u00E3o foram atendidos - Bind de Transporte configurado na pol\u00EDtica, mas a mensagem de entrada n\u00E3o estava ativada por SSL

#KerberosLogin
WSS1650.kerberos.key.warning = O Principal do Servi\u00E7o em KerberosConfig {0} n\u00E3o corresponde ao TargetName {1} de GSSContext
