#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2017 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://oss.oracle.com/licenses/CDDL+GPL-1.1
# or LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Error codes WSS1200-1299 reserved for crypto



WSS1200.error.decrypting.key=WSS1200: \uC554\uD638\uD654 \uD0A4 \uD574\uB3C5 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1201.cid_encrypt_all_notsupported=WSS1201: EncryptedData\uAC00 ReferenceList\uC5D0 \uD3EC\uD568\uB418\uC9C0 \uC54A\uC744 \uACBD\uC6B0 \uD655\uC778 \uC694\uAD6C \uC0AC\uD56D cid:*\uAC00 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSS1202.couldnot.locate.symmetrickey=WSS1202: \uD574\uB3C5\uC5D0 \uD544\uC694\uD55C \uB300\uCE6D \uD0A4\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1203.unableto.decrypt.message=WSS1203: \uBA54\uC2DC\uC9C0\uB97C \uD574\uB3C5\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC608\uC678 \uC0AC\uD56D [ {0} ]\uC774(\uAC00) \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1204.crlf.init.failed=WSS1204: \uB0B4\uBD80 \uBC84\uD37C\uB97C \uCD08\uAE30\uD654\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1205.unableto.initialize.xml.cipher=WSS1205: XML \uC554\uD638\uD654\uB97C \uCD08\uAE30\uD654\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1206.illegal.target=WSS1206: \uC798\uBABB\uB41C \uC554\uD638\uD654 \uB300\uC0C1 {0}

WSS1207.unableto.encrypt.message=WSS1207: \uC694\uC18C\uB97C \uC554\uD638\uD654\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1208.failedto.generate.random.symmetrickey=WSS1208: \uBB34\uC791\uC704 \uB300\uCE6D \uD0A4\uB97C \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC608\uC678 \uC0AC\uD56D [ {0} ]\uC774(\uAC00) \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1209.failedto.locate.EncryptPart.Message=WSS1209: \uBA54\uC2DC\uC9C0\uC5D0\uC11C \uC9C0\uC815\uB41C \uC554\uD638\uD654 \uBD80\uBD84\uC744 \uC804\uD600 \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1210.unsupported.UsernameToken.AsKeyBinding.EncryptionPolicy=WSS1210: UsernameToken\uC740 EncryptionPolicy\uC758 KeyBinding\uC73C\uB85C \uC544\uC9C1 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSS1211.unsupported.KeyIdentifierStrategy.X509v1=WSS1211: X509v1 \uC778\uC99D\uC11C\uC758 \uD0A4 \uC2DD\uBCC4\uC790 \uC804\uB7B5\uC740 \uD5C8\uC6A9\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSS1212.error.SAMLAssertionException=WSS1212: SAML \uAC80\uC99D\uC744 \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1213.null.SAMLAssertion=WSS1213: SAML \uAC80\uC99D\uC774 NULL\uC785\uB2C8\uB2E4.

WSS1214.unableto.locate.certificate.SAMLAssertion=WSS1214: SAML \uAC80\uC99D\uC758 SubjectConfirmation\uC5D0\uC11C \uD0A4\uC5D0 \uD574\uB2F9\uD558\uB294 \uC778\uC99D\uC11C\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1215.unsupported.EmbeddedReference.SAMLAssertion=WSS1215: SAML \uAC80\uC99D\uC5D0 \uB300\uD55C \uB0B4\uC7A5\uB41C \uCC38\uC870 \uC720\uD615\uC740 \uC544\uC9C1 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSS1216.unableto.get.symmetrickey.Encryption=WSS1216: \uC554\uD638\uD654\uC6A9 \uB300\uCE6D \uD0A4\uB97C \uAC00\uC838\uC62C \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1217.null.IssueToken=WSS1217: \uBA54\uC2DC\uC9C0\uB85C \uC0BD\uC785\uD560 \uBC1C\uD589\uB41C \uD1A0\uD070\uC774 \uB110\uC785\uB2C8\uB2E4.

WSS1218.unableto.locate.IssueToken.Message=WSS1218: \uBA54\uC2DC\uC9C0\uC5D0\uC11C \uBC1C\uD589\uB41C \uD1A0\uD070\uC744 \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1219.unableto.refer.Attached.IssueToken=WSS1219: \uBA54\uC2DC\uC9C0\uC5D0 \uCCA8\uBD80\uB41C \uBC1C\uD589\uB41C \uD1A0\uD070\uC744 \uCC38\uC870\uD558\uB294 \uBC29\uBC95\uC744 \uD655\uC778\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1220.unableto.refer.Un-Attached.IssueToken=WSS1220: \uBA54\uC2DC\uC9C0\uC5D0 \uCCA8\uBD80\uB418\uC9C0 \uC54A\uC740 \uBC1C\uD589\uB41C \uD1A0\uD070\uC744 \uCC38\uC870\uD558\uB294 \uBC29\uBC95\uC744 \uD655\uC778\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1221.null.SecureConversationToken=WSS1221: SecureConversation \uD1A0\uD070\uC744 \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1222.unsupported.KeyBinding.EncryptionPolicy=WSS1222: EncryptionPolicy\uC5D0 \uB300\uD574 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uB294 \uD0A4 \uBC14\uC778\uB529

WSS1223.unableto.set.KeyInfo.EncryptedKey=WSS1223: \uC554\uD638\uD654\uB41C \uD0A4\uC758 keyinfo\uB97C \uC124\uC815\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSS1224.error.insertion.HeaderBlock.SecurityHeader=WSS1224: \uBCF4\uC548 \uD5E4\uB354\uC5D0\uC11C \uD5E4\uB354 \uBE14\uB85D\uC744 \uC0BD\uC785\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1225.error.encrypting.Attachment=WSS1225: \uCCA8\uBD80 \uD30C\uC77C\uC744 \uC554\uD638\uD654\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1226.error.serialize.headers=WSS1226: \uD5E4\uB354\uB97C \uC9C1\uB82C\uD654\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1227.keyEncryptionAlg.Violation=WSS1227: BSP5621 \uC704\uBC18. KeyEncryption \uC54C\uACE0\uB9AC\uC998\uC740 #rsa-1_5,#rsa-oaep-mgf1p,#kw-tripledes,#kw-aes256,#kw-aes128 \uC911 \uD558\uB098\uC5EC\uC57C \uD569\uB2C8\uB2E4.

WSS1228.DataEncryptionAlg.Violation=WSS1228: DataEncryption \uC54C\uACE0\uB9AC\uC998\uC758 \uD5C8\uC6A9\uB41C \uAC12\uC5D0 \uAD00\uD55C BSP5620 \uC704\uBC18

WSS1229.Error.Processing.EncrpytedKey=WSS1229: \uC554\uD638\uD654\uB41C \uD0A4\uB97C \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1230.failed.receiverReq=WSS1230: URI\uC5D0 \uB300\uD55C \uC218\uC2E0\uC790 \uC694\uAD6C \uC0AC\uD56D\uC774 \uCDA9\uC871\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSS1231.null.SymmetricKey=WSS1231: \uB300\uCE6D \uD0A4\uAC00 \uB110\uC785\uB2C8\uB2E4.

WSS1232.failedto.decrypt.attachment=WSS1232: \uCCA8\uBD80 \uD30C\uC77C \uD574\uB3C5\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.

WSS1233.failed.get.DataEncryptionAlgorithm=WSS1233: \uB370\uC774\uD130 \uC554\uD638\uD654 \uC54C\uACE0\uB9AC\uC998 \uAC00\uC838\uC624\uAE30\uB97C \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.

WSS1234.invalid.transform=WSS1234: \uC9C0\uC815\uB41C \uC54C\uACE0\uB9AC\uC998\uC5D0 \uB300\uD55C \uC608\uC0C1\uCE58 \uC54A\uC740 \uBCC0\uD658\uC785\uB2C8\uB2E4.

WSS1234.unmatched.content-id=WSS1234: \uC554\uD638\uD654\uB41C \uCCA8\uBD80 \uD30C\uC77C\uACFC \uD574\uB3C5\uB41C \uCCA8\uBD80 \uD30C\uC77C\uC758 Content-Id\uAC00 \uC77C\uCE58\uD558\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSS1235.failedto.get.targetElements=WSS1225: \uB300\uC0C1 \uC694\uC18C \uAC00\uC838\uC624\uAE30\uB97C \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.

WSS1236.exception.soap=WSS1236: SOAP \uC694\uC18C\uB97C \uBCC0\uACBD\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 SOAP \uC608\uC678 \uC0AC\uD56D\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1237.Error.Processing.EncrpytedData=WSS1237: \uC554\uD638\uD654\uB41C \uB370\uC774\uD130\uB97C \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1238.failed.receiverReq.attachments=WSS1238: \uC218\uC2E0\uC790 \uC694\uAD6C \uC0AC\uD56D cid:*\uAC00 \uCDA9\uC871\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4. \uC804\uCCB4 \uC911 \uBA87\uBA87 \uCCA8\uBD80 \uD30C\uC77C\uB9CC \uC554\uD638\uD654\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSS1239.failed.receiverReq.more=WSS1239: \uBA54\uC2DC\uC9C0\uC5D0 \uC788\uB294 \uAC83\uBCF4\uB2E4 \uB354 \uB9CE\uC740 \uC218\uC2E0\uC790 \uC694\uAD6C \uC0AC\uD56D\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSS1240.failed.receiverReq.moretargets=WSS1240: \uC218\uC2E0\uC790 \uC694\uAD6C \uC0AC\uD56D\uC5D0 \uB354 \uB9CE\uC740 \uB300\uC0C1\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSS1241.failed.receiverReq.encryptedData=WSS1241: ID "+id+"\uC758 EncryptedData\uC5D0 \uB300\uD55C \uC218\uC2E0\uC790 \uC694\uAD6C \uC0AC\uD56D\uC774 \uCDA9\uC871\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4."

WSS1242.exception.dom=WSS1242: SOAP \uC694\uC18C\uB97C \uBCC0\uACBD\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 DOM \uC608\uC678 \uC0AC\uD56D\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1243.bst.decoding.error=WSS1243: BST \uAC12\uC744 \uB514\uCF54\uB529\uD558\uB294 \uC911 Base64 \uB514\uCF54\uB529 \uC608\uC678 \uC0AC\uD56D\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSS1244.no.attachment.found=WSS1244: \uBCF4\uC548\uD560 \uBA54\uC2DC\uC9C0\uC5D0\uC11C \uCCA8\uBD80 \uBD80\uBD84\uC744 \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
