#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2017 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://oss.oracle.com/licenses/CDDL+GPL-1.1
# or LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

WSS1500.invalid.usernameHandler=WSS1500: el manejador de nombres de usuario no se ha configurado correctamente mediante la devoluci\u00F3n de llamada y es nulo. (No est\u00E1 configurado).

WSS1501.no.password.validator=WSS1501: no se ha especificado ning\u00FAn validador de contrase\u00F1as en la configuraci\u00F3n

WSS1502.unsupported.digestAuth=WSS1502: la autenticaci\u00F3n de resumen de la solicitud de contrase\u00F1a no est\u00E1 soportada

WSS1503.unsupported.requesttype=WSS1503: tipo de solicitud no soportado para la validaci\u00F3n de contrase\u00F1a

WSS1504.unsupported.callbackType=WSS1504: se ha encontrado un tipo de devoluci\u00F3n de llamada no soportado

WSS1505.failedto.getkey=WSS1505: Se ha producido una excepci\u00F3n de E/S: fallo al obtener la clave o el certificado de KeyStore (no es necesariamente una excepci\u00F3n de E/S)

WSS1506.invalid.SAMLPolicy=WSS1506: la afirmaci\u00F3n SAML no est\u00E1 presente en la pol\u00EDtica.

WSS1507.no.SAMLCallbackHandler=WSS1507: El elemento CallbackHandler de SAML necesario no se ha especificado en la configuraci\u00F3n: no se puede rellenar la afirmaci\u00F3n SAML

WSS1508.failed.validateSAMLAssertion=WSS1508: fallo al validar la afirmaci\u00F3n SAML

WSS1509.failed.init.truststore=WSS1509: fallo al inicializar TrustStore

WSS1510.failed.init.keystore=WSS1510: fallo al inicializar KeyStore

# PEER is an alias name for the certificate. Should not be translated.
WSS1511.failed.locate.peerCertificate=WSS1511: se ha producido un error al buscar el certificado de entidad PEER en TrustStore.

WSS1512.failed.locate.certificate.privatekey=WSS1512: se ha producido un error al buscar el certificado y la clave privada por defecto en KeyStore.

WSS1513.exception.validate.timestamp=WSS1513: Excepci\u00F3n en la validaci\u00F3n del registro de hora: se ha producido un error al analizar el registro de hora UTC del formato de fecha.

WSS1514.error.aheadCurrentTime=WSS1514: la hora actual es posterior a la hora de caducidad en el registro de hora

WSS1515.error.currentTime=WSS1515: la hora de creaci\u00F3n es anterior a currenttime - timestamp-freshness-limit - max-clock-skew

WSS1516.error.creationAheadCurrent.time=WSS1516: la hora de creaci\u00F3n es posterior a la hora actual

WSS1517.X509.expired=WSS1517: el certificado X509 ha caducado.

WSS1518.failedto.validate.certificate=WSS1518: fallo al validar el certificado

WSS1519.no.digest.algorithm=WSS1519: no se ha encontrado el algoritmo de resumen SHA-1

WSS1520.error.getting.rawContent=WSS1520: error al obtener el contenido raw del certificado

WSS1521.error.getting.userClass=WSS1512: no se ha encontrado la clase de usuario

WSS1522.error.getting.longValue=WSS1522: error al obtener el valor largo

WSS1523.error.getting.newInstance.CallbackHandler=WSS1523: error al obtener la nueva instancia de CallbackHandler

WSS1524.unableto.resolve.URI.WSIT_HOME.notset=WSS1524: la URL de configuraci\u00F3n especificada en el WSDL no se ha podido resolver porque no se ha definido la propiedad del sistema WSIT_HOME

WSS1525.invalid.passwordHandler=WSS1525: el manejador de contrase\u00F1as no se ha configurado correctamente mediante la devoluci\u00F3n de llamada y es nulo. (No est\u00E1 configurado).

WSS1526.failedto.getcertificate=WSS1526: Se ha producido una excepci\u00F3n de E/S: fallo al obtener el certificado de TrustStore

WSS1527.X509.notValid=WSS1527: fallo en la validaci\u00F3n del certificado X509.

WSS1528.failed.initialize.key.password=WSS1528: se ha producido un error al obtener la contrase\u00F1a de clave de KeyStore.

WSS1529.exception.in.certstore.callback=WSS1529: excepci\u00F3n en CertStoreCallback 
WSS1530.exception.in.certstore.lookup=WSS1530: se ha producido una excepci\u00F3n al buscar CertStore
WSS1531.exception.instantiating.certselector=WSS1531: se ha producido una excepci\u00F3n al instanciar el elemento CertSelector proporcionado por el usuario
WSS1532.exception.instantiating.aliasselector=WSS1532: se ha producido una excepci\u00F3n al instanciar el elemento AliasSelector proporcionado por el usuario
WSS1533.X509.SelfSignedCertificate.notValid=WSS1533: fallo en la validaci\u00F3n del certificado autofirmado.
WSS1534.no.keystore.set.in.keystorecallback.callbackhandler=WSS1534: CallbackHandler no ha definido ning\u00FAn elemento KeyStore en KeyStorCallback
WSS1535.error.keystore.using.callback=WSS1535: excepci\u00F3n al obtener el valor KeyStore mediante la devoluci\u00F3n de llamada de KeyStore
WSS1536.no.truststore.set.in.truststorecallback=WSS1536: CallbackHandler no ha definido ning\u00FAn elemento TrustStore en TrustStorCallback
WSS1537.error.truststore.using.callback=WSS1537: excepci\u00F3n al obtener el valor TrustStore mediante la devoluci\u00F3n de llamada de TrustStore
WSS1538.error.getting.privateKey=WSS1538: excepci\u00F3n al obtener la clave privada
WSS1539.privateKey.null.error=WSS1539: PrivateKeyCallback ha devuelto un valor de PrivateKey nulo
WSS1540.keystore.not.found.check.config=WSS1540: no se ha encontrado el elemento KeyStore. Compruebe la afirmaci\u00F3n de KeyStore en la configuraci\u00F3n de WSIT
