#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010-2017 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://oss.oracle.com/licenses/CDDL+GPL-1.1
# or LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

WSS1500.invalid.usernameHandler=WSS1500: o Handler do Nome do usu\u00E1rio N\u00E3o Foi Configurado adequadamente usando o Callback e \u00E9 nulo (n\u00E3o configurado)

WSS1501.no.password.validator=WSS1501: o Validador de Senha N\u00E3o Foi Especificado na Configura\u00E7\u00E3o

WSS1502.unsupported.digestAuth=WSS1502: a Autentica\u00E7\u00E3o da Compila\u00E7\u00E3o da Solicita\u00E7\u00E3o de Senha N\u00E3o \u00E9 Suportada

WSS1503.unsupported.requesttype=WSS1503: tipo de Solicita\u00E7\u00E3o N\u00E3o Suportado para Valida\u00E7\u00E3o de Senha

WSS1504.unsupported.callbackType=WSS1504: tipo de Callback N\u00E3o Suportado Encontrado

WSS1505.failedto.getkey=WSS1505: ocorreu Exce\u00E7\u00E3o de E/S: falha ao obter a chave/certificado da \u00C1rea de Armazenamento de Chaves (n\u00E3o necessariamente exce\u00E7\u00E3o de e/s)

WSS1506.invalid.SAMLPolicy=WSS1506: asser\u00E7\u00E3o SAML n\u00E3o presente na Pol\u00EDtica.

WSS1507.no.SAMLCallbackHandler=WSS1507: um Handler de Callback do SAML Obrigat\u00F3rio n\u00E3o foi especificado na configura\u00E7\u00E3o. N\u00E3o \u00E9 Poss\u00EDvel Preencher a Asser\u00E7\u00E3o SAML

WSS1508.failed.validateSAMLAssertion=WSS1508: falha ao validar a Asser\u00E7\u00E3o SAML

WSS1509.failed.init.truststore=WSS1509: falha ao inicializar a \u00C1rea de Armazenamento Confi\u00E1vel

WSS1510.failed.init.keystore=WSS1510: falha ao inicializar a \u00C1rea de Armazenamento de Chaves

# PEER is an alias name for the certificate. Should not be translated.
WSS1511.failed.locate.peerCertificate=WSS1511: ocorreu um Erro ao localizar o Certificado de Entidade de PEER na \u00C1rea de Armazenamento Confi\u00E1vel

WSS1512.failed.locate.certificate.privatekey=WSS1512: ocorreu um Erro ao localizar o certificado default e a chave privada na \u00C1rea de Armazenamento de Chaves.

WSS1513.exception.validate.timestamp=WSS1513: ocorreu uma Exce\u00E7\u00E3o na valida\u00E7\u00E3o de Timestamp: ocorreu um Erro ao fazer parse do Timestamp de UTC no formato de Data.

WSS1514.error.aheadCurrentTime=WSS1514: a hora atual \u00E9 posterior \u00E0 hora da expira\u00E7\u00E3o no Timestamp"

WSS1515.error.currentTime=WSS1515: o hor\u00E1rio de cria\u00E7\u00E3o \u00E9 anterior ao currenttime - timestamp-freshness-limit - max-clock-skew

WSS1516.error.creationAheadCurrent.time=WSS1516: o hor\u00E1rio de cria\u00E7\u00E3o \u00E9 posterior ao hor\u00E1rio atual

WSS1517.X509.expired=WSS1517: X509Certificate Expirado.

WSS1518.failedto.validate.certificate=WSS1518: falha ao validar o certificado

WSS1519.no.digest.algorithm=WSS1519: algoritmo de compila\u00E7\u00E3o SHA-1 n\u00E3o encontrado

WSS1520.error.getting.rawContent=WSS1520: erro ao obter o conte\u00FAdo bruto do certificado

WSS1521.error.getting.userClass=WSS1512: n\u00E3o foi poss\u00EDvel localizar a Classe do Usu\u00E1rio

WSS1522.error.getting.longValue=WSS1522: erro ao obter o valor longo

WSS1523.error.getting.newInstance.CallbackHandler=WSS1523: erro ao obter a nova inst\u00E2ncia do handler de callback

WSS1524.unableto.resolve.URI.WSIT_HOME.notset=WSS1524: o URL de configura\u00E7\u00E3o especificado no WSDL n\u00E3o p\u00F4de ser resolvido porque a Propriedade do Sistema WSIT_HOME n\u00E3o foi definida

WSS1525.invalid.passwordHandler=WSS1525: o Handler de Senha N\u00E3o Foi Configurado adequadamente usando o Callback e \u00E9 nulo (n\u00E3o configurado)

WSS1526.failedto.getcertificate=WSS1526: ocorreu Exce\u00E7\u00E3o de E/S: falha ao obter o certificado da \u00C1rea de Armazenamento Confi\u00E1vel

WSS1527.X509.notValid=WSS1527: falha na Validade do Certificado X509.

WSS1528.failed.initialize.key.password=WSS1528: ocorreu um Erro ao obter a Senha da Chave da \u00C1rea de Armazenamento de Chaves.

WSS1529.exception.in.certstore.callback=WSS1529: exce\u00E7\u00E3o em CertStoreCallback 
WSS1530.exception.in.certstore.lookup=WSS1530: exce\u00E7\u00E3o ao pesquisar o CertStore
WSS1531.exception.instantiating.certselector=WSS1531: exce\u00E7\u00E3o ao instanciar CertSelector fornecido pelo Usu\u00E1rio
WSS1532.exception.instantiating.aliasselector=WSS1532: exce\u00E7\u00E3o ao instanciar AliasSelector fornecido pelo Usu\u00E1rio
WSS1533.X509.SelfSignedCertificate.notValid=WSS1533: falha na valida\u00E7\u00E3o do certificado autoassinado.
WSS1534.no.keystore.set.in.keystorecallback.callbackhandler=WSS1534: nenhuma \u00C1rea de Armazenamento de Chaves definida no KeyStorCallback pelo CallbackHandler
WSS1535.error.keystore.using.callback=WSS1535: exce\u00E7\u00E3o ao obter a \u00C1rea de Armazenamento de Chaves usando o callback da \u00E1rea de armazenamento de chaves
WSS1536.no.truststore.set.in.truststorecallback=WSS1536:nenhuma \u00C1rea de Armazenamento Confi\u00E1vel definida no TrustStorCallback pelo CallbackHandler
WSS1537.error.truststore.using.callback=WSS1537: exce\u00E7\u00E3o ao obter a \u00C1rea de Armazenamento de Chaves usando o callback da \u00E1rea de armazenamento de chaves
WSS1538.error.getting.privateKey=WSS1538: exce\u00E7\u00E3o ao obter a chave privada
WSS1539.privateKey.null.error=WSS1539: a PrivateKey retornada por PrivateKeyCallback era Nula
WSS1540.keystore.not.found.check.config=WSS1540: n\u00E3o foi poss\u00EDvel localizar a \u00C1rea de Armazenamento de Chaves, verifique a asser\u00E7\u00E3o da \u00C1rea de Armazenamento de Chaves na configura\u00E7\u00E3o de WSIT
