#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes


#config from 100 to 120

WSS0100.createFor.creating.impl=WSS0100 : la m\u00E9thode Processor.createFor cr\u00E9e une instance de {0}



#Filter Messages from 121 to 299

#WSS0121.no.jce.provider=WSS0121: Unable to locate a JCE provider for {0}



WSS0126.unsupported.privatekey.type=WSS0126 : type de cl\u00E9 PrivateKey non pris en charge

WSS0126.diag.cause.1=Type d'algorithme non pris en charge. Seul RSA est pris en charge.

WSS0126.diag.check.1=V\u00E9rifiez que la signature d'algorithme est RSA



WSS0127.unableto.sign.message=WSS0127 : impossible de signer le message



WSS0128.unableto.encrypt.message=WSS0128 : impossible de crypter l'\u00E9l\u00E9ment



WSS0129.no.dssignature.in.security.headerblock=WSS0129 : impossible d''extraire l''\u00E9l\u00E9ment ds:Signature \u00E0 partir du bloc d''en-t\u00EAte wsse:Security ; exception : [ {0} ]

WSS0129.diag.cause.1=Format de message incorrect ; \u00E9l\u00E9ment ds:Signature manquant dans le bloc d'en-t\u00EAte wsse:Security

WSS0129.diag.check.1=V\u00E9rifiez qu'une signature correcte a \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9e



WSS0131.dskeyinfo.doesnot.contain.refto.sectoken=WSS0131 : l'\u00E9l\u00E9ment ds:KeyInfo du message ne contient pas de r\u00E9f\u00E9rence \u00E0 un jeton de s\u00E9curit\u00E9



WSS0133.exception.while.verifying.signature=WSS0133 : exception [ {0} ] lors de la v\u00E9rification de la signature


WSS0134.unableto.initialize.xml.cipher=WSS0134 : impossible d'initialiser le cryptage XML

WSS0134.diag.cause.1=Impossible d'initialiser XMLCipher avec la cl\u00E9 indiqu\u00E9e

WSS0134.diag.check.1=V\u00E9rifiez que XMLCipher a \u00E9t\u00E9 initialis\u00E9 correctement



WSS0135.unableto.encrypt.symmetric.key=WSS0135 : exception [ {0} ] lors de la tentative de cryptage de la cl\u00E9 sym\u00E9trique



WSS0137.unableto.decrypt.message=WSS0137 : exception [ {0} ] lors de la tentative de d\u00E9cryptage du message

WSS0137.diag.cause.1=Aucun fournisseur JCE appropri\u00E9 n'est configur\u00E9 dans l'environnement JRE

WSS0137.diag.check.1=Consultez l'exception racine pour plus d'informations



WSS0138.unableto.find.wsse.keyidentifier=WSS0138 : l'\u00E9l\u00E9ment wsse:KeyIdentifier est introuvable



WSS0139.unableto.find.matching.privatekey=WSS0139 : exception [ {0} ] lors de la recherche d''un \u00E9l\u00E9ment PrivateKey correspondant



WSS0140.encryptedkey.doesnot.contain.chiperdata=WSS0140 : l'\u00E9l\u00E9ment xenc:EncryptedKey du message ne contient pas xenc:CipherData/xenc:CipherValue



WSS0141.unableto.decrypt.symmetric.key=WSS0141 : exception [ {0} ] lors de la tentative de d\u00E9cryptage de la cl\u00E9 sym\u00E9trique



WSS0144.unableto.decode.base64.data=WSS0144 : exception [ {0} ] lors de la tentative d\u00E9codage des donn\u00E9es encod\u00E9es en base64

WSS0144.diag.cause.1=L'exception Base64Decoding repr\u00E9sente la cause premi\u00E8re

WSS0144.diag.check.1=V\u00E9rifiez que les donn\u00E9es sont des donn\u00E9es encod\u00E9es en base64 valides



WSS0147.unableto.use.stylesheet=WSS0147 : exception [ {0} ] lors de la tentative d''utilisation de la feuille de style

WSS0147.diag.cause.1=Exception TransformationConfiguration lors de la tentative d'utilisation de la feuille de style pour l'op\u00E9ration d'impression avec mise en forme

WSS0147.diag.check.1=Assurez-vous que la feuille de style est valide



WSS0148.unableto.process.soapmessage=WSS0148 : exception [ {0} ] lors du traitement de l''\u00E9l\u00E9ment SOAPMessage

WSS0148.diag.cause.1=Exception lors de la tentative d'impression avec mise en forme \u00E0 l'aide de la transformation

WSS0148.diag.check.1=Assurez-vous que le message SOAP d'origine et la feuille de style sont corrects



WSS0156.exception.in.cert.validate=WSS0156 : exception [ {0} ] lors de la validation du certificat

WSS0156.diag.cause.1=Erreur d\u00E9tect\u00E9e dans le certificat utilis\u00E9 pour la validation

WSS0156.diag.check.1=V\u00E9rifiez que le jeton contient un certificat valide



WSS0161.unableto.find.matching.privatekey=WSS0161 : aucun \u00E9l\u00E9ment PrivateKey correspondant n'a \u00E9t\u00E9 trouv\u00E9



WSS0165.unable.to.encrypt=WSS0165 : l'expression XPath ne correspond pas \u00E0 un \u00E9l\u00E9ment DOM

WSS0165.diag.cause.1=L'expression XPath ne correspond pas \u00E0 un \u00E9l\u00E9ment DOM

WSS0165.diag.check.1=V\u00E9rifiez que le noeud repr\u00E9sent\u00E9 par l'expression XPath est un \u00E9l\u00E9ment DOM valide



WSS0166.no.binary.security.token.in.header=WSS0166 : impossible d''extraire le jeton de s\u00E9curit\u00E9 binaire requis pour la v\u00E9rification de la signature \u00E0 partir de l''en-t\u00EAte wsse:Security ; exception : [ {0} ]



WSS0167.signature.verification.failed=WSS0167 : \u00E9chec de v\u00E9rification de la signature

WSS0167.diag.cause.1=Signature non valide ; \u00E9chec de la v\u00E9rification

WSS0167.diag.check.1=Assurez-vous que la signature n'a pas \u00E9t\u00E9 falsifi\u00E9e lors du transit



WSS0168.failedto.generate.random.symmetrickey=WSS0168 : exception [ {0} ] lors de la tentative de g\u00E9n\u00E9ration de la cl\u00E9 sym\u00E9trique al\u00E9atoire

WSS0168.diag.cause.1=Impossible de g\u00E9n\u00E9rer une cl\u00E9 sym\u00E9trique al\u00E9atoire

WSS0168.diag.check.1=V\u00E9rifiez que KeyGenerator a \u00E9t\u00E9 initialis\u00E9 correctement



WSS0169.token.not.set.parameter.list=WSS0169 : le jeton \u00E0 exporter n'est pas d\u00E9fini dans la liste de param\u00E8tres

WSS0169.diag.cause.1=La valeur de FilterParameterConstants.BINARY_SEC_TOKEN n'est pas d\u00E9finie

WSS0169.diag.check.1=V\u00E9rifiez que la strat\u00E9gie de r\u00E9f\u00E9rence directe est d\u00E9finie avant l'export du certificat



WSS0181.subject.not.authorized=WSS0181 : le sujet [ {0} ] n''est pas autoris\u00E9

WSS0181.diag.cause.1=Sujet non autoris\u00E9 ; \u00E9chec de la validation

WSS0181.diag.check.1=V\u00E9rifiez que l'utilisateur est autoris\u00E9 

 

WSS0182.referencelist.parameter.null=WSS0182 : le param\u00E8tre xenc:Referencelist requis par le filtre DecryptReferenceList est NULL.

WSS0182.diag.cause.1=Le param\u00E8tre FilterParameterConstants.REFERENCE_LIST a une valeur NULL

WSS0182.diag.check.1=La liste des r\u00E9f\u00E9rences \u00E0 d\u00E9crypter est g\u00E9n\u00E9ralement d\u00E9finie par ImportEncryptedKeyFilter



WSS0183.couldnot.locate.symmetrickey=WSS0183 : la cl\u00E9 sym\u00E9trique requise pour le d\u00E9cryptage est introuvable.

WSS0183.diag.cause.1=Impossible de localiser une cl\u00E9 sym\u00E9trique valide pour le d\u00E9cryptage.

WSS0183.diag.check.1=La valeur de la cl\u00E9 sym\u00E9trique semble NULL. V\u00E9rifiez sa valeur.



WSS0184.securitydomain.null=WSS0184 : le domaine de s\u00E9curit\u00E9 n'est pas d\u00E9fini pour le message

WSS0184.diag.cause.1=Impossible d'extraire le domaine de s\u00E9curit\u00E9 \u00E0 partir du message SOAP pouvant \u00EAtre s\u00E9curis\u00E9

WSS0184.diag.check.1=Assurez-vous que la fabrique SecurityEnvironment d\u00E9finit l'environnement de s\u00E9curit\u00E9 appropri\u00E9.



WSS0185.filterparameter.not.set=WSS0185 : le param\u00E8tre de filtre [ {0} ] n''est pas d\u00E9fini

WSS0185.diag.cause.1=Impossible de localiser le certificat associ\u00E9 \u00E0 la strat\u00E9gie de r\u00E9f\u00E9rence directe

WSS0185.diag.check.1=V\u00E9rifiez que l'URI est valide et que le param\u00E8tre subjectkeyidentifier est d\u00E9fini dans la configuration



WSS0186.certificate.not.found=WSS0186 : aucun identificateur de cl\u00E9 n'a \u00E9t\u00E9 d\u00E9fini (implicitement ou explicitement) et aucun certificat n'a \u00E9t\u00E9 trouv\u00E9 dans le thread d'appel.



WSS0187.prefix.null=WSS0187 : le pr\u00E9fixe ne peut pas \u00EAtre NULL

WSS0187.diag.cause.1=Impossible d'instancier/d'initialiser un filtre comportant un pr\u00E9fixe NULL



WSS0188.prefix.null=WSS0188 : l'espace de noms ne peut pas \u00EAtre NULL

WSS0188.diag.cause.1=Impossible d'instancier/d'initialiser un filtre comportant un espace de noms NULL



WSS0189.unsupported.data.decryption.algorithm=WSS0189 : algorithme de d\u00E9cryptage des donn\u00E9es non pris en charge

WSS0189.diag.cause.1=L'algorithme de d\u00E9cryptage des donn\u00E9es doit \u00EAtre Triple-DES, AES128-CBC ou AES256-CBC

WSS0189.diag.check.1=V\u00E9rifiez que l'algorithme de cryptage utilis\u00E9 est 3DES, AES128_CBC ou AES256_CBC



WSS0190.encryption.requirements.not.met=WSS0190 : le nombre d'\u00E9l\u00E9ments crypt\u00E9s est inf\u00E9rieur au nombre requis/autoris\u00E9

WSS0190.diag.cause.1=Le nombre d'\u00E9l\u00E9ments crypt\u00E9s est inf\u00E9rieur au nombre requis/autoris\u00E9

WSS0190.diag.check.1=V\u00E9rifiez que les r\u00E9f\u00E9rences de donn\u00E9es pour le cryptage (dans le message) r\u00E9pondent aux exigences



WSS0191.symmetrickey.not.set=WSS0191 : aucune cl\u00E9 SymmetricKey n'est d\u00E9finie pour le cryptage 

WSS0191.diag.cause.1=Aucune cl\u00E9 SymmetricKey n'a \u00E9t\u00E9 g\u00E9n\u00E9r\u00E9e avant la p\u00E9riode d\u00E9finie dans le thread d'appel

WSS0191.diag.cause.2=L'\u00E9l\u00E9ment KeyName indiqu\u00E9 n'est pas parvenu \u00E0 localiser une cl\u00E9 dans l'environnement de s\u00E9curit\u00E9

WSS0191.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment ExportEncryptedKeyFilter est appel\u00E9 au pr\u00E9alable 

WSS0191.diag.check.2=V\u00E9rifiez qu'une URL de fichier de cl\u00E9s valide est utilis\u00E9e pour instancier SecurityEnvironment et qu'elle contient une cl\u00E9 SecretKey correspondante



WSS0192.encryption.targets.not.specified=WSS0192 : aucune cible n'est d\u00E9finie pour le cryptage

WSS0192.diag.cause.1=Au moins une cible doit \u00EAtre indiqu\u00E9e pour le cryptage

WSS0192.diag.check.1=V\u00E9rifiez qu'une liste de cibles non NULL est utilis\u00E9e pour instancier le filtre



WSS0193.invalid.target=WSS0193 : la cible ne correspond pas \u00E0 une partie de message valide

WSS0193.diag.cause.1=La cible indiqu\u00E9e ne correspond pas \u00E0 une partie de message valide

WSS0193.diag.check.1=V\u00E9rifiez que des \u00E9l\u00E9ments XPath/QName/wsuId valides sont indiqu\u00E9s



WSS0194.illegal.target=WSS0194 : impossible de crypter l''\u00E9l\u00E9ment {0}

WSS0194.diag.cause.1=SOAP-ENV : impossible de crypter l'int\u00E9gralit\u00E9 de l'en-t\u00EAte

WSS0194.diag.cause.2=SOAP-ENV : impossible de crypter l'int\u00E9gralit\u00E9 du corps

WSS0194.diag.check.1=V\u00E9rifiez que des \u00E9l\u00E9ments XPath/QName/wsuId valides sont indiqu\u00E9s conform\u00E9ment \u00E0 la sp\u00E9cification.



WSS0195.referencelist.not.set=WSS0195 : l'\u00E9l\u00E9ment ReferenceListBlock n'est pas d\u00E9fini dans le thread d'appel

WSS0195.diag.cause.1=L'\u00E9l\u00E9ment ReferenceListBlock n'est pas d\u00E9fini dans le thread d'appel

# Usage not found. TODO Remove
#WSS0195.diag.check.1=Check that ExportEncryptedKeyFilter is called before
# Usage not found. TODO Remove
#WSS0195.diag.check.2=Check that ExportReferenceListFilter is called before



WSS0196.securityenvironment.not.set=WSS0196 : l'\u00E9l\u00E9ment SecurityEnvironment n'est pas d\u00E9fini dans SecurableSoapMessage

WSS0196.diag.cause.1=Aucune instance de la classe SecurityEnvironment pour l'environnement d'exploitation n'a \u00E9t\u00E9 d\u00E9finie dans SecurableSoapMessage

WSS0196.diag.check.1=V\u00E9rifiez que SetSecurityEnvironmentFilter a trait\u00E9 le message au pr\u00E9alable 



WSS0197.keyinfostrategy.null=WSS0197 : l'\u00E9l\u00E9ment KeyInfoStrategy ne doit pas \u00EAtre NULL

WSS0197.diag.cause.1=Impossible d'instancier un filtre comportant un \u00E9l\u00E9ment KeyInfoStrategy NULL



WSS0198.unsupported.signature.algorithm=WSS0198 : algorithme de signature non pris en charge : {0}

WSS0198.diag.cause.1=Seul l'algorithme de signature RSA_SHA1 est pris en charge

WSS0198.diag.check.1=V\u00E9rifiez que l'algorithme de signature RSA_SHA1 est indiqu\u00E9



WSS0199.null.creation.time=WSS0199 : l'heure de cr\u00E9ation de l'horodatage ne peut pas \u00EAtre NULL

WSS0199.diag.cause.1=L'heure de cr\u00E9ation de l'horodatage ne peut pas \u00EAtre NULL

WSS0199.diag.check.1=V\u00E9rifiez qu'une heure de cr\u00E9ation non NULL est utilis\u00E9e pour instancier le filtre



WSS0200.ineffective.callback.handler=WSS0200 : XWSSCallbackHandler inefficace

WSS0200.diag.cause.1=CallbackHandler n'est pas parvenu \u00E0 obtenir un nom utilisateur/mot de passe lors de l'ex\u00E9cution



# {0} - most likely an exception message
WSS0201.ineffective.callback.handler=WSS0201 : XWSSCallbackHandler inefficace. Cause : {0}

WSS0201.diag.cause.1=CallbackHandler n'est pas parvenu \u00E0 obtenir un nom utilisateur lors de l'ex\u00E9cution



WSS0202.missing.security.header=WSS0202 : aucun \u00E9l\u00E9ment wsse:Security ne figure dans le message

WSS0202.diag.cause.1=Aucun \u00E9l\u00E9ment wsse:Security ne figure dans le message



WSS0203.policy.violation.exception=WSS0203 : \u00E9l\u00E9ment {0} inattendu dans l''en-t\u00EAte

WSS0203.diag.cause.1=Le bloc d'en-t\u00EAte correspondant \u00E0 l'exigence requise est introuvable

WSS0203.diag.check.1=V\u00E9rifiez que le message r\u00E9pond aux exigences de s\u00E9curit\u00E9 



WSS0204.illegal.header.block=WSS0204 : \u00E9l\u00E9ment {0} inattendu dans l''en-t\u00EAte

WSS0204.diag.cause.1=Un bloc d'en-t\u00EAte de s\u00E9curit\u00E9 interdit a \u00E9t\u00E9 d\u00E9tect\u00E9 dans l'en-t\u00EAte s\u00E9curit\u00E9

WSS0204.diag.check.1=V\u00E9rifiez que le message est conforme \u00E0 la sp\u00E9cification de s\u00E9curit\u00E9 SOAP



WSS0205.policy.violation.exception=WSS0205 : l'exigence concernant l'\u00E9l\u00E9ment wsu:Timestamp n'est pas respect\u00E9e

WSS0205.diag.cause.1=L'exigence concernant l'\u00E9l\u00E9ment wsu:Timestamp n'est pas respect\u00E9e

WSS0205.diag.check.1=V\u00E9rifiez que le message r\u00E9pond aux exigences de s\u00E9curit\u00E9



WSS0206.policy.violation.exception=WSS0206 : la s\u00E9curit\u00E9 dans le message entrant n'est pas conforme \u00E0 la strat\u00E9gie SecurityPolicy configur\u00E9e au niveau du destinataire.
WSS0206.diag.cause.1=Le message entrant ne pr\u00E9sente pas la s\u00E9curit\u00E9 requise.

WSS0206.diag.check.1=V\u00E9rifiez que la s\u00E9curit\u00E9 dans le message entrant correspond \u00E0 la strat\u00E9gie de s\u00E9curit\u00E9 configur\u00E9e au niveau du destinataire



WSS0207.unsupported.operation.exception=WSS0207 : op\u00E9ration non prise en charge lors de l'appel de l'objet

WSS0207.diag.cause.1=Op\u00E9ration non prise en charge lors de l'appel de l'objet



WSS0208.policy.violation.exception=WSS0208 : un niveau de s\u00E9curit\u00E9 plus \u00E9lev\u00E9 que celui requis a \u00E9t\u00E9 d\u00E9tect\u00E9 

WSS0208.diag.cause.1=Un niveau de s\u00E9curit\u00E9 plus \u00E9lev\u00E9 que celui requis par la strat\u00E9gie c\u00F4t\u00E9 destinataire a \u00E9t\u00E9 d\u00E9tect\u00E9 dans le message

WSS0208.diag.check.1=V\u00E9rifiez que le message r\u00E9pond strictement aux exigences de s\u00E9curit\u00E9



WSS0209.unexpected.header.block=WSS0209 : dans l''en-t\u00EAte de s\u00E9curit\u00E9, l''\u00E9l\u00E9ment {0} \u00E9tait attendu, mais l''\u00E9l\u00E9ment {1} a \u00E9t\u00E9 trouv\u00E9

WSS0209.diag.cause.1=Le filtre de message n'est pas configur\u00E9 correctement pour traiter un message entrant

WSS0209.diag.check.1=V\u00E9rifiez que les filtres sont correctement configur\u00E9s pour traiter les messages entrants



WSS0210.unsupported.key.encryption.algorithm=WSS0210 : algorithme de cryptage de cl\u00E9 non pris en charge : {0}

WSS0210.diag.cause.1=Seul l'algorithme de cryptage de cl\u00E9 RSAv1.5 est pris en charge

WSS0210.diag.check.1=V\u00E9rifiez que l'algorithme de cryptage de cl\u00E9 utilis\u00E9 dans le message entrant est RSAv1.5



WSS0211.error.decrypting.key=WSS0211 : erreur lors du d\u00E9cryptage de la cl\u00E9 de cryptage

WSS0211.diag.cause.1=Seules les cl\u00E9s TripleDES sont prises en charge



WSS0212.policy.violation.exception=WSS1404 : l'exigence de destinataire concernant le mot de passe condens\u00E9 n'est pas respect\u00E9e

WSS0212.diag.cause.1=L'exigence de destinataire concernant le mot de passe condens\u00E9 dans l'\u00E9l\u00E9ment UsernameToken n'est pas respect\u00E9e

WSS0212.diag.check.1=V\u00E9rifiez que le message r\u00E9pond aux exigences de s\u00E9curit\u00E9



WSS0213.policy.violation.exception=WSS0213 : l'exigence de destinataire concernant l'utilisation du nonce n'est pas respect\u00E9e

WSS0213.diag.cause.1=L'exigence de destinataire concernant le nonce dans l'\u00E9l\u00E9ment UsernameToken n'est pas respect\u00E9e

WSS0213.diag.check.1=V\u00E9rifiez que le message r\u00E9pond aux exigences de s\u00E9curit\u00E9



WSS0214.failed.sender.authentication=WSS0214 : \u00E9chec de l'authentification de l'\u00E9l\u00E9ment UsernameToken

WSS0214.diag.cause.1=Paire nom utilisateur/mot de passe non valide dans le jeton



WSS0215.failed.propertycallback=WSS0215 : le gestionnaire n'est pas parvenu \u00E0 traiter PropertyCallback ; une exception est survenue

WSS0215.diag.cause.1=L'appel de la m\u00E9thode handle() pour PropertyCallback dans le gestionnaire a g\u00E9n\u00E9r\u00E9 une exception

WSS0215.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire 



WSS0216.callbackhandler.handle.exception=WSS0216 : erreur lors de l''utilisation de CallbackHandler pour : {0}

WSS0216.diag.cause.1=L'appel de la m\u00E9thode handle() dans le gestionnaire a g\u00E9n\u00E9r\u00E9 une exception

WSS0216.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire 



WSS0217.callbackhandler.handle.exception.log=WSS0217 : erreur lors de l'utilisation de la m\u00E9thode handle() de CallbackHandler.

WSS0217.diag.cause.1=L'appel de la m\u00E9thode handle() dans le gestionnaire a g\u00E9n\u00E9r\u00E9 une exception

WSS0217.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire 



WSS0218.cannot.locate.default.cert=WSS0218 : impossible de localiser un certificat par d\u00E9faut \u00E0 l'aide de CallbackHandler. Si vous utilisez WSIT, assurez-vous que les assertions de fichier de cl\u00E9s/truststore appropri\u00E9es sont pr\u00E9sentes dans wsit-client.xml/wsit-*.xml.

WSS0218.diag.cause.1=Echec de la d\u00E9finition de la fonction de callback lors de l'appel de la m\u00E9thode handle() dans le gestionnaire

WSS0218.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire pour SignatureKeyCallback.DefaultPrivKeyCertRequest



WSS0219.cannot.locate.default.privkey=WSS0219 : impossible de localiser une cl\u00E9 priv\u00E9e par d\u00E9faut \u00E0 l'aide de CallbackHandler

WSS0219.diag.cause.1=Echec de la d\u00E9finition de la fonction de callback lors de l'appel de la m\u00E9thode handle() dans le gestionnaire

WSS0219.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire pour SignatureKeyCallback.DefaultPrivKeyCertRequest



WSS0220.cannot.locate.symmetrickey.for.decrypt=WSS0220 : impossible de localiser une cl\u00E9 sym\u00E9trique pour le d\u00E9cryptage \u00E0 l'aide de CallbackHandler

WSS0220.diag.cause.1=Echec de la d\u00E9finition de la fonction de callback lors de l'appel de la m\u00E9thode handle() dans le gestionnaire

WSS0220.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire pour DecryptionKeyCallback.AliasSymmetricKeyRequest



# {0} - "Signature"/"Key Encryption"/client name/alias name e.g.: Unable to locate matching certificate for xws-security-server using CallbackHandler.
WSS0221.cannot.locate.cert=WSS0221 : impossible de localiser un certificat correspondant pour {0} \u00E0 l''aide de CallbackHandler.

WSS0221.diag.cause.1=Echec de la d\u00E9finition de la fonction de callback lors de l'appel de la m\u00E9thode handle() dans le gestionnaire

WSS0221.diag.check.1=V\u00E9rifiez l'impl\u00E9mentation du gestionnaire pour SignatureKeyCallback et/ou EncryptionKeyCallback ; v\u00E9rifiez les fichiers de cl\u00E9s et les truststores



# {0} - "Signature"/"Key Encryption"/client name/alias name e.g.: Unable to locate matching certificate for xws-security-server using CallbackHandler.
WSS0222.cannot.locate.privkey=WSS0222 : impossible de localiser une cl\u00E9 priv\u00E9e correspondante pour {0} \u00E0 l''aide de CallbackHandler.

WSS0222.diag.cause.1=Echec de la d\u00E9finition de la fonction de callback lors de l'appel de la m\u00E9thode handle() dans le gestionnaire

WSS0222.diag.check.1=V\u00E9rifiez le chemin d'acc\u00E8s au fichier de cl\u00E9s et assurez-vous que les cl\u00E9s appropri\u00E9es y figurent


WSS0223.failed.certificate.validation=WSS0223 : \u00E9chec de la validation du certificat

WSS0224.unsupported.AssociatedSubject=WSS0224 : cet environnement ne comporte aucun sujet associ\u00E9

WSS0225.failed.PasswordValidationCallback=WSS0225 : une exception est survenue dans le callback de validation du mot de passe

WSS0226.failed.Validating.DefaultCreationTime=WSS0226 : erreur lors de l'analyse de l'heure de cr\u00E9ation par d\u00E9faut au format de date.

WSS0227.invalid.older.CreationTime=WSS0227 : l'heure de cr\u00E9ation est ant\u00E9rieure \u00E0 la valeur currenttime moins timestamp-freshness-limit moins max-clock-skew

WSS0228.invalid.ahead.CreationTime=WSS0227 : l'heure de cr\u00E9ation est ult\u00E9rieure \u00E0 l'heure en cours

WSS0229.failed.Validating.TimeStamp=WSS0229 : exception lors de la validation de l'horodatage

WSS0230.unsupported.Validating.SAMLIssuer=WSS0230 : la validation de l'\u00E9metteur SAML n'est pas encore prise en charge.

WSS0231.unsupported.Validating.SAMLUser=WSS0231 : la validation de l'utilisateur SAML n'est pas encore prise en charge.

WSS0232.expired.Message=WSS0232 : message expir\u00E9

WSS0233.invalid.expire.before.creation=WSS0233 : l'heure d'expiration est ant\u00E9rieure \u00E0 l'heure de cr\u00E9ation

WSS0234.failed.Validate.SAMLAssertion=WSS0234 : erreur lors de la validation de l'assertion SAML dans la strat\u00E9gie.

WSS0235.failed.locate.SAMLAssertion=WSS0235 : \u00E9chec de la localisation de l'assertion SAML

WSS0236.null.SAMLAssertion=WSS0236 : l'assertion SAML n'est pas d\u00E9finie dans la strat\u00E9gie par CallbackHandler.

WSS0237.failed.DynamicPolicyCallback=WSS0237 : erreur lors du remplissage de la strat\u00E9gie SAML dans le callback de strat\u00E9gie dynamique

WSS0238.failed.Resolve.SAMLAssertion=WSS0238 : \u00E9chec de la r\u00E9solution de l'assertion SAML

WSS0239.failed.process.SecurityTokenReference=WSS0239 : \u00E9chec du traitement de la r\u00E9f\u00E9rence du jeton de s\u00E9curit\u00E9

WSS0240.invalid.EncryptedKeySHA1.reference=WSS0240 : r\u00E9f\u00E9rence EncryptedKeySHA1 incorrecte

WSS0241.unableto.set.EKSHA1.OnContext=WSS0241 : \u00E9chec de la d\u00E9finition de la valeur EKSHA1 dans les propri\u00E9t\u00E9s de contexte

# SCT = Security Context Token.
WSS0242.unableto.locate.SCT=WSS0242 : \u00E9chec de la localisation du jeton SCT portant l'ID indiqu\u00E9

WSS0243.invalid.valueType.NonSCTToken=WSS0243 : l'\u00E9l\u00E9ment ValueType indiqu\u00E9 est incorrect pour un jeton non SCT

WSS0244.invalid.level.DKT=WSS0244 : le jeton de cl\u00E9 d\u00E9riv\u00E9e doit \u00EAtre un binding de cl\u00E9 de niveau sup\u00E9rieur

WSS0245.failed.resolve.SecurityToken=WSS0245 : exception lors de la tentative de r\u00E9solution du jeton de s\u00E9curit\u00E9

WSS0246.unableto.locate.SecureConversationSession=WSS0246 : impossible de localiser la session SecureConversation pour l'ID

WSS0247.failed.resolve.DerivedKeyToken=WSS0247 : \u00E9chec de la r\u00E9solution du jeton de cl\u00E9 d\u00E9riv\u00E9e

WSS0248.null.STR=WSS0248 : un jeton DerivedKey non valide a \u00E9t\u00E9 d\u00E9tect\u00E9, mais aucun \u00E9l\u00E9ment STR n'a \u00E9t\u00E9 trouv\u00E9

WSS0249.unsupported.TokenType.DKT=WSS1361 : l'\u00E9l\u00E9ment TokenType n'est pas pris en charge dans le jeton DerivedKey

WSS0250.failed.process.STR=WSS0250 : \u00E9chec du traitement de la r\u00E9f\u00E9rence du jeton de s\u00E9curit\u00E9

WSS0251.invalid.SecurityPolicyInstance=WSS0251 : l'instance SecurityPolicy doit \u00EAtre de type WSSPolicy OU MessagePolicy OU DynamicSecurityPolicy

WSS0252.failedto.getChildElement=WSS0252 : \u00E9chec de l'obtention de l'\u00E9l\u00E9ment enfant

WSS0253.invalid.Message=WSS0253 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e : en-t\u00EAte de s\u00E9curit\u00E9 introuvable dans le message

WSS0254.failedto.process.primaryORsecondary.policy=WSS0254 : \u00E9chec du traitement de la strat\u00E9gie principale ou secondaire

WSS0255.invalid.configuredPolicy.Timestamp=WSS0255 : l'horodatage est introuvable dans la strat\u00E9gie configur\u00E9e, mais il figure dans le message

WSS0256.failed.configure.ASC=WSS0256 : exception lors de la tentative de configuration de la s\u00E9curit\u00E9 de l'application

WSS0257.failedto.append.SecurityPolicy.MessagePolicy=WSS0257 : \u00E9chec de l'ajout de la strat\u00E9gie de s\u00E9curit\u00E9 dans la strat\u00E9gie de message

WSS0258.invalid.requirements=WSS0258 : le nombre d'exigences de destinataire indiqu\u00E9es est sup\u00E9rieur \u00E0 celui des exigences de destinataire pr\u00E9sentes dans le message

WSS0259.invalid.SEC.username=WSS0259 : plusieurs \u00E9l\u00E9ments wsse:UsernameToken figurent dans l'en-t\u00EAte de s\u00E9curit\u00E9

WSS0260.invalid.DSP=WSS0260 : strat\u00E9gie de s\u00E9curit\u00E9 dynamique non valide renvoy\u00E9e par le gestionnaire de callback

WSS0261.invalid.Message.policyset=WSS0261 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e : la strat\u00E9gie d\u00E9finie ne figure pas dans les exigences de destinataire

WSS0262.invalid.Message.policytype=WSS0262 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e : le type de strat\u00E9gie ne figure pas dans les exigences de destinataire

WSS0263.invalid.Message.policy=WSS0263 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e

WSS0264.failedto.first.primary.policy=WSS0265 : \u00E9chec de l'obtention de la premi\u00E8re strat\u00E9gie principale

WSS0265.error.primary.policy=WSS0265 : violation de la strat\u00E9gie principale

WSS0266.failedto.process.secondary.policy=WSS0266 : \u00E9chec du traitement de la strat\u00E9gie secondaire

WSS0267.invalid.configuredPolicy.Username=WSS0267 : erreur de v\u00E9rification de la strat\u00E9gie : l'\u00E9l\u00E9ment UsernameToken est introuvable dans la strat\u00E9gie configur\u00E9e mais il figure dans le message

WSS0268.error.policy.verification=WSS0268 : erreur de v\u00E9rification de la strat\u00E9gie : \u00E9l\u00E9ment de signature manquant

WSS0269.error.Encryptionpolicy.verification=WSS0269 : erreur de v\u00E9rification de la strat\u00E9gie de cryptage : \u00E9l\u00E9ment de cryptage manquant

WSS0270.failedto.get.SecurityPolicy.MessagePolicy=WSS0270 : \u00E9chec de l'obtention de la strat\u00E9gie de s\u00E9curit\u00E9 \u00E0 partir de la strat\u00E9gie de message

WSS0271.failedto.resolve.policy=WSS0271 : la strat\u00E9gie doit se r\u00E9soudre en un \u00E9l\u00E9ment MessagePolicy

WSS0272.failedto.derefer.targets=WSS0272 : \u00E9chec du d\u00E9r\u00E9f\u00E9rencement des cibles

WSS0273.failedto.process.policy=WSS0273 : \u00E9chec du traitement de la strat\u00E9gie de message

WSS0274.invalid.SEC.Timestamp=WSS0274 : plusieurs \u00E9l\u00E9ments wsu:Timestamp figurent dans l'en-t\u00EAte de s\u00E9curit\u00E9

WSS0275.invalid.policy.NoUsername.SecHeader=WSS0275 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e : l'\u00E9l\u00E9ment UsernameToken est introuvable dans l'en-t\u00EAte de s\u00E9curit\u00E9

WSS0276.invalid.policy.NoTimestamp.SecHeader=WSS0276 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e : l'\u00E9l\u00E9ment Timestamp est introuvable dans l'en-t\u00EAte de s\u00E9curit\u00E9

WSS0277.invalid.AddtionalSEC.Message.policy=WSS0277 : le message n'est pas conforme \u00E0 la strat\u00E9gie configur\u00E9e ; un niveau de s\u00E9curit\u00E9 plus \u00E9lev\u00E9 que celui requis a \u00E9t\u00E9 d\u00E9tect\u00E9

WSS0278.failedto.get.localName=WSS0278 : exception lors de l'obtention du nom localName de l'\u00E9l\u00E9ment SOAPElement

WSS0279.failed.check.secSecurity=WSS0279 : \u00E9chec de la recherche des strat\u00E9gies secondaires suppl\u00E9mentaires

WSS0280.failed.create.UsernameToken=WSS0280 : exception lors de la tentative de cr\u00E9ation d'un jeton de nom utilisateur

WSS0281.unsupported.operation=WSS0281 : op\u00E9ration d'obtention de la valeur du jeton de nom utilisateur non prise en charge

WSS0282.unsupported.KeyIdentifier.Reference.DKT=WSS0282 : l'\u00E9l\u00E9ment KeyIdentifierReference n'est pas pris en charge dans DerivedKey

WSS0283.unsupported.ReferenceType.DKT=WSS0283 : l'\u00E9l\u00E9ment ReferenceType n'est pas en charge dans DerivedKey

WSS0284.WSS.SOAP.Fault.Exception=WSS0284 : une exception d'erreur SOAP est survenue


WSS0285.error.NoElement=WSS0285 : il n'existe aucun \u00E9l\u00E9ment portant l'ID/le WsuId

WSS0286.invalid.NoofElements=WSS0286 : il existe plusieurs \u00E9l\u00E9ments portant l'ID/le WsuId

WSS0287.error.extracting.attachmentpart=WSS0287 : exception lors de la tentative d'extraction de l'\u00E9l\u00E9ment de pi\u00E8ce jointe

WSS0288.failed.getMessageParts.Qname=WSS0288 : \u00E9chec de l'obtention des parties du message \u00E0 l'aide de l'\u00E9l\u00E9ment targettype du QName

WSS0289.failed.getMessageParts.XPath=WSS0289 : \u00E9chec de l'obtention des parties du message \u00E0 l'aide de l'\u00E9l\u00E9ment targettype de l'expression XPath

WSS0290.failed.getMessageParts.URI=WSS0290 : \u00E9chec de l'obtention des parties du message \u00E0 l'aide de l'\u00E9l\u00E9ment targettype de l'URI

WSS0291.unsupported.operation.getAttachment=WSS0291 : op\u00E9ration d'obtention de pi\u00E8ce jointe non prise en charge

WSS0292.unsupported.operation.removeAttachment=WSS0292 : op\u00E9ration de suppression de pi\u00E8ce jointe non prise en charge

WSS0293.failed.RSAKeyValue=WSS0293 : exception lors de la tentative d'obtention de la valeur de la cl\u00E9 RSA

WSS0294.failed.X509Data=WSS0294 : exception lors de la tentative d'ajout du certificat X509 dans les donn\u00E9es X509

WSS0295.password.val.not.config.username.val=WSS0295 : erreur : aucun \u00E9l\u00E9ment PasswordValidator n'est configur\u00E9 pour la validation de l'\u00E9l\u00E9ment UsernameToken.

WSS0296.null.chain.cert=WSS0296 : erreur : une cha\u00EEne de certificat vide a \u00E9t\u00E9 renvoy\u00E9e par PrivateKeyCallback.

WSS0298.X509.expired=WSS0298 : le certificat X509Certificate expir\u00E9.

WSS0299.X509.notValid=WSS0299 : \u00E9chec de la validation du certificat X509Certificate.


#WSS Messages from 300 to 399

WSS0300.no.jce.provider=WSS0300 : impossible de localiser un fournisseur JCE pour {0}

WSS0301.unableto.decode.data=WSS0301 : impossible de d\u00E9coder les donn\u00E9es \u00E0 partir du jeton

WSS0301.diag.cause.1=Donn\u00E9es incorrectes. Erreur de d\u00E9codage base 64

WSS0301.diag.check.1=V\u00E9rifiez que les donn\u00E9es sont encod\u00E9es en base64



WSS0302.unableto.create.x509cert=WSS0302 : impossible de cr\u00E9er le certificat X509Certificate \u00E0 partir des donn\u00E9es du jeton

WSS0302.diag.cause.1=Probl\u00E8me d'analyse du certificat

WSS0302.diag.check.1=Le flux de donn\u00E9es utilis\u00E9 pour cr\u00E9er le certificat x509 est peut-\u00EAtre endommag\u00E9



WSS0303.unableto.get.encoded.x509cert=WSS0303 : impossible d'obtenir la repr\u00E9sentation encod\u00E9e du certificat X509Certificate

WSS0303.diag.cause.1=Exception d'encodage du certificat

WSS0303.diag.check.1=V\u00E9rifiez que les donn\u00E9es x509 sont valides. Impossible d'en extraire des octets de donn\u00E9es brutes.



WSS0304.message.doesnot.contain.header=WSS0304 : le message ne contient pas d'en-t\u00EAte



WSS0305.message.doesnot.contain.secheaderblock=WSS0305 : le message ne contient pas de bloc d'en-t\u00EAte wsse:Security



WSS0306.invalid.passwd.type=WSS0306 : type de mot de passe non valide. Il doit \u00EAtre de type {0} ou {1}

WSS0306.diag.cause.1=Type de mot de passe non valide

WSS0306.diag.check.1=Le type de mot de passe doit \u00EAtre conforme \u00E0 la sp\u00E9cification WSS



WSS0307.nonce.enctype.invalid=WSS0307 : type d'encodage du nonce non valide

WSS0307.diag.cause.1=Echec de la v\u00E9rification de l'espace de noms de l'encodage du nonce

WSS0307.diag.check.1=L'espace de noms du type d'encodage du nonce semble incorrect



WSS0308.couldnot.decode.hex.nonce=WSS0308 : exception [ {0} ] lors du d\u00E9codage du nonce hexad\u00E9cimal



WSS0309.couldnot.decode.base64.nonce=WSS0309 : exception [ {0} ] lors du d\u00E9codage du nonce base64



WSS0310.no.such.algorithm=WSS0310 : {0}, aucun algorithme de ce type n''a \u00E9t\u00E9 trouv\u00E9

WSS0310.diag.cause.1=Exception NoSuchAlgorithmException : algorithme incorrect

WSS0310.diag.check.1=V\u00E9rifiez que l'algorithme transmis \u00E0 SecureRandom est valide



WSS0311.passwd.digest.couldnot.be.created=WSS0311 : exception [ {0} ] lors de la cr\u00E9ation du condens\u00E9 de mot de passe.

WSS0311.diag.cause.1=Impossible de cr\u00E9er le condens\u00E9 de mot de passe 

WSS0311.diag.check.1=V\u00E9rifiez que l'algorithme transmis \u00E0 MessageDigest est valide

 

WSS0312.exception.in.certpath.validate=WSS0312 : exception [ {0} ] lors de la validation de l''\u00E9l\u00E9ment certPath



WSS0313.cert.is.null=WSS0313 : le certificat est NULL



WSS0314.cert.not.trusted.remote.cert=WSS0314 : le certificat n'est pas un certificat distant s\u00E9curis\u00E9



WSS0315.not.a.cert.entry=WSS0315 : l''entr\u00E9e de fichier de cl\u00E9s portant l''alias {0} ne correspond pas \u00E0 une entr\u00E9e de certificat



WSS0316.enctype.invalid=WSS0316 : type d'encodage non valide

WSS0316.diag.cause.1=Le type d'encodage du jeton BinarySecurity n'est pas valide

WSS0316.diag.check.1=V\u00E9rifiez que la valeur d'encodage de l'\u00E9l\u00E9ment BinarySecurityToken est valide conform\u00E9ment \u00E0 la sp\u00E9cification.



# {0} - most likely an exception message
WSS0317.cannot.find.x509cert.because=WSS0317 : le certificat X509Certificate est introuvable. Cause : {0}

WSS0317.diag.cause.1=Le certificat X.509 est introuvable

WSS0317.diag.check.1=Assurez-vous que le chemin d'acc\u00E8s au certificat n'est pas vide et que le type de certificat est correct



WSS0318.exception.while.creating.keyinfoblock=WSS0318 : exception lors de la construction du bloc d'en-t\u00EAte KeyInfo

WSS0318.diag.cause.1=Erreur lors de l'analyse et de la cr\u00E9ation de l'instance KeyInfo

WSS0318.diag.check.1=V\u00E9rifiez les valeurs transmises au constructeur KeyInfo



WSS0319.exception.adding.keyname=WSS0319 : exception lors de l'ajout du nom de cl\u00E9 dans le bloc d'en-t\u00EAte KeyInfo

WSS0319.diag.cause.1=Impossible d'ajouter le nom de cl\u00E9 dans le bloc d'en-t\u00EAte KeyInfo

WSS0319.diag.check.1=V\u00E9rifiez que KeyInfo et KeyName ont \u00E9t\u00E9 instanci\u00E9s sans exception



WSS0320.exception.getting.keyname=WSS0320 : exception lors de l'obtention du nom de cl\u00E9 \u00E0 partir du bloc d'en-t\u00EAte KeyInfo

WSS0320.diag.cause.1=Impossible d'obtenir l'\u00E9l\u00E9ment KeyName \u00E0 partir de KeyInfo

WSS0320.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment KeyName existe dans KeyInfo 



WSS0321.exception.converting.keyinfo.tosoapelem=WSS0321 : exception lors de la conversion du bloc d'en-t\u00EAte KeyInfo en un \u00E9l\u00E9ment SOAPElement

WSS0321.diag.cause.1=Impossible d'extraire l'\u00E9l\u00E9ment \u00E0 partir de KeyInfo ou impossible d'importer le noeud

WSS0321.diag.check.1=V\u00E9rifiez l'\u00E9l\u00E9ment \u00E0 convertir en \u00E9l\u00E9ment SOAPElement



WSS0322.exception.creating.signatureblock=WSS0322 : exception lors de la cr\u00E9ation du bloc d'en-t\u00EAte de signature

WSS0322.diag.cause.1=Exception lors de l'analyse et de la cr\u00E9ation de l'\u00E9l\u00E9ment Signature

WSS0322.diag.check.1=V\u00E9rifiez qu'une signature XML compl\u00E8tement initialis\u00E9e a \u00E9t\u00E9 transmise



WSS0323.exception.while.signing=WSS0323 : exception lors de la signature

WSS0323.diag.cause.1=Exception lors de la tentative de signature

WSS0323.diag.check.1=V\u00E9rifiez la cl\u00E9 utilis\u00E9e pour signer



WSS0324.exception.in.getting.signaturevalue=WSS0324 : exception lors de l'obtention de la valeur SignatureValue

WSS0324.diag.cause.1=Impossible d'extraire les octets de la valeur de signature

WSS0324.diag.check.1=Examinez la cause de l'\u00E9chec de l'op\u00E9ration getSignatureValue \u00E0 partir de l'impl\u00E9mentation XML DSig sous-jacente



WSS0325.exception.adding.reference.to.signedinfo=WSS0325 : exception lors de l'ajout d'une r\u00E9f\u00E9rence dans SignedInfo

WSS0325.diag.cause.1=Exception lors de l'ajout d'une r\u00E9f\u00E9rence comportant un URI, des transformations et un URI d'algorithme Digest dans SignedInfo

WSS0325.diag.check.1=V\u00E9rifiez que les valeurs transmises au constructeur de l'\u00E9l\u00E9ment XMLSignature.addDocument, lui-m\u00EAme transmis \u00E0 l'impl\u00E9mentation XML DSig, sont correctes



WSS0326.exception.verifying.signature=WSS0326 : exception lors de la v\u00E9rification de la signature

WSS0326.diag.cause.1=Impossible de valider la signature bas\u00E9e sur la cl\u00E9 publique du certificat transmis

WSS0326.diag.check.1=V\u00E9rifiez que le message a \u00E9t\u00E9 sign\u00E9 avec la cl\u00E9 priv\u00E9e correspondante et qu'il n'a pas \u00E9t\u00E9 endommag\u00E9



WSS0327.exception.converting.signature.tosoapelement=WSS0327 : exception lors de la conversion du bloc de signature en \u00E9l\u00E9ment SOAPElement

WSS0327.diag.cause.1=Impossible d'extraire l'\u00E9l\u00E9ment \u00E0 partir de la signature ou impossible d'importer le noeud

WSS0327.diag.check.1=V\u00E9rifiez l'\u00E9l\u00E9ment \u00E0 convertir en \u00E9l\u00E9ment SOAPElement



WSS0328.error.parsing.creationtime=WSS0328 : erreur lors de l'analyse de l'heure de cr\u00E9ation

WSS0328.diag.cause.1=Erreur lors de l'analyse de la date. 

WSS0328.diag.check.1=V\u00E9rifiez que la date est au format UTC et qu'elle est sp\u00E9cifi\u00E9e sous la forme "yyyy-MM-dd'T'HH:mm:ss'Z'" ou "yyyy-MM-dd'T'HH:mm:ss'.'sss'Z'" 



WSS0329.usernametoken.expected=WSS0329 : l''\u00E9l\u00E9ment UsernameToken \u00E9tait attendu, mais [ {0} ] a \u00E9t\u00E9 trouv\u00E9

WSS0329.diag.cause.1=L'\u00E9l\u00E9ment UsernameToken \u00E9tait attendu

WSS0329.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment suivant est UsernameToken



WSS0330.usernametoken.firstchild.mustbe.username=WSS0330 : le premier enfant d'un \u00E9l\u00E9ment UsernameToken doit \u00EAtre un nom utilisateur

WSS0330.diag.cause.1=Le nom utilisateur n'est pas le premier enfant de l'\u00E9l\u00E9ment UsernameToken

WSS0330.diag.check.1=Assurez-vous que le premier enfant de l'\u00E9l\u00E9ment wsse:UsernameToken est un nom utilisateur sous la forme d'un espace de noms wsse



WSS0331.invalid.usernametoken=WSS0331 : l'\u00E9l\u00E9ment transmis n'\u00E9tait pas un \u00E9l\u00E9ment SOAPElement ou l'\u00E9l\u00E9ment UsernameToken est incorrect

WSS0331.diag.cause.1=L'\u00E9l\u00E9ment n'est peut-\u00EAtre pas un \u00E9l\u00E9ment UsernameToken correct

WSS0331.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment UsernameToken correspond au sch\u00E9ma de jeton



WSS0332.usernametoken.null.username=WSS0332 : le jeton de nom utilisateur ne contient pas le nom utilisateur

WSS0332.diag.cause.1=Le nom utilisateur \u00E9tait NULL

WSS0332.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment UsernameToken contient un nom utilisateur valide



WSS0333.javax.net.ssl.keyStore.notset=WSS0333 : la propri\u00E9t\u00E9 javax.net.ssl.keyStore, obligatoire pour l'initialisation de l'environnement de s\u00E9curit\u00E9, n'est pas d\u00E9finie

WSS0333.diag.cause.1=L'URL de fichier de cl\u00E9s est NULL

WSS0333.diag.check.1=V\u00E9rifiez que la propri\u00E9t\u00E9 javax.net.ssl.keyStore est correctement d\u00E9finie



WSS0334.unsupported.keyidentifier=WSS0334 : type de r\u00E9f\u00E9rence KeyIdentifier non pris en charge d\u00E9tect\u00E9 

WSS0334.diag.cause.1=L'identificateur KeyIdentifier contient un \u00E9l\u00E9ment ValueType non valide

WSS0334.diag.check.1=V\u00E9rifiez la valeur de l'\u00E9l\u00E9ment ValueType de l'identificateur KeyIdentifier



WSS0335.unsupported.referencetype=WSS0335 : type de r\u00E9f\u00E9rence non pris en charge d\u00E9tect\u00E9 

WSS0335.diag.cause.1=Type de r\u00E9f\u00E9rence KeyReference non pris en charge

WSS0335.diag.check.1=Le type de r\u00E9f\u00E9rence KeyReference doit \u00EAtre KeyIdentifier, Reference ou X509Data



WSS0336.cannot.locate.publickey.for.signature.verification=WSS0336 : impossible de localiser la cl\u00E9 publique pour la v\u00E9rification de la signature 

WSS0336.diag.cause.1=Impossible de localiser la cl\u00E9 publique

WSS0336.diag.check.1=V\u00E9rifiez que la cl\u00E9 publique extraite n'est pas NULL



WSS0337.unsupported.directref.mechanism=WSS0337 : m\u00E9canisme DirectReference {0} non pris en charge

WSS0337.diag.cause.1=Impossible de r\u00E9soudre l'URI

WSS0337.diag.check.1=V\u00E9rifiez l'\u00E9l\u00E9ment ValueType du m\u00E9canisme DirectReference, car il n'est pas pris en charge



WSS0338.unsupported.reference.mechanism=WSS0338 : m\u00E9canisme de r\u00E9f\u00E9rence non pris en charge

WSS0338.diag.cause.1=M\u00E9canisme de r\u00E9f\u00E9rence de cl\u00E9 non pris en charge

WSS0338.diag.check.1=V\u00E9rifiez que la r\u00E9f\u00E9rence est de type X509IssuerSerial, DirectReference ou KeyIdentifier 



WSS0339.unsupported.keyinfo=WSS0339 : bloc d'informations de cl\u00E9 non pris en charge d\u00E9tect\u00E9

WSS0339.diag.cause.1=L'aide pour le traitement des informations sp\u00E9cifi\u00E9es dans l'\u00E9l\u00E9ment ds:KeyInfo indiqu\u00E9 n'est pas pr\u00E9sente

WSS0339.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment ds:KeyInfo correspond au sch\u00E9ma



WSS0340.created.ahead.of.current=WSS0340 : l'heure de cr\u00E9ation est ult\u00E9rieure \u00E0 l'heure en cours.

WSS0340.diag.cause.1= L'heure de cr\u00E9ation ne peut pas \u00EAtre ult\u00E9rieure \u00E0 l'heure UTC en cours

WSS0340.diag.check.1=V\u00E9rifiez que l'heure syst\u00E8me est correcte



WSS0341.created.older.than.timestamp.freshness=WSS0341 : l'heure de cr\u00E9ation est ant\u00E9rieure \u00E0 la valeur currenttime moins timestamp-freshness-limit moins max-clock-skew

WSS0341.diag.cause.1= L'heure de cr\u00E9ation est tr\u00E8s ancienne

WSS0341.diag.check.1=V\u00E9rifiez que l'heure syst\u00E8me est correcte



WSS0342.valtype.invalid=WSS0342 : \u00E9l\u00E9ment ValueType non valide

WSS0342.diag.cause.1=Le type de valeur du jeton BinarySecurity n'est pas valide

WSS0342.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment valueType du jeton BinarySecurity est valide conform\u00E9ment \u00E0 la sp\u00E9cification.



WSS0343.error.creating.bst=WSS0343 : erreur lors de la cr\u00E9ation du jeton BinarySecurityToken

# BST = Binary Security Token. {0} - most likely an exception message
WSS0343.diag.cause.1=Erreur lors de la cr\u00E9ation du jeton BST. Cause : {0} 

WSS0343.diag.check.1=V\u00E9rifiez que toutes les valeurs requises sont d\u00E9finies pour le jeton de s\u00E9curit\u00E9 binaire, y compris la valeur TextNode. 



# wss messages

WSS0344.error.decoding.bst=WSS0344 : le jeton BinarySecurityToken n'est pas encod\u00E9 en base64

WSS0344.diag.cause.1=Impossible de d\u00E9coder les donn\u00E9es binaires du jeton de s\u00E9curit\u00E9 ; l'encodage base64 \u00E9tait attendu

WSS0344.diag.check.1=V\u00E9rifiez que le format d'encodage du jeton de s\u00E9curit\u00E9 binaire est Base64Binary



WSS0345.error.creating.edhb=WSS0345 : erreur lors de la cr\u00E9ation du bloc d''en-t\u00EAte EncryptedData. Cause : {0}

WSS0345.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment SOAPElement pour EncryptedDataHeaderBlock

WSS0345.diag.check.1=Si l'\u00E9l\u00E9ment SOAPElement est utilis\u00E9 pour la cr\u00E9ation du bloc EncryptedDataHeaderBlock, v\u00E9rifiez qu'il est valide conform\u00E9ment \u00E0 la sp\u00E9cification. 



# {0} - element name
WSS0346.error.creating.edhb=WSS0346 : l''\u00E9l\u00E9ment SOAPElement xenc:EncryptedData \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9

WSS0346.diag.cause.1=L'\u00E9l\u00E9ment SOAPElement transmis au constructeur EncryptedDataHeaderBlock n'est pas valide

WSS0346.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment SOAPElement transmis \u00E0 EncryptedDataHeaderBlock est valide conform\u00E9ment \u00E0 la sp\u00E9cification.



WSS0347.missing.cipher.data=WSS0347 : l'\u00E9l\u00E9ment CipherData est introuvable dans EncryptedType

WSS0347.diag.cause.1=L'\u00E9l\u00E9ment SOAPElement utilis\u00E9 pour initialiser EncryptedType ne comporte peut-\u00EAtre pas l'\u00E9l\u00E9ment CipherData

WSS0347.diag.cause.2=L'\u00E9l\u00E9ment CipherData n'est peut-\u00EAtre pas d\u00E9fini dans EncryptedType

WSS0347.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment SOAPElement utilis\u00E9 pour initialiser EncryptedType dispose d'un \u00E9l\u00E9ment CipherData

WSS0347.diag.check.2=V\u00E9rifiez que la m\u00E9thode setCipherData() est appel\u00E9e pour EncryptedType



# {0} - exception message
WSS0348.error.creating.ekhb=WSS0348 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment EncryptedKeyHeaderBlock. Cause : {0}

WSS0348.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment SOAPElement pour EncryptedKeyHeaderBlock

WSS0348.diag.check.1=Si l'\u00E9l\u00E9ment SOAPElement est utilis\u00E9 pour la cr\u00E9ation du bloc EncryptedKeyHeaderBlock, v\u00E9rifiez qu'il est valide conform\u00E9ment \u00E0 la sp\u00E9cification. 


# {0} - element name
WSS0349.error.creating.ekhb=WSS0349 : l''\u00E9l\u00E9ment SOAPElement xenc:EncryptedKey \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9

WSS0349.diag.cause.1=L'\u00E9l\u00E9ment SOAPElement transmis \u00E0 la m\u00E9thode EncryptedKeyHeaderBlock() n'est pas valide

WSS0349.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment SOAPElement transmis \u00E0 la m\u00E9thode EncryptedKeyHeaderBlock() est valide conform\u00E9ment \u00E0 la sp\u00E9cification.



# {0} - exception message
WSS0350.error.setting.ciphervalue=WSS0350 : erreur lors de la d\u00E9finition de l''\u00E9l\u00E9ment CipherValue dans EncryptedKey. Cause : {0}

WSS0350.diag.cause.1=Erreur lors de la cr\u00E9ation/mise \u00E0 jour de l'\u00E9l\u00E9ment SOAPElement pour CipherData (dans EncryptedKeyHeaderBlock)

WSS0350.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



# {0} - exception message
WSS0351.error.setting.encryption.method=WSS0351 : erreur lors de la d\u00E9finition de la m\u00E9thode de cryptage pour EncryptedType. Cause : {0}

WSS0351.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment SOAPElement pour EncryptionMethod

WSS0351.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



# {0} - exception message
WSS0352.error.getting.cipherValues=WSS0352 : erreur lors de l''obtention des valeurs CipherValue dans CipherData. Cause : {0}

WSS0352.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour CipherValue

WSS0352.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0353.missing.cipherValue=WSS0353 : l'\u00E9l\u00E9ment CipherValue est introuvable dans CipherData

WSS0353.diag.cause.1=Aucun \u00E9l\u00E9ment CipherValue ne figure dans CipherData

WSS0353.diag.check.1=V\u00E9rifiez que la m\u00E9thode setCipherValue() est appel\u00E9e pour EncryptedType



WSS0354.error.initializing.encryptedType=WSS0354 : erreur lors de l''initialisation de l''\u00E9l\u00E9ment EncryptedType. Cause : {0}

WSS0354.diag.cause.1=Une erreur a pu survenir lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour EncryptionMethod

WSS0354.diag.cause.2=Une erreur a pu survenir lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour KeyInfo 

WSS0354.diag.cause.3=Une erreur a pu survenir lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour CipherData 

WSS0354.diag.cause.4=Une erreur a pu survenir lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour EncryptionProperties

WSS0354.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ 



# {0} - "DSA"/"RSA"/"" (no typo here, do not add space after this placeholder), {1} - exception message
WSS0355.error.creating.keyvalue=WSS0355 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment {0}KeyValue. Cause : {1}

WSS0355.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment com.sun.org.apache.xml.internal.security.keys.content.keyvalues.DSAKeyValue

WSS0355.diag.cause.2=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment com.sun.org.apache.xml.internal.security.keys.content.keyvalues.RSAKeyValue

WSS0355.diag.cause.3=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment com.sun.org.apache.xml.internal.security.keys.content.KeyValue

WSS0355.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement non NULL est transmis \u00E0 addXXXKeyValue()



WSS0356.error.creating.x509data=WSS0356 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment X509Data. Cause : {0}

WSS0356.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment com.sun.org.apache.xml.internal.security.keys.content.X509Data

WSS0356.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement non NULL est transmis \u00E0 addX509Data()



WSS0357.error.getting.keyvalue=WSS0357 : impossible d''obtenir l''\u00E9l\u00E9ment KeyValue pour l''index [{0}]. Cause : {1}

WSS0357.diag.cause.1=Erreur lors de l'obtention de l'\u00E9l\u00E9ment KeyValue \u00E0 partir de KeyInfo pour l'index indiqu\u00E9

WSS0357.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment ds:KeyInfo comprend des \u00E9l\u00E9ments ds:KeyValue

WSS0357.diag.check.2=V\u00E9rifiez que l'index (commen\u00E7ant par 0) utilis\u00E9 pour r\u00E9f\u00E9rencer l'\u00E9l\u00E9ment ds:KeyValue est valide



WSS0358.error.getting.x509data=WSS0358 : impossible d''obtenir l''\u00E9l\u00E9ment X509Data pour l''index [{0}]. Cause : {1}

WSS0358.diag.cause.1=Erreur lors de l'obtention de l'\u00E9l\u00E9ment X509Data \u00E0 partir de KeyInfo pour l'index indiqu\u00E9

WSS0358.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment ds:KeyInfo comprend des \u00E9l\u00E9ments ds:X509Data

WSS0358.diag.check.2=V\u00E9rifiez que l'index (commen\u00E7ant par 0) utilis\u00E9 pour r\u00E9f\u00E9rencer l'\u00E9l\u00E9ment ds:X509Data est valide



WSS0359.error.adding.x509data=WSS0356 : erreur lors de l''ajout de l''\u00E9l\u00E9ment X509Data. Cause : {0}

WSS0359.diag.cause.1=Erreur lors de l'ajout de l'\u00E9l\u00E9ment com.sun.org.apache.xml.internal.security.keys.content.X509Data dans KeyInfo

WSS0359.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment com.sun.org.apache.xml.internal.security.keys.content.X509Data valide (conform\u00E9ment \u00E0 la sp\u00E9cification) est transmis \u00E0 addX509Data()



WSS0360.error.creating.rlhb=WSS0360 : impossible de cr\u00E9er l''\u00E9l\u00E9ment ReferenceListHeaderBlock. Cause : {0}

WSS0360.diag.cause.1=Une erreur a pu survenir lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour ReferenceList

WSS0360.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0361.error.creating.rlhb=WSS0348 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment ReferenceListHeaderBlock. Cause : {0}

WSS0361.diag.cause.1=Une erreur a pu survenir lors de la cr\u00E9ation de l'\u00E9l\u00E9ment org.w3c.dom.Element pour ReferenceList

WSS0361.diag.cause.2=L'objet org.w3c.dom.Document transmis \u00E0 ReferenceListHeaderBlock() est peut-\u00EAtre NULL

WSS0361.diag.check.1=V\u00E9rifiez que l'espace de noms indiqu\u00E9 ne contient pas de caract\u00E8res interdits, conform\u00E9ment \u00E0 la sp\u00E9cification XML 1.0 

WSS0361.diag.check.2=V\u00E9rifiez que le QName indiqu\u00E9 est correct (pour plus d'informations, reportez-vous \u00E0 la documentation J2SE)

WSS0361.diag.check.3=V\u00E9rifiez qu'un document non NULL est transmis \u00E0 ReferenceListHeaderBlock()



WSS0362.error.creating.rlhb=WSS0346 : l''\u00E9l\u00E9ment SOAPElement xenc:ReferenceList \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9

WSS0362.diag.cause.1=L'\u00E9l\u00E9ment SOAPElement transmis \u00E0 la m\u00E9thode ReferenceListHeaderBlock() n'est pas valide

WSS0362.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment SOAPElement transmis \u00E0 la m\u00E9thode ReferenceListHeaderBlock() est valide conform\u00E9ment \u00E0 la sp\u00E9cification.



WSS0363.error.adding.datareference=WSS0363 : impossible d''ajouter l''\u00E9l\u00E9ment xenc:DataReference \u00E0 xenc:ReferenceList. Cause : {0}

WSS0363.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour xenc:DataReference

WSS0363.diag.cause.2=Erreur lors de l'ajout de xenc:DataReference (SOAPElement) comme \u00E9l\u00E9ment enfant de xenc:DataReference (SOAPElement)

WSS0363.diag.cause.3=Erreur lors de la d\u00E9finition de l'attribut d'URI sur javax.xml.soap.SOAPElement pour xenc:DataReference

WSS0363.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0364.error.apache.xpathAPI=WSS0364 : les \u00E9l\u00E9ments xenc:EncryptedData sont introuvables. Cause : {0}

WSS0364.diag.cause.1=Une erreur de transformation XPathAPI interne est survenue 



WSS0365.error.creating.namespaceNode=WSS0365 : erreur lors de la cr\u00E9ation du noeud d''espace de noms. Cause : {0}

WSS0365.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour le noeud d'espace de noms

WSS0365.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0366.multiple.encrypteddata.found=WSS0366 : plusieurs \u00E9l\u00E9ments xenc:EncryptedData ont \u00E9t\u00E9 d\u00E9tect\u00E9s

WSS0366.diag.cause.1=Plusieurs \u00E9l\u00E9ments xenc:EncryptedData pr\u00E9sentent la m\u00EAme valeur d'attribut d'ID


WSS0367.no.encrypteddata.found=WSS0367 : l'\u00E9l\u00E9ment xenc:EncryptedData est introuvable

WSS0367.diag.cause.1=Aucun \u00E9l\u00E9ment xenc:EncryptedData valide n'a \u00E9t\u00E9 r\u00E9f\u00E9renc\u00E9 \u00E0 partir de xenc:ReferenceList



# {0} - most likely an exception message
WSS0368.soap.exception=WSS0368 : erreur lors de l''obtention de l''\u00E9l\u00E9ment SOAPEnvelope \u00E0 partir de SOAPPart. Cause : {0}

WSS0368.diag.cause.1=Erreur lors de l''obtention de l'\u00E9l\u00E9ment SOAPEnvelope \u00E0 partir de SOAPPart

WSS0368.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ


WSS0369.soap.exception=WSS0369 : erreur lors de l''obtention de l''\u00E9l\u00E9ment SOAPHeader \u00E0 partir de SOAPEnvelope. Cause : {0}

WSS0369.diag.cause.1=Erreur lors de l'obtention de l'\u00E9l\u00E9ment SOAPHeader \u00E0 partir de SOAPEnvelope

WSS0369.diag.cause.2=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment SOAPHeader 

WSS0369.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0370.error.deleting.secheader=WSS0370 : erreur lors de la suppression de l'\u00E9l\u00E9ment SecurityHeader en raison d'une exception.

WSS0370.error.processing.secheader=WSS0370 : erreur lors du traitement de l'\u00E9l\u00E9ment SecurityHeader


WSS0371.error.generate.fault=WSS0371 : erreur lors de la g\u00E9n\u00E9ration du message d''erreur. Cause : {0}

WSS0371.diag.cause.1=Erreur lors de l'obtention de l'\u00E9l\u00E9ment SOAPBody \u00E0 partir de SOAPMessage

WSS0371.diag.cause.2=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour la d\u00E9finition de l'erreur dans SOAPBody

WSS0371.diag.cause.3=Erreur lors de l'ajout d'une erreur dans SOAPBody

WSS0371.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0372.error.apache.xpathAPI=WSS0372 : les \u00E9l\u00E9ments comportant un attribut d''ID sont introuvables. Cause : {0}

WSS0372.diag.cause.1=Une erreur de transformation XPathAPI interne est survenue 



WSS0373.error.apache.xpathAPI=WSS0373 : les \u00E9l\u00E9ments comportant un attribut wsu:Id sont introuvables. Cause : {0}

WSS0373.diag.cause.1=Une erreur de transformation XPathAPI interne est survenue 



WSS0374.error.apache.xpathAPI=WSS0374 : les \u00E9l\u00E9ments comportant la valeur d''attribut wsu:Id {0} sont introuvables. Cause : {1}

WSS0374.diag.cause.1=Une erreur de transformation XPathAPI interne est survenue



WSS0375.error.apache.xpathAPI=WSS0375 : les \u00E9l\u00E9ments comportant la valeur d''attribut d''ID {0} sont introuvables. Cause : {1}

WSS0375.diag.cause.1=Une erreur de transformation XPathAPI interne est survenue

WSS0376.error.inserting.header=WSS0376 : impossible d''ins\u00E9rer un bloc d''en-t\u00EAte. Cause : {0}

WSS0376.diag.cause.1=Erreur lors de l'import de l'\u00E9l\u00E9ment SOAPElement repr\u00E9sentant le bloc d'en-t\u00EAte du document correspondant \u00E0 l'\u00E9l\u00E9ment SOAPMessage auquel a \u00E9t\u00E9 ajout\u00E9 l'en-t\u00EAte

WSS0376.diag.check.1=V\u00E9rifiez que le bloc SecurityHeaderBlock peut \u00EAtre converti en un \u00E9l\u00E9ment SOAPElement valide

WSS0376.diag.check.2=Pour plus d'informations, reportez-vous \u00E0 la documentation J2SE



WSS0377.error.creating.str=WSS0377 : impossible de cr\u00E9er l''\u00E9l\u00E9ment SecurityTokenReference. Cause : {0}

WSS0377.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour SecurityTokenReference 

WSS0377.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0378.error.creating.str=WSS0378 : impossible de cr\u00E9er l''\u00E9l\u00E9ment SecurityTokenReference. Cause : {0}

WSS0378.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour SecurityTokenReference 

WSS0378.diag.check.1=V\u00E9rifiez que l'objet org.w3c.dom.Document transmis \u00E0 SecurityTokenReference() n'est pas NULL

WSS0378.diag.check.2=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0379.error.creating.str=WSS0379 : l''\u00E9l\u00E9ment SOAPElement wsse:SecurityTokenReference \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9 

WSS0379.diag.cause.1=L'\u00E9l\u00E9ment SOAPElement transmis \u00E0 SecurityTokenReference() n'est pas un \u00E9l\u00E9ment SecurityTokenReference valide, conform\u00E9ment \u00E0 la sp\u00E9cification. 

WSS0379.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement valide (conform\u00E9ment \u00E0 la sp\u00E9cification) est transmis \u00E0 SecurityTokenReference()



WSS0380.error.setting.reference=WSS0380 : impossible de d\u00E9finir l'\u00E9l\u00E9ment ds:Reference dans SecurityTokenReference

WSS0380.diag.cause.1=L'\u00E9l\u00E9ment ds:Reference a d\u00E9j\u00E0 \u00E9t\u00E9 d\u00E9finie \u00E0 l'aide des constructeurs

WSS0380.diag.check.1=V\u00E9rifiez qu'aucun \u00E9l\u00E9ment SOAPElement comportant un \u00E9l\u00E9ment ds:Reference (\u00E9l\u00E9ment enfant) n'est utilis\u00E9 pour instancier SecurityTokenReference



WSS0381.error.setting.reference=WSS0381 : impossible de d\u00E9finir l'\u00E9l\u00E9ment ds:Reference dans SecurityTokenReference

WSS0381.diag.cause.1=Erreur lors de la d\u00E9finition de l'\u00E9l\u00E9ment ReferenceElement transmis \u00E0 SecurityTokenReference

WSS0381.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0382.error.appending.object=WSS0382 : impossible d''ajouter l''\u00E9l\u00E9ment ds:Object. Cause : {0}

WSS0382.diag.cause.1=Erreur lors de l'ajout de l'\u00E9l\u00E9ment ds:Object \u00E0 ds:Signature

WSS0382.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement ds:Object valide (conform\u00E9ment \u00E0 la sp\u00E9cification) est transmis \u00E0 appendObject()

WSS0382.diag.check.2=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement non NULL est transmis \u00E0 appendObject()



WSS0383.document.not.set=WSS0383 : le propri\u00E9taire de document de l'\u00E9l\u00E9ment SOAPElement ds:Signature n'est pas d\u00E9fini

WSS0383.diag.cause.1=Le propri\u00E9taire de document de l'\u00E9l\u00E9ment SOAPElement ds:Signature est NULL

WSS0383.diag.check.1=V\u00E9rifiez que le document utilis\u00E9 pour instancier SignatureHeaderBlock() n'est pas NULL



WSS0384.error.creating.timestamp=WSS0384 : impossible de cr\u00E9er l''horodatage. Cause : {0}

WSS0384.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour l'horodatage

WSS0384.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0385.error.creating.timestamp=WSS0385 : l''\u00E9l\u00E9ment SOAPElement wsu:Timestamp \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9

WSS0385.diag.cause.1=L'\u00E9l\u00E9ment SOAPElement utilis\u00E9 pour instancier Timestamp() n'est pas valide (conform\u00E9ment \u00E0 la sp\u00E9cification)

WSS0385.diag.check.1=V\u00E9rifiez que les \u00E9l\u00E9ments Localname et NamespaceURI de SOAPElement utilis\u00E9s pour la cr\u00E9ation de Timestamp() sont corrects, conform\u00E9ment \u00E0 la sp\u00E9cification.



WSS0386.error.creating.timestamp=WSS0386 : impossible de cr\u00E9er une repr\u00E9sentation de l''\u00E9l\u00E9ment SOAPElement pour l''horodatage. Cause : {0}

WSS0386.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour l'horodatage

WSS0386.diag.cause.2=Erreur lors de l'ajout des \u00E9l\u00E9ments SOAPElement enfant \u00E0 l'\u00E9l\u00E9ment Timestamp

WSS0386.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0387.error.creating.usernametoken=WSS0387 : le nom utilisateur n'est pas d\u00E9fini

WSS0387.diag.cause.1=Le nom utilisateur n'est pas d\u00E9fini

WSS0387.diag.check.1=V\u00E9rifiez qu'un nom utilisateur a \u00E9t\u00E9 transmis via le fichier de configuration ou le gestionnaire de callback



WSS0388.error.creating.usernametoken=WSS0388 : erreur lors de la cr\u00E9ation de la repr\u00E9sentation de l''\u00E9l\u00E9ment SOAPElement pour UsernameToken. Cause : {0}

WSS0388.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour UsernameToken

WSS0388.diag.cause.2=Erreur lors de l'ajout des \u00E9l\u00E9ments SOAPElement enfant \u00E0 l'\u00E9l\u00E9ment UsernameToken

WSS0388.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0389.unrecognized.nonce.encoding=WSS0389 : le type EncodingType base64 \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9

WSS0389.diag.cause.1=Le type d'encodage du nonce en base64 n'a pas \u00E9t\u00E9 indiqu\u00E9

WSS0389.diag.check.1=V\u00E9rifiez que le type d'encodage du nonce utilis\u00E9 pour cr\u00E9er l'\u00E9l\u00E9ment UsernameToken est base64



WSS0390.unsupported.charset.exception=WSS0390 : le jeu de caract\u00E8res UTF-8 n'est pas pris en charge

WSS0390.diag.cause.1=Le jeu de caract\u00E8res UTF-8 n'est pas pris en charge pour l'encodage des octets (une cha\u00EEne)

WSS0390.diag.check.1=Reportez-vous \u00E0 la documentation J2SE



WSS0391.error.creating.X509SecurityToken=WSS0391 : l''\u00E9l\u00E9ment wsse:BinarySecurityToken \u00E9tait attendu, mais {0} a \u00E9t\u00E9 trouv\u00E9

WSS0391.diag.cause.1=Les \u00E9l\u00E9ments Localname et NamespaceURI de SOAPElement utilis\u00E9s pour la cr\u00E9ation du jeton ne sont pas valides

WSS0391.diag.check.1=V\u00E9rifiez que les \u00E9l\u00E9ments Localname et NamespaceURI de SOAPElement utilis\u00E9s pour la cr\u00E9ation de X509SecurityToken sont valides (conform\u00E9ment \u00E0 la sp\u00E9cification)



WSS0392.invalid.X509cert.version=WSS0392 : un certificat X509Certificate de version [3] \u00E9tait attendu, mais la version [{0}] a \u00E9t\u00E9 trouv\u00E9e

WSS0392.diag.cause.1=Un certificat X509Certificate de version [3] est attendu



WSS0393.current.ahead.of.expires=WSS0393 : l'heure en cours est ult\u00E9rieure \u00E0 l'heure d'expiration dans l'horodatage

WSS0393.diag.cause.1= L'heure d'expiration dans l'horodatage ne peut pas \u00EAtre ant\u00E9rieure \u00E0 l'heure UTC

WSS0393.diag.check.1=V\u00E9rifiez que l'heure syst\u00E8me est correcte



WSS0394.error.parsing.expirationtime=WSS0394 : erreur lors de l'analyse de l'heure d'expiration/de cr\u00E9ation par d\u00E9faut au format de date.

WSS0394.diag.cause.1=Erreur lors de l'analyse de la date. 

# Format should not be changed. Letters can be translated but the user should known that java.text.SimpleDateFormat is responsible for formatting (meaning of symbols can be found at http://docs.oracle.com/javase/tutorial/i18n/format/simpleDateFormat.html).
WSS0394.diag.check.1=V\u00E9rifiez que la date est au format UTC et qu'elle est sp\u00E9cifi\u00E9e sous la forme "yyyy-MM-dd'T'HH:mm:ss'Z'" ou "yyyy-MM-dd'T'HH:mm:ss'.'sss'Z'"



WSS0395.creating.cipherData=WSS0395 : erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment CipherData

WSS0395.diag.cause.1=Erreur lors de la cr\u00E9ation d'un \u00E9l\u00E9ment CipherData

WSS0395.diag.check.1=Reportez-vous aux API SAAJ



WSS0396.notchild.securityHeader=WSS0396 : l''\u00E9l\u00E9ment {0} n''est pas un enfant de SecurityHeader

WSS0396.diag.cause.1=L'\u00E9l\u00E9ment doit \u00EAtre un enfant de SecurityHeader

WSS0396.diag.check.1=Le parent de l'enfant doit \u00EAtre SecurityHeader


WSS0397.soap.factory.exception=WSS0397 : erreur lors de l'obtention de l'instance SOAPFactory

WSS0398.soap.body.exception=WSS0398 : erreur lors de l'obtention de SOAPBody

WSS0399.soap.envelope.exception=WSS0399 : erreur lors de l'obtention de SOAPEnvelope


#add log msgs for XMLUtil



#SAML related log messages

WSS0400.saml.null.input=WSS0400 : entr\u00E9e NULL



WSS0401.saml.incorrect.input=WSS0401 : entr\u00E9e incorrecte



WSS0402.saml.missing.element.value=WSS0402 : la valeur de cet \u00E9l\u00E9ment est manquante



WSS0403.saml.invalid.action=WSS0403 : l'action n'est pas valide dans l'espace de noms indiqu\u00E9



WSS0404.saml.invalid.version=WSS0404 : version SAML non valide d\u00E9tect\u00E9e.



WSS0405.saml.list.add.error=WSS0405 : \u00E9chec de l'ajout d'un objet \u00E0 la liste



WSS0406.saml.invalid.element=WSS0406 : l'entr\u00E9e comporte un \u00E9l\u00E9ment non valide



WSS0407.saml.missing.attribute=WSS0407 : attribut manquant



WSS0408.saml.element.overflow=WSS0410 : tentative d'ajout d'un nombre d'\u00E9l\u00E9ments sup\u00E9rieur \u00E0 celui autoris\u00E9



WSS0409.saml.missing.statement=WSS0409 : l'assertion ne comporte aucune instruction



WSS0410.saml.element.underflow=WSS0410 : tentative d'ajout d'un nombre d'\u00E9l\u00E9ments inf\u00E9rieur \u00E0 celui requis



WSS0411.saml.missing.element=WSS0411 : \u00E9l\u00E9ment manquant



WSS0412.saml.condition.not.supported=WSS0412 : la condition indiqu\u00E9e n'est pas prise en charge



WSS0413.saml.invalid.date.format=WSS0413 : format de date non valide



WSS0414.saml.missing.attribute.value=WSS0414 : valeur d'attribut manquante



WSS0415.saml.empty.element=WSS0415 : l'\u00E9l\u00E9ment ne comporte aucun contenu



WSS0416.saml.signature.invalid=WSS0416 : la signature de l'assertion SAML n'est pas valide

WSS0417.saml.timestamp.invalid=WSS0417 : \u00E9chec de la validation de la condition (notBefore, notOnOrAfter) pour l'assertion SAML

WSS0418.saml.import.exception=WSS0418 : exception lors de l'import du jeton SAML

WSS0419.saml.signature.verify.failed=WSS0419 : exception lors de la v\u00E9rification de la signature de l'assertion SAML

WSS0420.saml.cannot.find.subjectconfirmation.keyinfo=WSS0420 : impossible de localiser l'\u00E9l\u00E9ment KeyInfo dans l'\u00E9l\u00E9ment SubjectConfirmation de l'assertion SAML

WSS0421.saml.cannot.subjectconfirmation.keyinfo.not.unique=WSS0421 : l'\u00E9l\u00E9ment KeyInfo n'est pas unique dans l'\u00E9l\u00E9ment SubjectConfirmation de l'assertion SAML 

WSS0422.saml.issuer.validation.failed=WSS0422 : \u00E9chec de la validation de l'\u00E9metteur pour l'assertion SAML

WSS0423.saml.subject.nameid.validation.failed=WSS0423 : \u00E9chec de la validation de l'\u00E9l\u00E9ment NameIdentifier du sujet pour l'assertion SAML

WSS0424.null.OwnerDocument.element=WSS0424 : l'\u00E9l\u00E9ment ne comporte pas de document propri\u00E9taire

WSS0425.unableto.resolve.xpath=WSS0425 : impossible de r\u00E9soudre l'expression XPath

WSS0426.failed.DSAKeyValue=WSS0426 : exception lors de la tentative d'obtention de la valeur de la cl\u00E9 DSA

WSS0427.unableto.decode.base64=WSS0427 : impossible de d\u00E9coder les donn\u00E9es encod\u00E9es en base64

WSS0428.saml.not.found=WSS0428 : aucune assertion SAML n'a \u00E9t\u00E9 trouv\u00E9e dans le message

WSS0429.saml.authInstant.or.session.parse.failed=WSS0429 : erreur lors de l'analyse de l'\u00E9l\u00E9ment authnInstantDate ou sessionNotOnOrAfter

WSS0430.saml.getNotBeforeDate.or.getNotOnOrAfterDate.parse.failed=WSS0430 : erreur lors de l'analyse de l'\u00E9l\u00E9ment getNotBefore ou getNotOnOrAfter

# configuration framework messages from 500

# Adding diagnostics for SEVERE messages only



WSS0500.class.not.messagefilter=WSS0500 : la classe {0} n''impl\u00E9mente pas l''\u00E9l\u00E9ment MessageFilter

WSS0500.diag.cause.1=Le nom de classe n'est pas reconnu pour l'\u00E9l\u00E9ment MessageFilter

WSS0500.diag.check.1=V\u00E9rifiez que la classe impl\u00E9mente l'\u00E9l\u00E9ment MessageFilter



WSS0501.property.not.defined=WSS0501 : la propri\u00E9t\u00E9 {0} n''est pas d\u00E9finie. Valeur NULL renvoy\u00E9e



WSS0502.bad.reader.state.1=WSS0502 : l''\u00E9tat du processus de lecture est incorrect. Valeur attendue : {0}, valeur obtenue : {1}

WSS0502.diag.cause.1=L'\u00E9l\u00E9ment d\u00E9tect\u00E9 ne correspond pas \u00E0 l'\u00E9l\u00E9ment attendu

WSS0502.diag.check.1=V\u00E9rifiez que le fichier XML respecte le sch\u00E9ma de d\u00E9finition de la configuration



WSS0503.bad.reader.state.2=WSS0503 : l''\u00E9tat du processus de lecture est incorrect. Valeur attendue : {0}, {1} ou {2}, valeur obtenue : {3}

WSS0503.diag.cause.1=L'\u00E9l\u00E9ment d\u00E9tect\u00E9 ne correspond pas \u00E0 l'\u00E9l\u00E9ment valide attendu

WSS0503.diag.check.1=V\u00E9rifiez que le fichier XML respecte le sch\u00E9ma de d\u00E9finition de la configuration



WSS0504.class.not.found=WSS0504 : la classe {0} est introuvable dans la variable d''environnement classpath



WSS0505.using.default.target.values=WSS0505 : aucune cible n'est indiqu\u00E9e. Utilisation des valeurs par d\u00E9faut.



WSS0506.target.not.specified.verify=WSS0506 : aucune cible n'est indiqu\u00E9e dans la v\u00E9rification.



WSS0507.target.not.specified.decrypt=WSS0507 : aucune cible n'est indiqu\u00E9e dans le d\u00E9cryptage.



WSS0508.unableto.set.defaults=WSS0508 : impossible de d\u00E9finir des param\u00E8tres par d\u00E9faut lorsque des param\u00E8tres personnalis\u00E9s sont ajout\u00E9s

WSS0508.diag.cause.1=Impossible de d\u00E9finir des param\u00E8tres par d\u00E9faut lorsque des param\u00E8tres personnalis\u00E9s sont sp\u00E9cifi\u00E9s

WSS0508.diag.check.1=V\u00E9rifiez qu'aucune op\u00E9ration d'exp\u00E9diteur ou exigence de destinataire n'est d\u00E9finie dans un fichier de configuration

WSS0508.diag.check.2=V\u00E9rifiez qu'aucun param\u00E8tre d'exp\u00E9diteur ou de destinataire n'est ajout\u00E9 par programmation



WSS0509.defaults.already.set=WSS0509 : impossible de d\u00E9finir des param\u00E8tres personnalis\u00E9s lorsque des param\u00E8tres par d\u00E9faut sont ajout\u00E9s

WSS0509.diag.cause.1=Impossible de d\u00E9finir des param\u00E8tres personnalis\u00E9s lorsque des param\u00E8tres par d\u00E9faut sont sp\u00E9cifi\u00E9s

WSS0509.diag.check.1=V\u00E9rifiez qu'aucun param\u00E8tre par d\u00E9faut n'est ajout\u00E9 par programmation



WSS0510.cannot.use.keyname=WSS0510 : les informations de cl\u00E9 publique pour la v\u00E9rification d'une signature doivent \u00EAtre transmises dans le message

WSS0510.diag.cause.1=Impossible d'utiliser les cl\u00E9s nomm\u00E9es pour transmettre les informations de cl\u00E9 publique



WSS0511.illegal.boolean.value=WSS0511 : les cha\u00EEnes de valeur bool\u00E9enne peuvent \u00EAtre "true"|"false" ; valeur trouv\u00E9e : {0}

WSS0511.diag.cause.1=Cha\u00EEne de valeur bool\u00E9enne non autoris\u00E9e ; les cha\u00EEnes valides sont "true" et "false"

WSS0511.diag.check.1=V\u00E9rifiez que les cha\u00EEnes de valeur bool\u00E9enne sont "true" ou "false"


# {0} - attribute name, {1} - element name (e.g.: xwss:X509Token, xwss:Target)
WSS0512.illegal.attribute.name=WSS0512 : attribut {0} inattendu pour l''\u00E9l\u00E9ment {1}

WSS0512.diag.cause.1=Attribut non autoris\u00E9 pour un \u00E9l\u00E9ment de configuration de s\u00E9curit\u00E9

WSS0512.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



WSS0513.illegal.configuration.element=WSS0513 : \u00E9l\u00E9ment {0} inattendu dans xwss:SecurityConfiguration

WSS0513.diag.cause.1=El\u00E9ment non autoris\u00E9 dans xwss:SecurityConfiguration

WSS0513.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



WSS0514.illegal.nested.element=WSS0514 : \u00E9l\u00E9ment enfant {0} inattendu dans {1}

WSS0514.diag.cause.1=El\u00E9ment enfant non autoris\u00E9 dans un \u00E9l\u00E9ment de configuration de la s\u00E9curit\u00E9

WSS0514.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



WSS0515.illegal.keyreference=WSS0515 : valeur non autoris\u00E9e pour la cha\u00EEne de r\u00E9f\u00E9rence de cl\u00E9 : {0}

WSS0515.diag.cause.1=Valeur non autoris\u00E9e pour la cha\u00EEne de r\u00E9f\u00E9rence de cl\u00E9

WSS0515.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9


# {0} - e.g. http://java.sun.com/xml/ns/xwss/config#Timestamp, {1} - element name
WSS0516.duplicate.configuration.element=WSS0516 : \u00E9l\u00E9ment {0} en double dans {1}

WSS0516.diag.cause.1=El\u00E9ment en double non autoris\u00E9 pour un \u00E9l\u00E9ment de configuration de s\u00E9curit\u00E9

WSS0516.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



# Usage not found. TODO Remove
#WSS0517.duplicate.configuration.element=WSS0517: Multiple configuration elements not allowed on: {0}

WSS0517.diag.cause.1=El\u00E9ment en double non autoris\u00E9 pour un \u00E9l\u00E9ment de configuration de s\u00E9curit\u00E9

WSS0517.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



WSS0518.illegal.contentOnly.use=WSS0518 : l'indicateur ContentOnly ne peut \u00EAtre sp\u00E9cifi\u00E9 que pour les \u00E9l\u00E9ments cible qui sont des \u00E9l\u00E9ments enfant de Encrypt ou requireEncryption



WSS0519.illegal.attribute.value=WSS0519 : valeur d''attribut interdite/manquante pour : {0}

WSS0519.diag.cause.1=Valeur d'attribut non autoris\u00E9e/manquante

WSS0519.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



WSS0520.illegal.configuration.state=WSS0520 : \u00E9tat de configuration de l'\u00E9l\u00E9ment interdit

WSS0520.diag.cause.1=L'\u00E9l\u00E9ment xwss:SymmetricKey n'est pas autoris\u00E9 avec xwss:X509Token

WSS0520.diag.check.1=V\u00E9rifiez que le fichier de configuration est coh\u00E9rent avec le sch\u00E9ma de configuration de la s\u00E9curit\u00E9



# helpers/ messages from 600

# Adding diagnostics for SEVERE messages only



WSS0600.illegal.token.reference=WSS0600 : impossible de localiser la cl\u00E9 pour TokenReference (ds:KeyInfo)

WSS0600.diag.cause.1=Impossible de localiser une cl\u00E9 dans l'\u00E9l\u00E9ment SecurityEnvironment pour la r\u00E9f\u00E9rence de jeton

WSS0600.diag.check.1=V\u00E9rifiez que le certificat r\u00E9f\u00E9renc\u00E9 est valide et qu'il figure dans les fichiers de cl\u00E9s



WSS0601.unsupported.keyinfoWSS0601.illegal.key.value=WSS0601 : impossible de localiser la cl\u00E9 pour KeyValue (ds : KeyInfo). Cause : {0}

WSS0601.diag.cause.1=Impossible de localiser une cl\u00E9 dans l'\u00E9l\u00E9ment SecurityEnvironment pour KeyValue

WSS0601.diag.check.1=V\u00E9rifiez que le certificat r\u00E9f\u00E9renc\u00E9 est valide et qu'il figure dans les fichiers de cl\u00E9s



WSS0602.illegal.x509.data=WSS0602 : impossible de localiser la cl\u00E9 pour X509Data (ds : KeyInfo). Cause : {0}

WSS0602.diag.cause.1=Impossible de localiser une cl\u00E9 dans l'\u00E9l\u00E9ment SecurityEnvironment pour X509Data

WSS0602.diag.check.1=V\u00E9rifiez que le certificat r\u00E9f\u00E9renc\u00E9 est valide et qu'il figure dans les fichiers de cl\u00E9s



WSS0603.xpathapi.transformer.exception=WSS0603 : une exception TransformerException XPathAPI est survenue en raison de {0} lors de la recherche d''un \u00E9l\u00E9ment comportant un attribut wsu:Id/Id/SAMLAssertionID correspondant 

WSS0603.diag.cause.1=Une exception TransformerException XPathAPI est survenue lors de la recherche d'un \u00E9l\u00E9ment comportant un attribut wsu:Id/Id/SAMLAssertionID correspondant

WSS0603.diag.check.1=Reportez-vous \u00E0 la documentation XPathAPI



WSS0604.cannot.find.element=WSS0604 : impossible de localiser un \u00E9l\u00E9ment comportant un attribut wsu:Id/Id/SAMLAssertionID correspondant

WSS0604.diag.cause.1=Impossible de localiser un \u00E9l\u00E9ment comportant l'attribut wsu:Id/Id/SAMLAssertionID indiqu\u00E9



WSS0605.str.transform.exception=WSS0605 : erreur lors de l''application de l''algorithme STR-Transform. Cause : {0}

WSS0605.diag.cause.1=Erreur lors de l'application de l'algorithme STR-Transform



WSS0606.str.transform.exception=WSS0606 : le noeud d'entr\u00E9e d\u00E9fini sur STR-Transform est vide

WSS0606.diag.cause.1=Le noeud d'entr\u00E9e d\u00E9fini sur STR-Transform est vide

WSS0606.diag.check.1=V\u00E9rifiez que le noeud r\u00E9f\u00E9renc\u00E9 (\u00E0 transformer \u00E0 l'aide de l'algorithme STR-Transform) dans ds:SignedInfo est valide



WSS0607.str.transform.exception=WSS0607 : exception DOMException lors de la mise \u00E0 jour de l'\u00E9l\u00E9ment SOAPElement repr\u00E9sentant un jeton X509Token

WSS0607.diag.cause.1=Exception DOMException lors de la suppression de l'attribut "EncodingType" de l'\u00E9l\u00E9ment SOAPElement repr\u00E9sentant un jeton X509Token



WSS0608.illegal.reference.mechanism=WSS0608 : m\u00E9canisme de r\u00E9f\u00E9rence interdit dans l'\u00E9l\u00E9ment SecurityTokenReference

WSS0608.diag.cause.1=Le m\u00E9canisme de r\u00E9f\u00E9rence dans l'\u00E9l\u00E9ment SecurityTokenReference n'est pas pris en charge

WSS0608.diag.check.1=V\u00E9rifiez que le m\u00E9canisme de r\u00E9f\u00E9rence est d\u00E9fini sur l'une des valeurs suivantes : Direct/KeyIdentifier/X509IssuerSerial



# impl/ messages from 650

# Adding diagnostics for SEVERE messages only



WSS0650.userpwd.file.notfound=WSS0650 : le fichier de donn\u00E9es de nom utilisateur/mot de passe est introuvable

WSS0650.diag.cause.1=Le fichier de donn\u00E9es de nom utilisateur/mot de passe est introuvable

WSS0650.diag.check.1=V\u00E9rifiez que la propri\u00E9t\u00E9 syst\u00E8me com.sun.xml.wss.usersFile est d\u00E9finie



WSS0651.parser.config.error=WSS0651 : \u00E9chec de la cr\u00E9ation de l'instance JDocumentBuilder JAXP

WSS0651.diag.cause.1=Echec de la cr\u00E9ation de l'instance JDocumentBuilder JAXP



WSS0652.error.parsing.file=WSS0652 : erreur lors de l''analyse du fichier {0}

WSS0652.diag.cause.1=Erreur lors de l'analyse du fichier xws-security-users



WSS0653.error.reading.file=WSS0653 : erreur lors de la lecture du fichier {0}

WSS0653.diag.cause.1=Erreur lors de la lecture du fichier xws-security-users



WSS0654.soap.exception=WSS0654 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment javax.xml.soap.Name pour wsu:Id. Cause : {0}

WSS0654.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name pour wsu:Id

WSS0654.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0655.error.creating.headerblock=WSS0655 : erreur lors de la cr\u00E9ation d''une instance de bloc d''en-t\u00EAte pour l''\u00E9l\u00E9ment {0}

SS0655.diag.cause.1=L'objet classe ne correspond pas au bloc d'en-t\u00EAte identifi\u00E9 par l'\u00E9l\u00E9ment SOAPElement

WSS0655.diag.check.1=V\u00E9rifiez que l'objet classe correspond au bloc d'en-t\u00EAte identifi\u00E9 par l'\u00E9l\u00E9ment SOAPElement



WSS0656.keystore.file.notfound=WSS0656 : le fichier de cl\u00E9s est introuvable

WSS0656.diag.cause.1=L'URL du fichier de cl\u00E9s n'est pas indiqu\u00E9e/valide dans server.xml 

WSS0656.diag.cause.2=Il n'existe aucun fichier de cl\u00E9s dans $user.home

WSS0656.diag.check.1=V\u00E9rifiez que l'attribut keystoreFile est sp\u00E9cifi\u00E9 pour l'\u00E9l\u00E9ment de connecteur SSL Coyote HTTP/1.1 dans server.xml et qu'il est valide

WSS0656.diag.check.2=V\u00E9rifiez qu'il existe un fichier de cl\u00E9s dans $user.home



WSS0657.config.file.notfound=WSS0657 : le fichier tomcat-users.xml est introuvable

WSS0657.diag.cause.1=Le fichier tomcat-users.xml est introuvable



# keyinfo/ messages from 700

# Adding diagnostics for SEVERE messages only



WSS0700.security.environment.notset=WSS0700 : aucune instance de l'\u00E9l\u00E9ment SecurityEnvironment n'est d\u00E9finie dans SecurableSoapMessage

WSS0700.diag.cause.1=Aucune instance de l'\u00E9l\u00E9ment SecurityEnvironment n'est d\u00E9finie dans SecurableSoapMessage

WSS0700.diag.check.1=V\u00E9rifiez que la m\u00E9thode setSecurityEnvironment() est appel\u00E9e pour SecurableSoapMessage

WSS0700.diag.check.2=V\u00E9rifiez que SetSecurityEnvironmentFilter est appliqu\u00E9 \u00E0 l'\u00E9l\u00E9ment SecurableSoapMessage



WSS0701.cannot.locate.certificate=WSS0701 : impossible de localiser le certificat X509v3 pour obtenir la valeur KeyIdentifier pour l''alias : {0}

WSS0701.diag.cause.1=Impossible de localiser un certificat X509v3 pour l'alias dans le fichier de cl\u00E9s

WSS0701.diag.cause.2=Si aucun alias n'a \u00E9t\u00E9 indiqu\u00E9 pour la signature, aucun certificat par d\u00E9faut n'est disponible

WSS0701.diag.check.1=V\u00E9rifiez qu'un certificat par d\u00E9faut est disponible et/ou qu'un alias valide est utilis\u00E9



WSS0702.no.subject.keyidentifier=WSS0702 : le certificat X509v3 (pour l''alias : [{0}]) ne comporte aucun identificateur de cl\u00E9 de sujet

WSS0702.diag.cause.1=Le certificat X509v3 pour l'alias indiqu\u00E9 ne comporte aucun identificateur de cl\u00E9 de sujet

WSS0702.diag.check.1=V\u00E9rifiez qu'un certificat X509v3 valide figure dans les fichiers de cl\u00E9s



WSS0703.unsupported.operation=WSS0703 : op\u00E9ration insertKey(SecurityTokenReference, SecurableSoapMessage) non prise en charge pour KeyNameStrategy

WSS0703.diag.cause.1=L'op\u00E9ration insertKey(SecurityTokenReference, SecurableSoapMessage) n'est pas prise en charge pour KeyNameStrategy



WSS0704.null.session.key=WSS0704 : l'\u00E9l\u00E9ment KeyName de la session n'a pas \u00E9t\u00E9 d\u00E9fini pour l'instance SecurityEnvironment

WSS0704.diag.cause.1=Nom d'accord : SESSION-KEY-VALUE n'a pas \u00E9t\u00E9 d\u00E9fini pour l'instance SecurityEnvironment

WSS0704.diag.check.1=V\u00E9rifiez que le nom d'accord SESSION-KEY-VALUE est d\u00E9fini pour SecurityEnvironment \u00E0 l'aide de la m\u00E9thode setAgreementProperty() 



WSS0705.unsupported.operation=WSS0705 : op\u00E9ration setCertificate(X509Certificate) non prise en charge pour KeyNameStrategy

WSS0705.diag.cause.1=L'op\u00E9ration setCertificate(X509Certificate) n'est pas prise en charge pour KeyNameStrategy

# {0} - key type e.g.: No Matching Certificate for : SunPKCS11-NSS RSA public key, 1024 bits (id 373, session object) modulus: 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 public exponent: 65537 found in KeyStore or TrustStore
WSS0706.no.matching.cert=WSS0706 : erreur : aucun certificat correspondant pour {0} n''a \u00E9t\u00E9 trouv\u00E9 dans le fichier de cl\u00E9s ou le truststore.

WSS0707.null.truststore=WSS0707 : erreur : aucune entr\u00E9e n'a \u00E9t\u00E9 remplie par TrustStoreCallback dans le truststore.

WSS0708.no.digest.algorithm=WSS0708 : l'algorithme Digest SHA-1 est introuvable

WSS0709.error.getting.rawContent=WSS0709 : erreur lors de l'obtention du contenu Raw du certificat

# {0} - key type e.g.: No Matching Certificate for : SunPKCS11-NSS RSA public key, 1024 bits (id 373, session object) modulus: 00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000 public exponent: 65537 found in KeyStore
WSS0710.no.matching.cert.keystore=WSS0710 : erreur : aucun certificat correspondant pour {0} n''a \u00E9t\u00E9 trouv\u00E9 dans le fichier de cl\u00E9s.

WSS0711.error.match.cert.for.decoded.string=WSS0711 : erreur : une erreur est survenue lors de la mise en correspondance de la certification pour la cha\u00EEne d\u00E9cod\u00E9e.

WSS0712.error.adjust.skew.freshness.time=WSS0712 : erreur lors de l'ajustement de l'heure en cours par rapport \u00E0 l'heure de d\u00E9calage et d'actualit\u00E9.
WSS0713.error.in.certstore.lookup=WSS0713 : exception lors de la recherche de l'\u00E9l\u00E9ment CertStore
WSS0714.error.getting.userClass=WSS0714 : impossible de localiser la classe d''utilisateur {0}
WSS0715.exception.creating.newinstance=WSS0715 : exception lors de la cr\u00E9ation d'une instance
WSS0716.failed.validateSAMLAssertion=WSS0716 : \u00E9chec de la validation de l'assertion SAML
WSS0717.no.SAMLCallbackHandler=WSS0717 : aucun CallbackHandler SAML n'a \u00E9t\u00E9 sp\u00E9cifi\u00E9 dans la configuration alors que cela est obligatoire : impossible de remplir l'assertion SAML
WSS0718.exception.invoking.samlHandler=WSS0718 : exception lors de l'appel du CallbackHandler SAML fourni par l'utilisateur
WSS0719.error.getting.longValue=WSS0719 : erreur lors de l'obtention de la valeur Long
# reference/ messages from 750

# Adding diagnostics for SEVERE messages only



WSS0750.soap.exception=WSS0750 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment javax.xml.soap.SOAPElement pour {0}. Cause : {1}

WSS0750.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.SOAPElement

WSS0750.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0751.invalid.data.reference=WSS0751 : l''\u00E9l\u00E9ment SOAPElement ({0}) transmis \u00E0 DirectReference() n''est pas valide

WSS0751.diag.cause.1=Le nom local de l'\u00E9l\u00E9ment SOAPElement transmis n'est pas "Reference"

WSS0751.diag.cause.2=L'URI d'espace de noms de l'\u00E9l\u00E9ment SOAPElement transmis n'est pas conforme \u00E0 la sp\u00E9cification WSS

WSS0751.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement conforme \u00E0 la sp\u00E9cification est transmis



WSS0752.invalid.embedded.reference=WSS0751 : l''\u00E9l\u00E9ment SOAPElement ({0}) transmis \u00E0 EmbeddedReference() n''est pas valide

WSS0752.diag.cause.1=Le nom local de l'\u00E9l\u00E9ment SOAPElement transmis n'est pas "Embedded"

WSS0752.diag.cause.2=L'URI d'espace de noms de l'\u00E9l\u00E9ment SOAPElement transmis n'est pas conforme \u00E0 la sp\u00E9cification WSS

WSS0752.diag.check.1=V\u00E9rifiez qu'un \u00E9l\u00E9ment SOAPElement conforme \u00E0 la sp\u00E9cification est transmis



WSS0753.missing.embedded.token=WSS0753 : jeton imbriqu\u00E9 manquant dans l'\u00E9l\u00E9ment wsse:Embedded

WSS0753.diag.cause.1=Jeton imbriqu\u00E9 manquant dans l'\u00E9l\u00E9ment wsse:Embedded

WSS0753.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment de jeton est conforme \u00E0 la sp\u00E9cification WSS



WSS0754.token.already.set=WSS0754 : le jeton a d\u00E9j\u00E0 \u00E9t\u00E9 d\u00E9fini pour EmbeddedReference

WSS0754.diag.cause.1=Le jeton a d\u00E9j\u00E0 \u00E9t\u00E9 d\u00E9fini pour EmbeddedReference

WSS0754.diag.cause.2=Une repr\u00E9sentation SOAPElement de la r\u00E9f\u00E9rence EmbeddedReference contenant le jeton est utilis\u00E9e pour cr\u00E9er l'instance EmbeddedReference



WSS0755.soap.exception=WSS0755 : erreur lors de l''imbrication du jeton dans TokenReference. Cause : {0}

WSS0755.diag.cause.1=Erreur lors de l'imbrication du jeton dans TokenReference



WSS0756.invalid.key.identifier=WSS0756 : l''\u00E9l\u00E9ment SOAPElement ({0}) transmis \u00E0 KeyIdentifier() n''est pas valide

WSS0756.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment SOAPElement pour wsse:KeyIdentifier

WSS0756.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0757.error.setting.reference=WSS0757 : erreur lors de l'ajout de la valeur KeyIdentifier dans wsse:KeyIdentifier

WSS0757.diag.cause.1=Erreur lors de l'ajout de la valeur de KeyIdentifier dans wsse:KeyIdentifer

WSS0757.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0758.soap.exception=WSS0758 : erreur lors de la cr\u00E9ation de l''\u00E9l\u00E9ment javax.xml.soap.Name pour {0}. Cause : {1}

WSS0758.diag.cause.1=Erreur lors de la cr\u00E9ation de l'\u00E9l\u00E9ment javax.xml.soap.Name 

WSS0758.diag.check.1=Reportez-vous \u00E0 la documentation relative \u00E0 l'API SAAJ



WSS0759.error.creating.issuerserial=WSS0759 : erreur lors de la cr\u00E9ation de l'instance X509IssuerSerial

WSS0759.diag.cause.1=Impossible de cr\u00E9er une instance X509IssuerSerial

WSS0759.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment SOAPElement transmis au constructeur est conforme \u00E0 la sp\u00E9cification (et qu'il comporte des \u00E9l\u00E9ments enfant X509IssuerSerial)



WSS0760.warning.optionaltarget.enforce.ignored=WSS0760 : avertissement : la valeur d'attribut d'application d\u00E9finie sur 'true' pour la cible facultative sera ignor\u00E9e.



WSS0761.context.not.instanceof.servletendpointcontext=WSS0761 : le contexte indiqu\u00E9 n'est pas une instance de ServletEndpointContext ou de com.sun.xml.wss.ProcessingContext

WSS0761.diag.cause.1=L'argument de contexte doit avoir la valeur ServletEndpointContext ou com.sun.xml.wss.ProcessingContext

WSS0761.diag.check.1=V\u00E9rifiez l'argument de contexte transmis \u00E0 getRequesterSubject



WSS0762.unsupported.encodingtype=WSS0762 : la propri\u00E9t\u00E9 EncodingType {0} d\u00E9finie pour KeyIdentifier n''est pas prise en charge

WSS0762.diag.cause.1=La propri\u00E9t\u00E9 encodingType d\u00E9finie pour KeyIdentifier n'est pas prise en charge

WSS0762.diag.check.1=V\u00E9rifiez la valeur de la propri\u00E9t\u00E9 encodingType pour KeyIdentifier



WSS0763.exception.issuername=WSS0763 : exception {0} lors de l''obtention du nom de l''\u00E9metteur

WSS0763.diag.cause.1=Exception lors de l''obtention du nom de l'\u00E9metteur

WSS0763.diag.check.1=V\u00E9rifiez que l'\u00E9l\u00E9ment IssuerName est correctement sp\u00E9cifi\u00E9 dans le message SOAP





#################



#Policy related logs from 0801-0900

WSS0801.illegal.securitypolicy=Type de strat\u00E9gie SecurityPolicy interdit 

WSS0801.diag.cause.1=Le type de la strat\u00E9gie SecurityPolicy est interdit

WSS0801.diag.check.1=V\u00E9rifiez que la strat\u00E9gie est WSSPolicy, MessagePolicy ou ApplicationSecurityConfiguration



WSS0802.securitypolicy.notsatisfied=La strat\u00E9gie SecurityPolicy {0} n''est pas respect\u00E9e

WSS0802.diag.cause.1=Strat\u00E9gie SecurityPolicy non respect\u00E9e

WSS0802.diag.check.1=Assurez-vous que toutes les exigences de la strat\u00E9gie sont valides et respect\u00E9es



WSS0803.soapmessage.notset=Le param\u00E8tre javax.xml.soap.SOAPMessage n'est pas d\u00E9fini dans ProcessingContext

WSS0803.diag.cause.1=L'\u00E9l\u00E9ment SOAPMessage est NULL

WSS0803.diag.check.1=Assurez-vous que l'\u00E9l\u00E9ment SOAPMessage est correctement d\u00E9fini dans ProcessingContext



WSS0804.callback.handler.notset=L'impl\u00E9mentation de SecurityEnvironment/javax.security.auth.callback.CallbackHandler n'est pas d\u00E9finie dans ProcessingContext

WSS0804.diag.cause.1=Le gestionnaire de callback est NULL

WSS0804.diag.check.1=Assurez-vous que le gestionnaire de callback est correctement d\u00E9fini dans ProcessingContext



#warning

WSS0805.policy.null=La strat\u00E9gie est NULL



WSS0806.static.context.null=Le contexte statique est NULL



WSS0807.no.body.element=Aucun \u00E9l\u00E9ment de corps n'a \u00E9t\u00E9 trouv\u00E9

WSS0807.diag.cause.1=L'\u00E9l\u00E9ment SOAPBody est introuvable dans le message

WSS0807.diag.check.1=Consultez l'exception sous-jacente pour plus d'informations



WSS0808.no.body.element.operation=Aucun \u00E9l\u00E9ment de corps identifiant l'op\u00E9ration n'a \u00E9t\u00E9 trouv\u00E9

WSS0808.diag.cause.1=L'\u00E9l\u00E9ment SOAPBody identifiant l'op\u00E9ration est introuvable

WSS0808.diag.check.1=L'\u00E9l\u00E9ment SOAPBody doit contenir un enfant identifiant l'op\u00E9ration


WSS0809.fault.WSSSOAP=WSS0809 : une erreur WSS SOAP est survenue
WSS0810.method.invocation.failed=WSS0810 : \u00E9chec de l'appel de la m\u00E9thode
WSS0811.exception.instantiating.aliasselector=WSS0811 : exception lors de l'instanciation de l'\u00E9l\u00E9ment AliasSelector fourni par l'utilisateur
WSS0812.exception.instantiating.certselector=WSS0812 : exception lors de l'instanciation de l'\u00E9l\u00E9ment CertSelector fourni par l'utilisateur
WSS0813.failedto.getcertificate=WSS0813 : une exception d'E/S est survenue : \u00E9chec de l'obtention du certificat \u00E0 partir du truststore
# {0} - target in policy (e.g.: "MessageID"/"BinarySecurityToken ") , {1} - "Signature"/"Encryption" (policy type) e.g.: Policy verification error:Missing target BinarySecurityToken for Signature
WSS0814.policy.verification.error.missing.target=WSS0814 : erreur de v\u00E9rification de la strat\u00E9gie, cible {0} manquante pour {1}
WSS0815.Nonce.repeated.error=WSS : nonce r\u00E9p\u00E9t\u00E9 : le cache nonce contient d\u00E9j\u00E0 la valeur nonce {0}
WSS0816.base64.decoding.error=WSS0816 : exception de d\u00E9codage base64
WSS0817.keystore.login.module.login.error=WSS0817 : erreur lors de la connexion de l'\u00E9l\u00E9ment keystoreloginmodule
WSS0818.error.putting.certificate.epridentity=WSS0818 : erreur lors de l'insertion du certificat de serveur dans l'identit\u00E9 EPR
WSS0819.error.getting.certificate.epridentity=WSS0819 : erreur lors de la tentative d'obtention du certificat \u00E0 partir de l'extension d'identit\u00E9

WSS0820.error.validate.certificate.epridentity=WSS0820 : exception lors de la validation du certificat de serveur obtenu \u00E0 partir de l'identit\u00E9 EPR
WSS0821.certificate.not.found.for.alias=WSS0821 : le certificat correspondant \u00E0 l''alias {0} est introuvable
WSS0822.error.validating.server.certificate=WSS0822 : impossible de valider le certificat de serveur, il ne sera pas utilis\u00E9
WSS0823.alias.notfound.for.aliasSelector=WSS0823 : l'alias extrait \u00E0 l'aide de l'\u00E9l\u00E9ment aliasSelector est NULL
WSS0824.using.server.certificate.from.eprIdentity=WSS0824 : le certificat trouv\u00E9 dans le WSDL du serveur ou par la propri\u00E9t\u00E9 du certificat de serveur est valide, il sera utilis\u00E9

WSS0825.error.validate.nonce=WSS0825 : erreur lors de la validation du nonce \u00E0 partir de la banque de sauvegarde
WSS0826.error.initialize.backingstore=WSS0826 : erreur lors de l'initialisation de la banque de sauvegarde
WSS0827.error.removing.expired.entries=WSS0827 : erreur lors de la suppression des entr\u00E9es expir\u00E9es de la banque de sauvegarde
###########

# Adding BSP related requirement failures

BSP3227.Single.Timestamp=BSP3227 : un \u00E9l\u00E9ment SECURITY_HEADER ne peut pas contenir plusieurs \u00E9l\u00E9ments TIMESTAMP.

BSP3203.Onecreated.Timestamp=BSP3203 : un \u00E9l\u00E9ment TIMESTAMP ne doit comporter qu'un seul \u00E9l\u00E9ment enfant wsu:Created.

BSP3224.Oneexpires.Timestamp=BSP3203 : un \u00E9l\u00E9ment TIMESTAMP doit comporter exactement un \u00E9l\u00E9ment enfant wsu:Expires.

BSP3222.element_not_allowed_under_timestmp = BSP3222 : l''\u00E9l\u00E9ment {0} n''est pas autoris\u00E9 dans l''\u00E9l\u00E9ment TIMESTAMP. 

BSP3221.CreatedBeforeExpires.Timestamp=BSP3221 : l'\u00E9l\u00E9ment wsu:Expires doit appara\u00EEtre apr\u00E8s wsu:Created dans l'horodatage

BSP3225.createdValueType.Timestamp=BSP3225 : un \u00E9l\u00E9ment wsu:Created dans l'\u00E9l\u00E9ment TIMESTAMP ne doit pas inclure d'attribut ValueType.

BSP3226.expiresValueType.Timestamp=BSP3226 : un \u00E9l\u00E9ment wsu:Expires dans l'\u00E9l\u00E9ment TIMESTAMP ne doit pas inclure d'attribut ValueType.

BSP4201.PasswordType.Username=BSP4201 : un \u00E9l\u00E9ment wsse:UsernameToken/wsse:Password dans l'\u00E9l\u00E9ment SECURITY_HEADER doit sp\u00E9cifier un attribut Type.

BSP3029.EncodingType.NotPresent=BSP3029 : tout \u00E9l\u00E9ment wsse:BinarySecurityToken dans un \u00E9l\u00E9ment SECURE_ENVELOPE doit contenir un attribut EncodingType.

BSP3030.EncodingType.Invalid=BSP3030 : la valeur de l'attribut EncodingType dans l'\u00E9l\u00E9ment wsse:BinarySecurityToken n'est pas valide.

BSP3031.ValueType.NotPresent=BSP3031 : tout \u00E9l\u00E9ment wsse:BinarySecurityToken dans un \u00E9l\u00E9ment SECURE_ENVELOPE doit contenir un attribut ValueType.
BSP3104.envelopedSignature.discoraged = BSP3104 : la signature envelopp\u00E9e est d\u00E9conseill\u00E9e par BSP 1.1
BSP5602.encryptedkey.recipient = BSP5602 : l''\u00E9l\u00E9ment EncryptedKey portant l''ID {0} ne doit pas contenir d''attribut de destinataire.
BSP5603.encryptedkey.encryptionmehod = BSP5603 : l''\u00E9l\u00E9ment EncryptedKey portant l''ID {0} doit contenir un \u00E9l\u00E9ment enfant EncryptionMethod.
BSP5622.encryptedkey.mimetype = BSP 5622 : l''\u00E9l\u00E9ment EncryptedKey portant l''ID {0} ne doit pas contenir d''attribut MimeType.
BSP5623.encryptedkey.encoding = BSP 5623 : l''\u00E9l\u00E9ment EncryptedKey portant l''ID {0} ne doit pas contenir d''attribut d''encodage.
BSP5601.encrypteddata.encryptionmethod = BSP 5601 : l''ID de l''\u00E9l\u00E9ment EncryptedKey {0} doit contenir un \u00E9l\u00E9ment enfant EncryptionMethod.
BSP5624.encrypteddata.idattribute = BSP 5624 : l'\u00E9l\u00E9ment EncryptedData doit contenir un attribut d'ID.
BSP5629.encrypteddata.keyinfo = BSP 5629 : l'\u00E9l\u00E9ment EncryptedData doit contenir un \u00E9l\u00E9ment enfant KeyInfo, car il n'est pas r\u00E9f\u00E9renc\u00E9 par l'\u00E9l\u00E9ment EncryptedKey.
BSP5426.encryptedkeyinfo = BSP 5426 : l''\u00E9l\u00E9ment KeyInfo, sous EncryptedKey ou EncryptedData, portant l''ID {0} doit contenir un \u00E9l\u00E9ment enfant SecurityTokenReference.
BSP5608.encrypteddata.refuri = BSP 5608 : l'\u00E9l\u00E9ment DataReference sous EncryptedData doit contenir un attribut d'URI comportant un attribut XPointer abr\u00E9g\u00E9.
BSP3006.encryptedkey.refuri =  BSP 3006 : l'\u00E9l\u00E9ment DataReference sous EncryptedKey doit contenir un attribut d'URI comportant un attribut XPointer abr\u00E9g\u00E9.

BSP5620.encrypteddata.uri = BSP 5620 : l'algorithme de cryptage des donn\u00E9es doit \u00EAtre "http://www.w3.org/2001/04/xmlenc#tripledes-cbc", "http://www.w3.org/2001/04/xmlenc#aes128-cbc" ou "http://www.w3.org/2001/04/xmlenc#aes256-cbc".
BSP5626.keyencryptionalgo = BSP 5626 : l'algorithme de cryptage de cl\u00E9 doit \u00EAtre "http://www.w3.org/2001/04/xmlenc#rsa-1_5", "http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p", "http://www.w3.org/2001/04/xmlenc#kw-tripledes", "http://www.w3.org/2001/04/xmlenc#kw-aes128" ou "http://www.w3.org/2001/04/xmlenc#kw-aes256".
BSP3057.str.not.ref.str = BSP 3057 : l'\u00E9l\u00E9ment Reference sous SecurityTokenReference ne doit pas r\u00E9f\u00E9rencer un autre \u00E9l\u00E9ment SecurityTokenReference.
BSP3064.str.not.ref.str.embedded = BSP 3064 : l'\u00E9l\u00E9ment Reference sous wsse:SecurityTokenReference ne doit pas r\u00E9f\u00E9rencer l'\u00E9l\u00E9ment wsse:Embedded, qui est l'\u00E9l\u00E9ment enfant d'un autre \u00E9l\u00E9ment wsse:SecurityTokenReference.
BSP3059.str.value.type = BSP 3059 : l'\u00E9l\u00E9ment Reference sous wsse:SecurityTokenReference doit comporter un attribut ValueType.
BSP3058.str.value.type.notempty = BSP 3058 : l'attribut ValueType de l'\u00E9l\u00E9ment Reference sous wsse:SecurityTokenReference doit indiquer une valeur.
BSP3062.str.uriattribute = BSP 3062 : l'\u00E9l\u00E9ment Reference sous wsse:SecurityTokenReference doit comporter un attribut d'URI.
BSP3027.str.key.name = BSP 3027 : l'\u00E9l\u00E9ment wsse:SecurityTokenReference ne doit pas contenir d'\u00E9l\u00E9ment KeyName en tant qu'\u00E9l\u00E9ment ds:KeyName.
BSP3028.str.keyidentifier = BSP 3028 : l'attribut ValueType de l'\u00E9l\u00E9ment wsse:SecurityTokenReference ne doit pas \u00EAtre vide.
BSP3071.str.encodingType = BSP 3071 : l'attribut EncodingType de l'\u00E9l\u00E9ment wsse:SecurityTokenReference doit avoir la valeur "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary".
BSP5204.str.internal.str.reference = BSP 5204 : l'\u00E9l\u00E9ment wsse:SecurityTokenReference d'un jeton de s\u00E9curit\u00E9 interne portant un attribut d'ID doit comporter un attribut d'URI avec une valeur XPointer abr\u00E9g\u00E9e.
BSP5416.signature_transform = BSP 5416 : une signature doit contenir un \u00E9l\u00E9ment enfant Transform.
BSP5423.signature_transform_algorithm = BSP 5423 : l'algorithme de transformation de signature doit avoir la valeur "http://www.w3.org/2001/10/xml-exc-c14n#", "http://www.w3.org/2002/06/xmldsig-filter2", "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#STR-Transform", "http://www.w3.org/2000/09/xmldsig#enveloped-signature", "http://docs.oasis-open.org/wss/oasis-wss-SwAProfile-1.1#Attachment-Content-Signature-Transform" ou "http://docs.oasis-open.org/wss/oasis-wss-SwAProfile-1.1#Attachment-Complete-Signature-Transform".
BSP5420.digest.method = BSP 5420 : l'algorithme Digest doit avoir la valeur "http://www.w3.org/2000/09/xmldsig#sha1".
BSP5421.signature.method = BSP5421 : la m\u00E9thode de signature doit avoir la valeur "http://www.w3.org/2000/09/xmldsig#hmac-sha1" ou "http://www.w3.org/2000/09/xmldsig#rsa-sha1".

#copied from impl-opt domain logger
WSS1601.ssl.not.enabled = WSS1601 : exigences de s\u00E9curit\u00E9 non respect\u00E9es ; le binding de transport est configur\u00E9 dans la strat\u00E9gie mais le message entrant n'est pas compatible SSL

#KerberosLogin
WSS1650.kerberos.key.warning = Le principal de service dans KerberosConfig {0} ne correspond pas \u00E0 l''\u00E9l\u00E9ment TargetName {1} de GSSContext
