#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes

#### Errors and exceptions (1-1000)
WSITPVD0001.problem.mar.unmar=WSITPVD001: JAXBContext\uC5D0\uC11C JAXB \uB9C8\uC15C\uB7EC/\uC5B8\uB9C8\uC15C\uB7EC\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uBB38\uC81C\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. JAXBcontext\uAC00 \uC62C\uBC14\uB974\uAC8C \uCD08\uAE30\uD654\uB418\uC5C8\uB294\uC9C0 \uD655\uC778\uD558\uC2ED\uC2DC\uC624.

WSITPVD0002.internal.server.error=WSITPVD0002: \uBCF4\uC548 \uC81C\uACF5\uC790: SOAPFault\uB97C \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0003.problem.printing.msg=WSITPVD003: SOAP \uBA54\uC2DC\uC9C0\uB97C \uC778\uC1C4\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4. \uBA54\uC2DC\uC9C0\uC758 XML \uD615\uC2DD \uC801\uD569\uC131 \uBB38\uC81C\uC77C \uC218 \uC788\uC2B5\uB2C8\uB2E4.

WSITPVD0004.opt.path.not.yet.supported=WSITPVD0004: \uCD5C\uC801\uD654\uB41C \uACBD\uB85C\uB294 \uC544\uC9C1 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSITPVD0005.problem.proc.soap.message=WSITPVD0005: \uBCF4\uC548 \uC81C\uACF5\uC790: JAXWS \uBA54\uC2DC\uC9C0\uB97C SAAJ SOAP \uBA54\uC2DC\uC9C0\uB85C \uBCC0\uD658\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0006.problem.init.out.proc.context=WSITPVD0006: \uBCF4\uC548 \uC81C\uACF5\uC790: \uC1A1\uC2E0 \uBCF4\uC548 \uCC98\uB9AC \uCEE8\uD14D\uC2A4\uD2B8\uB97C \uCD08\uAE30\uD654\uD558\uB294 \uC911 \uB0B4\uBD80 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0007.problem.getting.eff.boot.policy=WSITPVD0007: \uBCF4\uC548 \uC81C\uACF5\uC790: \uC720\uD6A8\uD55C SecureConversation \uBD80\uD2B8\uC2A4\uD2B8\uB7A9 \uC815\uCC45\uC744 \uAC00\uC838\uC624\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0008.problem.building.protocol.policy=WSITPVD0008: \uBCF4\uC548 \uC81C\uACF5\uC790: \uD504\uB85C\uD1A0\uCF5C \uBA54\uC2DC\uC9C0\uC5D0 \uB300\uD55C \uC720\uD6A8\uD55C \uBCF4\uC548 \uC815\uCC45\uC744 \uC0DD\uC131\uD558\uB824\uACE0 \uC2DC\uB3C4\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0009.unsupported.callback.type.encountered=WSITPVD0009: \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uB294 \uCF5C\uBC31 \uC720\uD615 {0}\uC774(\uAC00) \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0010.unknown.validator.type.config=WSITPVD0010: \uAD6C\uC131 \uAC80\uC99D\uC5D0 \uC54C \uC218 \uC5C6\uB294 \uAC80\uC99D\uAE30 \uC720\uD615 {0}\uC774(\uAC00) \uC788\uC2B5\uB2C8\uB2E4.

WSITPVD0011.could.not.find.user.class=WSITPVD0011: \uC0AC\uC6A9\uC790 \uD074\uB798\uC2A4\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC74C: {0}.

WSITPVD0012.problem.checking.reliable.message.enable=WSITPVD0012: \uB0B4\uBD80 \uC624\uB958: Reliable Messaging\uC774 \uC0AC\uC6A9\uC73C\uB85C \uC124\uC815\uB418\uC5C8\uB294\uC9C0 \uC5EC\uBD80\uB97C \uAC10\uC9C0\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSITPVD0013.sec.policy.not.configured=WSITPVD0013: {0} \uC791\uC5C5\uC5D0 \uB300\uD574 SecurityPolicy\uAC00 \uAD6C\uC131\uB418\uC9C0 \uC54A\uC558\uC9C0\uB9CC SecurityHeader\uAC00 \uBC1C\uACAC\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0014.keystore.url.null.config.assertion=WSITPVD0014: ConfigAssertion\uC5D0\uC11C KeyStore URL\uC744 NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0015.keystore.password.null.config.assertion=WSITPVD0015: ConfigAssertion\uC5D0\uC11C KeyStore \uBE44\uBC00\uBC88\uD638\uB97C NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0016.truststore.url.null.config.assertion=WSITPVD0016: ConfigAssertion\uC5D0\uC11C TrustStore URL\uC744 NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0017.truststore.password.null.config.assertion=WSITPVD0017: ConfigAssertion\uC5D0\uC11C TrustStore \uBE44\uBC00\uBC88\uD638\uB97C NULL\uB85C \uC5BB\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0018.null.or.empty.xwss.callback.handler.classname=WSITPVD0018: xwssCallbackHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0019.null.or.empty.username.handler.classname=WSITPVD0019: usernameHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0020.null.or.empty.password.handler.classname=WSITPVD0020: passwordHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0021.null.or.empty.saml.handler.classname=WSITPVD0021: samlHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

# {0} - validator name
WSITPVD0022.null.or.empty.validator.classname=WSITPVD0022: {0}\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC80\uC99D\uAE30 \uD074\uB798\uC2A4 \uC774\uB984\uC774 \uC124\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.

WSITPVD0023.could.not.load.callback.handler.class=WSITPVD0023: \uB0B4\uBD80 \uC624\uB958: CallbackHandler \uD074\uB798\uC2A4\uB97C \uB85C\uB4DC\uD560 \uC218 \uC5C6\uC74C: {0}.

WSITPVD0024.null.client.auth.context=WSITPVD0024: \uC624\uB958: \uD074\uB77C\uC774\uC5B8\uD2B8 \uC778\uC99D \uCEE8\uD14D\uC2A4\uD2B8\uAC00 \uCD08\uAE30\uD654\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.

WSITPVD0025.null.packet=WSITPVD0025: \uB0B4\uBD80 \uC624\uB958: \uBCF4\uC548 \uC138\uC158 \uC2DC\uC791\uC5D0 \uD544\uC694\uD55C \uD328\uD0B7\uC774 getAuthContext()\uC5D0 \uC81C\uACF5\uB418\uC9C0 \uC54A\uC558\uC2B5\uB2C8\uB2E4.

WSITPVD0026.error.starting.sc=WSITPVD0026: SecureConversation\uC744 \uC2DC\uC791\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

# ACC = Application Client Container.
WSITPVD0027.error.populating.client.config.prop=WSITPVD0027: ACC \uD074\uB77C\uC774\uC5B8\uD2B8 \uB610\uB294 WebClient\uC5D0 \uB300\uD55C \uBCF4\uC548 \uAD6C\uC131 \uC18D\uC131\uC744 \uCC44\uC6B0\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0028.error.init.auth.module=WSITPVD0028: \uC778\uC99D \uBAA8\uB4C8\uC744 \uCD08\uAE30\uD654\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0029.error.securing.outbound.msg=WSITPVD0029: \uC544\uC6C3\uBC14\uC6B4\uB4DC \uBA54\uC2DC\uC9C0\uB97C \uBCF4\uC548\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0030.no.policy.found.for.sc=WSITPVD0030: SecureConversation\uC744 \uC2DC\uC791\uD560 \uC218 \uC5C6\uC74C - SecureConversation \uAC80\uC99D\uC744 \uC815\uCC45\uC5D0\uC11C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.

WSITPVD0031.invalid.callback.handler.class=WSITPVD0031: \uC9C0\uC815\uB41C CallbackHandler \uD074\uB798\uC2A4 {0}\uC740(\uB294) \uC801\uD569\uD55C javax.security.auth.callback.CallbackHandler\uAC00 \uC544\uB2D9\uB2C8\uB2E4.

WSITPVD0032.error.configure.client.handler=WSITPVD0032: \uD074\uB77C\uC774\uC5B8\uD2B8 \uCF5C\uBC31 \uCC98\uB9AC\uAE30\uB97C \uAD6C\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0033.error.validate.response=WSITPVD0033: \uBCF4\uC548 \uC751\uB2F5 \uBA54\uC2DC\uC9C0\uB97C \uAC80\uC99D\uD558\uB294 \uC911 SOAP \uC608\uC678 \uC0AC\uD56D\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0034.faulty.response.msg=WSITPVD0034: \uAC80\uC99D \uC911 \uC624\uB958\uAC00 \uC788\uB294 \uC751\uB2F5 \uBA54\uC2DC\uC9C0: {0}.

WSITPVD0035.error.verify.inbound.msg=WSITPVD0035: \uC778\uBC14\uC6B4\uB4DC \uBA54\uC2DC\uC9C0\uC5D0\uC11C \uBCF4\uC548\uC744 \uD655\uC778\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0036.error.proc.req.packet=WSITPVD0036: \uBCF4\uC548 \uCEE8\uBC84\uC138\uC774\uC158 \uC2DC\uC791 \uC2DC \uC694\uCCAD \uD328\uD0B7\uC744 \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0037.null.subject=WSITPVD0037: \uC8FC\uCCB4\uB97C \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958 \uBC1C\uC0DD: \uC8FC\uCCB4\uC758 \uAC12\uC774 \uB110\uC785\uB2C8\uB2E4.

WSITPVD0038.error.creating.new.instance.wsit.client.sec.pipe=WSITPVD0038: WSIT \uD074\uB77C\uC774\uC5B8\uD2B8 \uBCF4\uC548 \uC81C\uACF5\uC790\uC758 \uC0C8 \uC778\uC2A4\uD134\uC2A4\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0039.error.processing.incoming.packet=WSITPVD0039: WSIT \uD074\uB77C\uC774\uC5B8\uD2B8\uC5D0\uC11C \uC218\uC2E0 \uD328\uD0B7\uC744 \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0040.error.clean.subject =WSITPVD0040: \uD074\uB77C\uC774\uC5B8\uD2B8 \uC778\uC99D \uCEE8\uD14D\uC2A4\uD2B8\uC5D0\uC11C \uC8FC\uCCB4\uB97C \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958 \uBC1C\uC0DD: \uC8FC\uCCB4\uC758 \uAC12\uC774 \uB110\uC785\uB2C8\uB2E4.

#WSITPVD0041.error.verify.inbound.msg=WSITPVD0041: Error in Verifying Security in Inbound Message.

#WSITPVD0042.error.securing.outbound.msg=WSITPVD0042: Error in Securing Outbound Message.

WSITPVD0043.error.configure.server.handler=WSITPVD0043: \uC11C\uBC84 \uBCF4\uC548 \uCF5C\uBC31 \uCC98\uB9AC\uAE30\uB97C \uAD6C\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

# RST = Request Security Token. SCT = Security Context Token.
WSITPVD0044.error.session.creation=WSITPVD0044: RST-SCT \uBC1C\uD589 \uC694\uCCAD\uC73C\uB85C \uBCF4\uC548 \uC138\uC158 \uC0DD\uC131\uC744 \uC2E4\uD328\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0045.unsupported.operation.exception=WSITPVD0045: RequestType {0}\uC740(\uB294) \uBCF4\uC548 \uC694\uCCAD \uC0DD\uC131\uC5D0 \uC9C0\uC6D0\uB418\uC9C0 \uC54A\uC2B5\uB2C8\uB2E4.

WSITPVD0046.error.invoke.sc.contract=WSITPVD0046: \uBCF4\uC548 \uCEE8\uBC84\uC138\uC774\uC158 \uACC4\uC57D\uC744 \uD638\uCD9C\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0047.error.creating.new.instance.wsit.server.sec.pipe=WSITPVD0038: WSIT \uC11C\uBC84 \uBCF4\uC548 \uC81C\uACF5\uC790\uC758 \uC0C8 \uC778\uC2A4\uD134\uC2A4\uB97C \uC0DD\uC131\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0048.error.populating.server.config.prop=WSITPVD0048: \uBCF4\uC548 \uC81C\uACF5\uC790: \uC6F9 \uC11C\uBE44\uC2A4\uC5D0 \uB300\uD55C \uBCF4\uC548 \uAD6C\uC131 \uC18D\uC131\uC744 \uCC44\uC6B0\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0049.error.cancel.security.context.token=WSITPVD0049: \uBCF4\uC548 \uCEE8\uD14D\uC2A4\uD2B8 \uD1A0\uD070\uC744 \uCDE8\uC18C\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.

WSITPVD0050.error.secure.request=WSITPVD0050: \uC694\uCCAD \uBA54\uC2DC\uC9C0\uB97C \uBCF4\uC548\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0051.null.or.empty.jmac.callback.handler.classname=WSITPVD0051: jmacCallbackHandler \uD074\uB798\uC2A4 \uC774\uB984\uC5D0 \uB300\uD574 \uB110 \uB610\uB294 \uBE48 \uAC12\uC774 \uC9C0\uC815\uB418\uC5C8\uC2B5\uB2C8\uB2E4.
WSITPVD0052.error.issuedtoken.creation=WSITPVD0052: IssuedToken \uC0DD\uC131 \uC911 \uC608\uC678 \uC0AC\uD56D\uC744 \uC218\uC2E0\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0053.error.validate.request=WSITPVD0053: \uC694\uCCAD\uC744 \uAC80\uC99D\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0054.error.secure.response=WSITPVD0054: \uC751\uB2F5\uC744 \uBCF4\uC548\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0055.ws.error.next.pipe=WSSPVD0055: \uB2E4\uC74C \uD30C\uC774\uD504 \uCC98\uB9AC \uC911 ws.error
WSITPVD0056.null.response=WSITPVD0056: \uC11C\uBE44\uC2A4 \uD638\uCD9C\uC5D0\uC11C \uB110 \uC751\uB2F5 \uD328\uD0B7\uC744 \uBC18\uD658\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0057.error.process.response=WSITPVD0057: \uC751\uB2F5\uC744 \uCC98\uB9AC\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0058.error.secure.request=WSITPVD0058: \uC694\uCCAD\uC744 \uBCF4\uC548\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0059.jmac.factory.cannot.write.file=WSITPVD0059: jmac \uD329\uD1A0\uB9AC\uAC00 \uD30C\uC77C \uC624\uB958\uB97C \uC4F8 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
WSITPVD0060.jmac.jmac.factory.unableto.load.provider=WSITPVD0060: jmac \uD329\uD1A0\uB9AC\uAC00 {0} \uC81C\uACF5\uC790\uB97C \uB85C\uB4DC\uD560 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
WSITPVD0061.jmac.authconfig.loader.failure=WSITPVD0061: jmac \uC778\uC99D \uAD6C\uC131 \uB85C\uB354 \uC2E4\uD328
WSITPVD0062.error.load.default.providers=WSITPVD0062: \uAE30\uBCF8 \uC81C\uACF5\uC790\uB97C \uB85C\uB4DC\uD558\uB294 \uC911 \uC608\uC678 \uC0AC\uD56D\uC774 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0064.error.clean.subject=WSITPVD0064: \uC8FC\uCCB4\uB97C \uC815\uB9AC\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0065.error.resolving.alternatives=WSSPVD0065: \uB300\uC548\uC758 \uC624\uB958 \uC815\uCC45\uC744 \uBD84\uC11D\uD558\uB294 \uC911 \uC624\uB958\uAC00 \uBC1C\uC0DD\uD588\uC2B5\uB2C8\uB2E4.
WSITPVD0066.servlet.context.notfound=WSSPVD0066: ServletContext\uB97C \uCC3E\uC744 \uC218 \uC5C6\uC2B5\uB2C8\uB2E4.
#### Info, Fine and Warning messages ####
#### Codes starting from 1000+


