#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes

#### Errors and exceptions (1-1000)
WSITPVD0001.problem.mar.unmar=WSITPVD001: problema ao criar marshaller/unmarshaller do JAXB de JAXBContext. Verifique se JAXBcontext foi inicializado corretamente.

WSITPVD0002.internal.server.error=WSITPVD0002: provedor de Seguran\u00E7a: Erro Interno ao tentar criar um SOAPFault.

WSITPVD0003.problem.printing.msg=WSITPVD003: ocorreu um erro ao tentar imprimir a Mensagem SOAP. Pode ser um problema na m\u00E1 forma\u00E7\u00E3o do XML na mensagem.

WSITPVD0004.opt.path.not.yet.supported=WSITPVD0004: caminho otimizado ainda n\u00E3o suportado.

WSITPVD0005.problem.proc.soap.message=WSITPVD0005: provedor de Seguran\u00E7a: erro ao converter a mensagem JAXWS para a Mensagem SAAJ SOAP.

WSITPVD0006.problem.init.out.proc.context=WSITPVD0006: provedor de Seguran\u00E7a: ocorreu um Erro Interno ao inicializar o Contexto de Processamento de Seguran\u00E7a de Sa\u00EDda.

WSITPVD0007.problem.getting.eff.boot.policy=WSITPVD0007: provedor de Seguran\u00E7a: ocorreu um Erro ao tentar obter a pol\u00EDtica de Bootstrap SecureConversation Efetiva.

WSITPVD0008.problem.building.protocol.policy=WSITPVD0008: provedor de Seguran\u00E7a: ocorreu um erro ao tentar criar a Pol\u00EDtica de Seguran\u00E7a Efetiva para a Mensagem de Protocolo.

WSITPVD0009.unsupported.callback.type.encountered=WSITPVD0009: foi detectado um tipo de callback {0} n\u00E3o suportado.

WSITPVD0010.unknown.validator.type.config=WSITPVD0010: tipo de Validador {0} desconhecido na Asser\u00E7\u00E3o de configura\u00E7\u00E3o.

WSITPVD0011.could.not.find.user.class=WSITPVD0011: n\u00E3o foi poss\u00EDvel localizar a Classe: {0} do Usu\u00E1rio.

WSITPVD0012.problem.checking.reliable.message.enable=WSITPVD0012: Erro Interno: n\u00E3o foi poss\u00EDvel detectar se a Mensagem Confi\u00E1vel est\u00E1 ou n\u00E3o ativada.

WSITPVD0013.sec.policy.not.configured=WSITPVD0013: SecurityPolicy n\u00E3o configurado para a opera\u00E7\u00E3o {0}, mas SecurityHeader foi encontrado.

WSITPVD0014.keystore.url.null.config.assertion=WSITPVD0014: o URL da \u00C1rea de Armazenamento de Chaves foi obtido como NULL de ConfigAssertion.

WSITPVD0015.keystore.password.null.config.assertion=WSITPVD0015: a Senha da \u00C1rea de Armazenamento de Chaves foi obtida como NULL de ConfigAssertion.

WSITPVD0016.truststore.url.null.config.assertion=WSITPVD0014: o URL da \u00C1rea de Armazenamento Confi\u00E1vel foi obtido como NULL de ConfigAssertion.

WSITPVD0017.truststore.password.null.config.assertion=WSITPVD0017: a Senha da \u00C1rea de Armazenamento Confi\u00E1vel foi obtida como NULL de ConfigAssertion.

WSITPVD0018.null.or.empty.xwss.callback.handler.classname=WSITPVD0018: valor Nulo ou vazio especificado para o nome da classe xwssCallbackHandler.

WSITPVD0019.null.or.empty.username.handler.classname=WSITPVD0019: valor Nulo ou vazio especificado para o nome da classe usernameHandler.

WSITPVD0020.null.or.empty.password.handler.classname=WSITPVD0020: valor Nulo ou vazio especificado para o nome da classe passwordHandler.

WSITPVD0021.null.or.empty.saml.handler.classname=WSITPVD0021: valor Nulo ou vazio especificado para o nome da classe samlHandler

# {0} - validator name
WSITPVD0022.null.or.empty.validator.classname=WSITPVD0022: nome de classe do Validador Nulo ou Vazio definido para {0}

WSITPVD0023.could.not.load.callback.handler.class=WSITPVD0023: Erro Interno: n\u00E3o foi poss\u00EDvel carregar a Classe de CallbackHandler: {0}.

WSITPVD0024.null.client.auth.context=WSITPVD0024: erro: o Contexto de Autentica\u00E7\u00E3o do Cliente n\u00E3o foi Inicializado.

WSITPVD0025.null.packet=WSITPVD0025: Erro Interno: um Pacote obrigat\u00F3rio para iniciar uma sess\u00E3o segura n\u00E3o foi fornecido para getAuthContext().

WSITPVD0026.error.starting.sc=WSITPVD0026: erro ao iniciar SecureConversation.

# ACC = Application Client Container.
WSITPVD0027.error.populating.client.config.prop=WSITPVD0027: erro ao preencher as propriedades de configura\u00E7\u00E3o de Seguran\u00E7a de um cliente ACC ou um WebClient.

WSITPVD0028.error.init.auth.module=WSITPVD0028: erro ao inicializar o M\u00F3dulo de Autentica\u00E7\u00E3o.

WSITPVD0029.error.securing.outbound.msg=WSITPVD0029: erro ao Proteger a Mensagem de Sa\u00EDda.

WSITPVD0030.no.policy.found.for.sc=WSITPVD0030: n\u00E3o \u00E9 poss\u00EDvel iniciar SecureConversation, nenhuma Asser\u00E7\u00E3o de SecureConversation encontrada na Pol\u00EDtica.

WSITPVD0031.invalid.callback.handler.class=WSITPVD0031: a classe: {0} de CallbackHandler n\u00E3o \u00E9 um javax.security.auth.callback.CallbackHandler v\u00E1lido

WSITPVD0032.error.configure.client.handler=WSITPVD0032: erro ao configurar o Handler de Callback do Cliente.

WSITPVD0033.error.validate.response=WSITPVD0033: exce\u00E7\u00E3o SOAP ao validar a Mensagem de Resposta Segura.

WSITPVD0034.faulty.response.msg=WSITPVD0034: mensagem de resposta com falha ao validar : {0}.

WSITPVD0035.error.verify.inbound.msg=WSITPVD0035: erro em Verifica\u00E7\u00E3o de Seguran\u00E7a na Mensagem de Entrada.

WSITPVD0036.error.proc.req.packet=WSITPVD0036: erro ao processar o pacote de solicita\u00E7\u00F5es ao iniciar a conversa segura.

WSITPVD0037.null.subject=WSITPVD0037: erro ao descartar o Assunto: valor nulo do Assunto.

WSITPVD0038.error.creating.new.instance.wsit.client.sec.pipe=WSITPVD0038: erro ao criar a nova inst\u00E2ncia do Provedor de Seguran\u00E7a do Cliente WSIT.

WSITPVD0039.error.processing.incoming.packet=WSITPVD0039: erro ao processar o Pacote de entrada no Cliente WSIT.

WSITPVD0040.error.clean.subject =WSITPVD0040: erro ao descartar o assunto do descarte de contexto de autentica\u00E7\u00E3o do cliente. Assunto: valor nulo para Assunto.

#WSITPVD0041.error.verify.inbound.msg=WSITPVD0041: Error in Verifying Security in Inbound Message.

#WSITPVD0042.error.securing.outbound.msg=WSITPVD0042: Error in Securing Outbound Message.

WSITPVD0043.error.configure.server.handler=WSITPVD0043: erro ao configurar o Handler de Callback de Seguran\u00E7a do Servidor.

# RST = Request Security Token. SCT = Security Context Token.
WSITPVD0044.error.session.creation=WSITPVD0044: falha ao criar uma Sess\u00E3o Segura com a Solicita\u00E7\u00E3o de Emiss\u00E3o RST-SCT.

WSITPVD0045.unsupported.operation.exception=WSITPVD0045: RequestType : {0} n\u00E3o suportado para criar uma Sess\u00E3o Segura.

WSITPVD0046.error.invoke.sc.contract=WSITPVD0046: erro ao chamar o Contrato de Conversa Segura.

WSITPVD0047.error.creating.new.instance.wsit.server.sec.pipe=WSITPVD0038: erro ao criar a nova inst\u00E2ncia do Provedor de Seguran\u00E7a do Servidor WSIT.

WSITPVD0048.error.populating.server.config.prop=WSITPVD0048: provedor de Seguran\u00E7a. Erro ao preencher as propriedades de configura\u00E7\u00E3o de Seguran\u00E7a do Web Service.

WSITPVD0049.error.cancel.security.context.token=WSITPVD0049: erro ao cancelar o Token de Contexto de Seguran\u00E7a.

WSITPVD0050.error.secure.request=WSITPVD0050: erro ao Proteger a Mensagem da Solicita\u00E7\u00E3o.
WSITPVD0051.null.or.empty.jmac.callback.handler.classname=WSITPVD0051: Valor Vazio ou Nulo especificado para o nome da classe jmacCallbackHandler.
WSITPVD0052.error.issuedtoken.creation=WSITPVD0052: exce\u00E7\u00E3o Recebida durante a Cria\u00E7\u00E3o de IssuedToken.
WSITPVD0053.error.validate.request=WSITPVD0053: erro ao validar a solicita\u00E7\u00E3o
WSITPVD0054.error.secure.response=WSITPVD0054: erro ao proteger a resposta
WSITPVD0055.ws.error.next.pipe=WSSPVD0055: ws.error ao processar o pr\u00F3ximo pipe
WSITPVD0056.null.response=WSITPVD0056: a chamada de Servi\u00E7o retornou pacote de resposta nulo
WSITPVD0057.error.process.response=WSITPVD0057: erro ao processar a resposta
WSITPVD0058.error.secure.request=WSITPVD0058: erro ao proteger a solicita\u00E7\u00E3o
WSITPVD0059.jmac.factory.cannot.write.file=WSITPVD0059: a factory de jmac n\u00E3o pode gravar o erro do arquivo
WSITPVD0060.jmac.jmac.factory.unableto.load.provider=WSITPVD0060: a factory de jmac factory n\u00E3o pode carregar o provedor {0}
WSITPVD0061.jmac.authconfig.loader.failure=WSITPVD0061: falha no carregador da configura\u00E7\u00E3o de autoriza\u00E7\u00E3o de jmac
WSITPVD0062.error.load.default.providers=WSITPVD0062: exce\u00E7\u00E3o durante o carregamento dos provedores default
WSITPVD0064.error.clean.subject=WSITPVD0064: erro durante a limpeza do Assunto
WSITPVD0065.error.resolving.alternatives=WSSPVD0065: erro ao resolver a pol\u00EDtica de falhas da alternativa
WSITPVD0066.servlet.context.notfound=WSSPVD0066: ServletContext n\u00E3o encontrado
#### Info, Fine and Warning messages ####
#### Codes starting from 1000+


