#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

# policy / config
WSRM1001_ASSERTION_NOT_COMPATIBLE_WITH_RM_VERSION = WSRM1001: la afirmaci\u00F3n [ {0} ] no es compatible con la versi\u00F3n de WS-RM [ {1} ]
WSRM1002_MULTIPLE_WSRM_VERSIONS_IN_POLICY=WSRM1002: se han especificado varias versiones de la pol\u00EDtica WS-ReliableMessaging en una sola alternativa de pol\u00EDtica.
WSRM1003_MUTLIPLE_DA_TYPES_IN_POLICY=WSRM1003: pol\u00EDtica de RM inconsistente. Se han especificado varios tipos de control de entrega.
WSRM1004_EXPECTED_DA_NOT_SPECIFIED_IN_POLICY=WSRM1004: pol\u00EDtica de RM inconsistente. No se ha especificado el control de entrega esperado en la afirmaci\u00F3n de RM1.1.
WSRM1005_MULTIPLE_SECURITY_BINDINGS_IN_POLICY=WSRM1005: pol\u00EDtica de RM inconsistente. Se han especificado varios tipos de enlace de seguridad.
WSRM1006_MULTIPLE_BUFFER_SIZES_IN_POLICY=WSRM1006: pol\u00EDtica de RM inconsistente. Se han especificado varios tama\u00F1os de buffer de control de flujo.
WSRM1007_MULTIPLE_OCCURENCES_OF_ASSERTION_PARAMETER=WSRM1007: se han detectado varias incidencias del par\u00E1metro de afirmaci\u00F3n [ {0} ] en la afirmaci\u00F3n de la pol\u00EDtica [ {1} ]
# {0} - number, {1} - qname
WSRM1008_DUPLICATE_ASSERTION_IN_POLICY=WSMC0008: se han detectado {0} afirmaciones de pol\u00EDticas duplicadas [ {1} ] en una sola alternativa de pol\u00EDtica
WSRM1009_INCONSISTENCIES_IN_POLICY=WSRM1009: se ha detectado una inconsistencia en la expresi\u00F3n de WS-Policy:\n La afirmaci\u00F3n [ {0} ] no es compatible con la versi\u00F3n de WS-ReliableMessaging [ {1} ].\n Actualice la expresi\u00F3n de WS-Policy sustituyendo la afirmaci\u00F3n actual por afirmaciones compatibles con la versi\u00F3n de WS-ReliableMessaging utilizada. Tenga en cuenta que en una versi\u00F3n de Metro futura se podr\u00EDa decidir rechazar ese tipo de pol\u00EDticas inconsistentes y no se desplegar\u00EDa el servicio web.

# runtime
WSRM1101_UNSUPPORTED_OPERATION=WSRM1101: esta operaci\u00F3n no est\u00E1 soportada en la implantaci\u00F3n de [ {0} ]
WSRM1102_RESENDING_DROPPED_MESSAGE=WSRM1102: volviendo a enviar el mensaje borrado
WSRM1103_RM_SEQUENCE_NOT_TERMINATED_NORMALLY=WSRM1103: no se ha podido terminar la secuencia de RM de la manera normal debido a una excepci\u00F3n inesperada
WSRM1104_RM_VERSION_NOT_SUPPORTED=WSRM1104: versi\u00F3n de WS-ReliableMessaging no soportada [ {0} ]
WSRM1105_SEQUENCE_ID_NOT_RECOGNIZED=WSRM1105: el identificador de secuencia de la cabecera del mensaje [ {0} ] no coincide con el identificador de secuencia esperado para esta sesi\u00F3n [ {1} ]
WSRM1106_SENDING_RM_SESSION_CONTROL_MESSAGE_FAILED=WSRM1106: fallo al intentar enviar un mensaje de control de sesi\u00F3n de RM [ {0} ] con una excepci\u00F3n
WSRM1107_MAX_RM_SESSION_INIT_ATTEMPTS_REACHED=WSRM1107: no se ha podido iniciar la sesi\u00F3n de RM. Se ha alcanzado el n\u00FAmero m\u00E1ximo de intentos de iniciar la sesi\u00F3n de RM
WSRM1108_NULL_RESPONSE_FOR_ACK_REQUEST=WSRM1108: la respuesta a la solicitud de confirmaci\u00F3n es 'null'
WSRM1109_SOAP_FAULT_RESPONSE_FOR_ACK_REQUEST=WSRM1109: la solicitud de confirmaci\u00F3n ha finalizado en un fallo de SOAP
WSRM1110_ACK_REQUEST_FAILED=WSRM1110: fallo de la solicitud de confirmaci\u00F3n
WSRM1111_WAITING_FOR_SEQ_ACKS_UNEXPECTED_EXCEPTION=WSRM1111: se ha producido una excepci\u00F3n inesperada al esperar las confirmaciones de los mensajes en una secuencia [ {0} ]
WSRM1112_WAITING_FOR_SEQ_ACKS_TIMED_OUT=WSRM1112: las confirmaciones de mensajes de una secuencia [ {0} ] han sobrepasado el tiempo de espera despu\u00E9s de {1} milisegundos.
WSRM1113_WAITING_FOR_SEQ_ACKS_INTERRUPTED=WSRM1113: la espera de las confirmaciones de mensajes de una secuencia [ {0} ] se ha interrumpido
WSRM1114_NULL_RESPONSE_ON_PROTOCOL_MESSAGE_REQUEST=WSRM1114: la respuesta al mensaje de solicitud {0} es ''null''
WSRM1115_PROTOCOL_MESSAGE_REQUEST_REFUSED=WSRM1115: {0} ha sido rechazado por RMDestination
WSRM1116_ACKS_TO_NOT_EQUAL_TO_ENDPOINT_DESTINATION=WSRM1116: destino "AcksTo" no soportado. El destino "AcksTo" de la secuencia entrante [ {0} ] debe ser igual que el destino del punto final del servicio [ {1} ]
WSRM1117_UNEXPECTED_SEQUENCE_ID_IN_TERMINATE_SR=WSRM1117: el identificador de secuencia del mensaje de respuesta de la secuencia de terminaci\u00F3n [ {0} ] no se corresponde con el identificador de secuencia saliente de terminaci\u00F3n [ {1} ]
WSRM1118_MANDATORY_HEADER_NOT_PRESENT=WSRM1118: la cabecera {0} obligatoria no se encuentra en el mensaje de respuesta
WSRM1119_UNEXPECTED_SEQUENCE_ID_IN_CLOSE_SR=WSRM1119: el identificador de secuencia del mensaje de respuesta de la secuencia de cierre [ {0} ] no se corresponde con el identificador de secuencia saliente de cierre [ {1} ]
WSRM1120_RESPONSE_NOT_IDENTIFIED_AS_PROTOCOL_MESSAGE=WSRM1120: no se ha podido procesar el paquete de respuesta. El paquete no se ha identificado como un mensaje del protocolo RM
WSRM1121_SECURE_CONVERSATION_INIT_FAILED=WSRM1121: no se ha podido iniciar la conversaci\u00F3n segura
WSRM1122_ERROR_MARSHALLING_RM_HEADER=WSRM1122: no se ha podido anular la canalizaci\u00F3n de la cabecera de RM [ {0} ]
WSRM1123_ERROR_UNMARSHALLING_MESSAGE=WSRM1123: no se ha podido anular la canalizaci\u00F3n de un mensaje
WSRM1124_NO_SUCH_SEQUENCE_ID_REGISTERED=WSRM1124: no se ha registrado ninguna secuencia con el identificador [ {0} ]
WSRM1125_ILLEGAL_MESSAGE_ID=WSRM1125: "No se ha encontrado el n\u00FAmero de mensaje [ {1} ] entre los n\u00FAmeros de mensaje no confirmados de una secuencia [ {0} ]."
WSRM1126_DUPLICATE_SEQUENCE_ID=WSRM1126: la secuencia con el identificador [ {0} ] ya est\u00E1 registrada.
WSRM1127_UNEXPECTED_EXCEPTION_WHEN_SENDING_ACK_REQUEST=WSRM1127: se ha producido una excepci\u00F3n inesperada al enviar la solicitud de confirmaci\u00F3n
# {0} - "CreateSequence"/"CloseSequence"/"TerminateSequence" (types of messages)
WSRM1128_MAX_RM_SESSION_CONTROL_MESSAGE_RESEND_ATTEMPTS_REACHED="WSRM1128: Fallo al enviar un mensaje de control de sesiones de RM [ {0} ]. Se ha alcanzado el n\u00FAmero m\u00E1ximo de intentos de reenv\u00EDo."
WSRM1129_INVALID_VALUE_OF_MESSAGE_HEADER=WSRM1129: El valor de la cabecera de "{0}" no es v\u00E1lido en el mensaje "{1}": [ {2} ]
WSRM1130_MISSING_MESSAGE_HEADER=WSRM1130: Falta la cabecera "{0}" en el mensaje "{1}": [ {2} ]
WSRM1131_SECURITY_TOKEN_AUTHORIZATION_ERROR=WSRM1131: error de SecurityToken Authorization. Se ha obtenido {0}, pero se esperaba {1}
WSRM1132_SECURITY_REFERENCE_ERROR=WSRM1132: no se puede manejar la referencia desde la referencia de SecurityToken. Nombre de clase {0}
WSRM1133_NO_SECURITY_TOKEN_IN_REQUEST_PACKET=WSRM1133: no se ha encontrado ning\u00FAn token de seguridad en el paquete de solicitud
WSRM1134_UNSUPPORTED_PROTOCOL_MESSAGE=WSRM1134: Error interno: No se ha implantado el procesamiento del mensaje del protocolo RM para la acci\u00F3n WS-Addressing [ {0} ]
WSRM1135_WRONG_SEQUENCE_STATE_ACKNOWLEDGEMENT_REJECTED=WSRM1135: la secuencia [ {0} ] est\u00E1 en el estado [ {1} ] y no acepta m\u00E1s confirmaciones
WSRM1136_WRONG_SEQUENCE_STATE_MESSAGE_REGISTRATION=WSRM1136: la secuencia [ {0} ] est\u00E1 en el estado [ {1} ] y no est\u00E1 preparada para registrar mensajes
WSRM1137_OFFERED_ID_ALREADY_IN_USE=WSRM1137: el identificador de secuencia ofrecido [ {0} ] ya se est\u00E1 utilizando
WSRM1138_MESSAGE_NUMBER_ROLLOVER=WSRM1138: se ha excedido el valor m\u00E1ximo para un n\u00FAmero de mensaje en una secuencia [ {0} ]: {1}
WSRM1139_NO_OUTBOUND_SEQUENCE_FOR_RESPONSE=WSRM1139: no se ha podido enviar la respuesta de manera fiable. No hay ninguna secuencia saliente enlazada a una secuencia entrante [ {0} ]
WSRM1140_NO_ADDRESSING_VERSION_ON_ENDPOINT=WSRM1140: WS-Addressing no est\u00E1 activado en el punto final del servicio. Para poder utilizar WS-ReliableMessaging, debe activar tambi\u00E9n la funci\u00F3n de WS-Addressing.
WSRM1141_UNEXPECTED_MESSAGE_CLASS=WSRM1141: clase de mensaje inesperada [ {0} ]; se esperaba la clase [ {1} ]
WSRM1142_ERROR_CREATING_HA_BACKING_STORE=WSRM1142: no se ha podido crear el almac\u00E9n de copia de seguridad de HA [ {0} ].
#WSRM1143_=WSRM1143:
#WSRM1144_=WSRM1144: 
WSRM1145_DUPLICATE_MSG_NUMBER_RECEIVED=WSRM1145: se ha recibido un n\u00FAmero de mensaje duplicado [ {0} ] en la secuencia [ {1} ]
WSRM1146_UNEXPECTED_ERROR_WHILE_REGISTERING_MESSAGE=WSRM1146: excepci\u00F3n inesperada al registrar el mensaje
WSRM1147_ADDING_MSG_TO_QUEUE_INTERRUPTED=WSRM1147: se ha interrumpido la operaci\u00F3n de adici\u00F3n de un mensaje a una cola de mensajes interna
WSRM1148_DUPLICATE_MSG_NUMBER_REGISTRATION_ATTEMPTED=WSRM1148: se ha detectado un intento de registrar un n\u00FAmero de mensaje duplicado [ {0} ] en la secuencia [ {1} ]
WSRM1149_DIFFERENT_MSG_SEQUENCE_ID=WSRM1149: No se puede registrar el mensaje: el identificador de secuencia del mensaje de la aplicaci\u00F3n [ {0} ] es diferente al identificador de esta secuencia [ {1} ]
WSRM1150_UNABLE_TO_RESCHEDULE_SEQUENCE_MAINTENANCE_TASK=WSRM1150: no se ha podido volver a programar la tarea de mantenimiento de secuencias para un UID de punto final [ {0} ]
WSRM1151_TERMINATING_SEQUENCE_MAINTENANCE_TASK=WSRM1151: Terminando la tarea de mantenimiento de secuencias para un UID de punto final [ {0} ]: se ha recolectado la basura de la instancia del gestor de secuencias
WSRM1152_REMOVING_SEQUENCE=WSRM1152: eliminando la secuencia [ {0} ]
WSRM1153_TERMINATING_SEQUENCE=WSRM1153: terminando la secuencia [ {0} ]
WSRM1154_UNEXPECTED_CLASS_OF_JNDI_BOUND_OBJECT=WSRM1154: el objeto de la clase [ {0} ] enlazado en el JNDI bajo [ {1} ] no es una instancia de [ {2} ]
WSRM1155_RM_JDBC_CONNECTION_POOL_NOT_FOUND=WSRM1155: No se ha podido buscar el pool de conexiones JDBC de mensajes fiables de Metro
WSRM1156_MAX_CONCURRENT_SESSIONS_REACHED=WSRM1156: no se ha podido crear una nueva secuencia de mensajes fiables. Se ha alcanzado el n\u00FAmero m\u00E1ximo ( {0} ) de sesiones de mensajes fiables abiertas de manera simult\u00E1nea.
WSRM1157_WAITING_FOR_SEQ_STATE_CHANGE_TIMED_OUT=WSRM1157: se ha superado el tiempo de espera del cambio de estado de secuencia [ {0} ] a [ {1} ] despu\u00E9s de {2} milisegundos
WSRM1158_WAITING_FOR_SEQ_STATE_CHANGE_INTERRUPTED=WSRM1158: se ha interrumpido la espera del cambio de estado de secuencia [ {0} ] a [ {1} ]
WSRM1159_MAX_MESSAGE_RESEND_ATTEMPTS_REACHED=WSRM1159: se ha alcanzado el n\u00FAmero m\u00E1ximo de intentos de reenv\u00EDo del mensaje.
WSRM1160_DELIVERY_QUEUE_CLOSED=WSRM1160: se ha cerrado la cola de entrega de la secuencia

# protocol JAXB elements
# WSRM4001_
# Nack = Negative Acknowledge. This term is used in the specification of WS-ReliableMessaging. Should not be translated.
WSRM4002_BOTH_ACKS_AND_NACKS_MESSAGE=WSRM4002: SequenceAcknowledgement no puede contener AcknowledgementRanges y NACK al mismo tiempo.
WSRM4003_UPPERBOUND_LESSTHAN_LOWERBOUND_MESSAGE=WSRM4003: el l\u00EDmite superior de un rango de SequenceAcknowledgement es menor que el l\u00EDmite inferior.      
WSRM4004_SEQUENCE_ACKNOWLEDGEMENT_TOSTRING_STRING=WSRM4004: SequenceAcknowledgement:\n\tid = {0}\n\tRangos:\n\tbufferRemaining = {1}\n
WSRM4005_SEQUENCE_TOSTRING_STRING=WSRM4005: SequenceElement:\n\tid = {0}\n\tnumber = {1}\n\tlast = {2}

# intermediary use case related messages
# WSRM5001_
WSRM5001_COULD_NOT_BEGIN_TRANSACTION=WSRM5001: no se ha podido iniciar la transacci\u00F3n distribuida. Se ha encontrado una transacci\u00F3n existente.
WSRM5002_CLIENTTUBE_PROCESSING_CANNNOT_HAVE_TRANSACTION=WSRM5002: el procesamiento de mensajes de ClientTube no puede ser parte de una transacci\u00F3n distribuida.
WSRM5003_RECEIVED_WSRM_FAULT_RESPONSE=WSRM5003: se ha recibido una respuesta de fallo de WS-RM. La acci\u00F3n del fallo es: [ {0} ]

