#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes

#### Errors and exceptions (1-1000)
WSSPIPE0001.problem.mar.unmar=WSSPIPE001: problema ao criar marshaller/unmarshaller do JAXB de JAXBContext. Verifique se JAXBcontext foi inicializado corretamente.

WSSPIPE0002.internal.server.error=WSSPIPE0002: pipe de Seguran\u00E7a: Erro Interno ao tentar criar um SOAPFault.

WSSPIPE0003.problem.printing.msg=WSSPIPE003: ocorreu um erro ao tentar imprimir a Mensagem SOAP. Pode ser um problema na m\u00E1 forma\u00E7\u00E3o do XML na mensagem.

WSSPIPE0004.opt.path.not.yet.supported=WSSPIPE0004: verifica\u00E7\u00E3o da Pol\u00EDtica de Falhas ainda n\u00E3o suporta Caminho Otimizado.

WSSPIPE0005.problem.proc.soap.message=WSSPIPE0005: pipe de Seguran\u00E7a: erro ao converter a mensagem JAXWS para a Mensagem SAAJ SOAP.

WSSPIPE0006.problem.init.out.proc.context=WSSPIPE0006: pipe de Seguran\u00E7a: ocorreu um Erro Interno ao inicializar o Contexto de Processamento de Seguran\u00E7a de Sa\u00EDda.

WSSPIPE0007.problem.getting.eff.boot.policy=WSSPIPE0007: pipe de Seguran\u00E7a: ocorreu um Erro ao tentar obter a pol\u00EDtica de Bootstrap SecureConversation Efetiva.

WSSPIPE0008.problem.building.protocol.policy=WSSPIPE0008: pipe de Seguran\u00E7a: ocorreu um erro ao tentar criar a Pol\u00EDtica de Seguran\u00E7a Efetiva para a Mensagem de Protocolo.

WSSPIPE0009.unsupported.callback.type.encountered=WSSPIPE0009: foi detectado um tipo de callback {0} n\u00E3o suportado.

WSSPIPE0010.unknown.validator.type.config=WSSPIPE0010: tipo de Validador {0} desconhecido na Asser\u00E7\u00E3o de configura\u00E7\u00E3o.

WSSPIPE0011.could.not.find.user.class=WSSPIPE0011: n\u00E3o foi poss\u00EDvel localizar a Classe: {0} do Usu\u00E1rio.

WSSPIPE0012.problem.checking.reliable.message.enable=WSSPIPE0012: Erro Interno: n\u00E3o foi poss\u00EDvel detectar se a Mensagem Confi\u00E1vel est\u00E1 ou n\u00E3o ativada.

WSSPIPE0013.sec.policy.not.configured=WSSPIPE0013: SecurityPolicy n\u00E3o configurado para a opera\u00E7\u00E3o {0}, mas SecurityHeader foi encontrado.

WSSPIPE0014.keystore.url.null.config.assertion=WSSPIPE0014: o URL da \u00C1rea de Armazenamento de Chaves foi obtido como NULL de ConfigAssertion.

WSSPIPE0015.keystore.password.null.config.assertion=WSSPIPE0015: a Senha da \u00C1rea de Armazenamento de Chaves foi obtida como NULL de ConfigAssertion.

WSSPIPE0016.truststore.url.null.config.assertion=WSSPIPE0016: o URL da \u00C1rea de Armazenamento Confi\u00E1vel foi obtido como NULL de ConfigAssertion.

WSSPIPE0017.truststore.password.null.config.assertion=WSSPIPE0017: a Senha da \u00C1rea de Armazenamento Confi\u00E1vel foi obtida como NULL de ConfigAssertion.

WSSPIPE0018.null.or.empty.xwss.callback.handler.classname=WSSPIPE0018: valor Nulo ou vazio especificado para o nome da classe xwssCallbackHandler.

WSSPIPE0019.null.or.empty.username.handler.classname=WSSPIPE0019: valor Nulo ou vazio especificado para o nome da classe usernameHandler.

WSSPIPE0020.null.or.empty.password.handler.classname=WSSPIPE0020: valor Nulo ou vazio especificado para o nome da classe passwordHandler.

WSSPIPE0021.null.or.empty.saml.handler.classname=WSSPIPE0021: valor Nulo ou vazio especificado para o nome da classe samlHandler

# {0} - validator name
WSSPIPE0022.null.or.empty.validator.classname=WSSPIPE0022: nome de classe do Validador Nulo ou Vazio definido para {0}

WSSPIPE0023.error.creating.new.instance.sec.client.pipe=WSSPIPE0023: erro ao criar a nova inst\u00E2ncia de SecurityClientPipe

WSSPIPE0024.error.securing.outbound.msg=WSSPIPE0024: erro ao Proteger a Mensagem de Sa\u00EDda.

WSSPIPE0025.error.verify.inbound.msg=WSSPIPE0025: erro na Verifica\u00E7\u00E3o de Seguran\u00E7a na Mensagem de Entrada.

WSSPIPE0026.no.policy.found.for.sc=WSSPIPE0026: n\u00E3o \u00E9 poss\u00EDvel iniciar SecureConversation, nenhuma Asser\u00E7\u00E3o de SecureConversation encontrada na Pol\u00EDtica.

WSSPIPE0027.error.configure.client.handler=WSSPIPE0027: erro ao configurar o Handler de Callback de Seguran\u00E7a do Cliente.

WSSPIPE0028.error.creating.new.instance.sec.server.pipe=WSSPIPE0028: erro ao criar a nova inst\u00E2ncia de SecurityServerPipe

WSSPIPE0029.error.session.creation=WSSPIPE0029: falha ao criar uma Sess\u00E3o Segura com a Solicita\u00E7\u00E3o de Emiss\u00E3o RST-SCT.

WSSPIPE0030.unsupported.operation.exception=WSSPIPE0030: RequestType : {0} n\u00E3o suportado para criar uma Sess\u00E3o Segura.

WSSPIPE0031.error.invoke.sc.contract=WSSPIPE0031: erro ao chamar o Contrato de Conversa Segura.

WSSPIPE0032.error.configure.server.handler=WSSPIPE0027: erro ao configurar o Handler de Callback de Seguran\u00E7a do Servidor.

WSSPIPE0033.invalid.callback.handler.class=WSSPIPE0033: a classe: {0} de CallbackHandler n\u00E3o \u00E9 um javax.security.auth.callback.CallbackHandler v\u00E1lido

WSSPIPE0034.faulty.response.msg=WSSPIPE0034: a Aplica\u00E7\u00E3o Cliente recebeu uma Falha SOAP: {0}

WSSPIPE0035.error.issuedtoken.creation=WSSPIPE0035: exce\u00E7\u00E3o Recebida durante a Cria\u00E7\u00E3o de IssuedToken.

#### Info, Fine and Warning messages ####
#### Codes starting from 1000+


# For Tubes

#Logging Error codes

#### Errors and exceptions (1-1000)
WSSTUBE0001.problem.mar.unmar=WSSTUBE001: problema ao criar marshaller/unmarshaller do JAXB de JAXBContext. Verifique se JAXBcontext foi inicializado corretamente.

WSSTUBE0002.internal.server.error=WSSTUBE0002: tubo de Seguran\u00E7a: Erro Interno ao tentar criar um SOAPFault.

WSSTUBE0003.problem.printing.msg=WSSTUBE003: ocorreu um erro ao tentar imprimir a Mensagem SOAP. Pode ser um problema na m\u00E1 forma\u00E7\u00E3o do XML na mensagem.

WSSTUBE0004.opt.path.not.yet.supported=WSSTUBE0004: verifica\u00E7\u00E3o da Pol\u00EDtica de Falhas ainda n\u00E3o suporta Caminho Otimizado.

WSSTUBE0005.problem.proc.soap.message=WSSTUBE0005: tubo de Seguran\u00E7a: erro ao converter a mensagem JAXWS para a Mensagem SAAJ SOAP.

WSSTUBE0006.problem.init.out.proc.context=WSSTUBE0006: tubo de Seguran\u00E7a: ocorreu um Erro Interno ao inicializar o Contexto de Processamento de Seguran\u00E7a de Sa\u00EDda.

WSSTUBE0007.problem.getting.eff.boot.policy=WSSTUBE0007: tubo de Seguran\u00E7a: ocorreu um Erro ao tentar obter a pol\u00EDtica de Bootstrap SecureConversation Efetiva.

WSSTUBE0008.problem.building.protocol.policy=WSSTUBE0008: tubo de Seguran\u00E7a: ocorreu um erro ao tentar criar a Pol\u00EDtica de Seguran\u00E7a Efetiva para a Mensagem de Protocolo.

WSSTUBE0009.unsupported.callback.type.encountered=WSSTUBE0009: foi detectado um tipo de callback {0} n\u00E3o suportado.

WSSTUBE0010.unknown.validator.type.config=WSSTUBE0010: tipo de Validador {0} desconhecido na Asser\u00E7\u00E3o de configura\u00E7\u00E3o.

WSSTUBE0011.could.not.find.user.class=WSSTUBE0011: n\u00E3o foi poss\u00EDvel localizar a Classe: {0} do Usu\u00E1rio.

WSSTUBE0012.problem.checking.reliable.message.enable=WSSTUBE0012: Erro Interno: n\u00E3o foi poss\u00EDvel detectar se a Mensagem Confi\u00E1vel est\u00E1 ou n\u00E3o ativada.

WSSTUBE0013.sec.policy.not.configured=WSSTUBE0013: SecurityPolicy n\u00E3o configurado para a opera\u00E7\u00E3o {0}, mas SecurityHeader foi encontrado.

WSSTUBE0014.keystore.url.null.config.assertion=WSSTUBE0014: o URL da \u00C1rea de Armazenamento de Chaves foi obtido como NULL de ConfigAssertion.

WSSTUBE0015.keystore.password.null.config.assertion=WSSTUBE0015: a Senha da \u00C1rea de Armazenamento de Chaves foi obtida como NULL de ConfigAssertion.

WSSTUBE0016.truststore.url.null.config.assertion=WSSTUBE0016: o URL da \u00C1rea de Armazenamento Confi\u00E1vel foi obtido como NULL de ConfigAssertion.

WSSTUBE0017.truststore.password.null.config.assertion=WSSTUBE0017: a Senha da \u00C1rea de Armazenamento Confi\u00E1vel foi obtida como NULL de ConfigAssertion.

WSSTUBE0018.null.or.empty.xwss.callback.handler.classname=WSSTUBE0018: valor Nulo ou vazio especificado para o nome da classe xwssCallbackHandler.

WSSTUBE0019.null.or.empty.username.handler.classname=WSSTUBE0019: valor Nulo ou vazio especificado para o nome da classe usernameHandler.

WSSTUBE0020.null.or.empty.password.handler.classname=WSSTUBE0020: valor Nulo ou vazio especificado para o nome da classe  passwordHandler.

WSSTUBE0021.null.or.empty.saml.handler.classname=WSSTUBE0021: valor Nulo ou vazio especificado para o nome da classe samlHandler

# {0} - validator name
WSSTUBE0022.null.or.empty.validator.classname=WSSTUBE0022: nome de classe do Validador Nulo ou Vazio definido para {0}

WSSTUBE0023.error.creating.new.instance.sec.client.tube=WSSTUBE0023: erro ao criar a nova inst\u00E2ncia de SecurityClientTube

WSSTUBE0024.error.securing.outbound.msg=WSSTUBE0024: erro ao Proteger a Mensagem de Sa\u00EDda.

WSSTUBE0025.error.verify.inbound.msg=WSSTUBE0025: erro em Verifica\u00E7\u00E3o de Seguran\u00E7a na Mensagem de Entrada.

WSSTUBE0026.no.policy.found.for.sc=WSSTUBE0026: n\u00E3o \u00E9 poss\u00EDvel iniciar SecureConversation, nenhuma Asser\u00E7\u00E3o de SecureConversation encontrada na Pol\u00EDtica.

WSSTUBE0027.error.configure.client.handler=WSSTUBE0027: erro ao configurar o Handler de Callback de Seguran\u00E7a do Cliente.

WSSTUBE0028.error.creating.new.instance.sec.server.tube=WSSTUBE0028: erro ao criar a nova inst\u00E2ncia de SecurityServerTube

WSSTUBE0029.error.session.creation=WSSTUBE0029: falha ao criar uma Sess\u00E3o Segura com a Solicita\u00E7\u00E3o de Emiss\u00E3o RST-SCT.

WSSTUBE0030.unsupported.operation.exception=WSSTUBE0030: RequestType : {0} n\u00E3o suportado para criar uma Sess\u00E3o Segura.

WSSTUBE0031.error.invoke.sc.contract=WSSTUBE0031: erro ao chamar o Contrato de Conversa Segura.

WSSTUBE0032.error.configure.server.handler=WSSTUBE0027: erro ao configurar o Handler de Callback de Seguran\u00E7a do Servidor.

WSSTUBE0033.invalid.callback.handler.class=WSSTUBE0033: a classe: {0} de CallbackHandler n\u00E3o \u00E9 um javax.security.auth.callback.CallbackHandler v\u00E1lido

WSSTUBE0034.faulty.response.msg=WSSTUBE0034: a Aplica\u00E7\u00E3o Cliente recebeu uma Falha SOAP: {0}

WSSTUBE0035.error.issuedtoken.creation=WSSTUBE0035: exce\u00E7\u00E3o Recebida durante a Cria\u00E7\u00E3o de IssuedToken.

WSSTUBE0036.error.instatiate.webservice.context.delegate=WSSTUBE: exce\u00E7\u00E3o durante a instancia\u00E7\u00E3o da delega\u00E7\u00E3o de contexto do webservice

#### Info, Fine and Warning messages ####
#### Codes starting from 1000+
