#
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.
#
# Copyright (c) 2010 Oracle and/or its affiliates. All rights reserved.
#
# The contents of this file are subject to the terms of either the GNU
# General Public License Version 2 only ("GPL") or the Common Development
# and Distribution License("CDDL") (collectively, the "License").  You
# may not use this file except in compliance with the License.  You can
# obtain a copy of the License at
# https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
# or packager/legal/LICENSE.txt.  See the License for the specific
# language governing permissions and limitations under the License.
#
# When distributing the software, include this License Header Notice in each
# file and include the License file at packager/legal/LICENSE.txt.
#
# GPL Classpath Exception:
# Oracle designates this particular file as subject to the "Classpath"
# exception as provided by Oracle in the GPL Version 2 section of the License
# file that accompanied this code.
#
# Modifications:
# If applicable, add the following below the License Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyright [year] [name of copyright owner]"
#
# Contributor(s):
# If you wish your version of this file to be governed by only the CDDL or
# only the GPL Version 2, indicate your decision by adding "[Contributor]
# elects to include this software in this distribution under the [CDDL or GPL
# Version 2] license."  If you don't indicate a single choice of license, a
# recipient has the option to distribute your version of this file under
# either the CDDL, the GPL Version 2 or to extend the choice of license to
# its licensees as provided above.  However, if you add GPL Version 2 code
# and therefore, elected the GPL Version 2 license, then the option applies
# only if the new code is made subject to such option by the copyright
# holder.
#

#Logging Error codes

#### Errors and exceptions (1-1000)
WSSPIPE0001.problem.mar.unmar=WSSPIPE001: se ha producido un problema al crear el marshaller/unmarshaller de JAXB con JAXBContext. Compruebe si JAXBcontext se ha inicializado correctamente.

WSSPIPE0002.internal.server.error=WSSPIPE0002: Canal de seguridad: se ha producido un error interno al intentar crear un elemento SOAPFault.

WSSPIPE0003.problem.printing.msg=WSSPIPE003: se ha producido un error al intentar imprimir el mensaje de SOAP. Puede que exista un problema de formato correcto con el c\u00F3digo XML del mensaje.

WSSPIPE0004.opt.path.not.yet.supported=WSSPIPE0004: la ruta de acceso optimizada de la verificaci\u00F3n de la pol\u00EDtica de fallos a\u00FAn no est\u00E1 soportada.

WSSPIPE0005.problem.proc.soap.message=WSSPIPE0005: Canal de seguridad: se ha producido un error al convertir el mensaje de JAX-WS en un mensaje de SOAP SAAJ.

WSSPIPE0006.problem.init.out.proc.context=WSSPIPE0006: Canal de seguridad: se ha producido un error interno al inicializar el contexto de procesamiento de seguridad de salida.

WSSPIPE0007.problem.getting.eff.boot.policy=WSSPIPE0007: Canal de seguridad: se ha producido un error al intentar obtener la pol\u00EDtica de inicializaci\u00F3n de datos SecureConversation efectiva.

WSSPIPE0008.problem.building.protocol.policy=WSSPIPE0008: Canal de seguridad: se ha producido un error al intentar crear una pol\u00EDtica de seguridad efectiva para el mensaje de protocolo.

WSSPIPE0009.unsupported.callback.type.encountered=WSSPIPE0009: se ha encontrado un tipo de devoluci\u00F3n de llamada {0} no soportado.

WSSPIPE0010.unknown.validator.type.config=WSSPIPE0010: tipo de validador desconocido {0} en ConfigAssertion.

WSSPIPE0011.could.not.find.user.class=WSSPIPE0011: No se ha encontrado la clase de usuario: {0}.

WSSPIPE0012.problem.checking.reliable.message.enable=WSSPIPE0012: Error interno: no se ha podido detectar si los mensajes fiables est\u00E1n activados.

WSSPIPE0013.sec.policy.not.configured=WSSPIPE0013: SecurityPolicy no se ha configurado para la operaci\u00F3n {0}, pero se ha encontrado SecurityHeader.

WSSPIPE0014.keystore.url.null.config.assertion=WSSPIPE0014: la URL de KeyStore obtenida de ConfigAssertion es nula.

WSSPIPE0015.keystore.password.null.config.assertion=WSSPIPE0015: la contrase\u00F1a de KeyStore obtenida de ConfigAssertion es nula.

WSSPIPE0016.truststore.url.null.config.assertion=WSSPIPE0016: la URL de TrustStore obtenida de ConfigAssertion es nula.

WSSPIPE0017.truststore.password.null.config.assertion=WSSPIPE0017: la contrase\u00F1a de TrustStore obtenida de ConfigAssertion es nula.

WSSPIPE0018.null.or.empty.xwss.callback.handler.classname=WSSPIPE0018: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase xwssCallbackHandler.

WSSPIPE0019.null.or.empty.username.handler.classname=WSSPIPE0019: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase usernameHandler.

WSSPIPE0020.null.or.empty.password.handler.classname=WSSPIPE0020: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase passwordHandler.

WSSPIPE0021.null.or.empty.saml.handler.classname=WSSPIPE0021: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase samlHandler.

# {0} - validator name
WSSPIPE0022.null.or.empty.validator.classname=WSSPIPE0022: se ha definido un nombre de clase de validador nulo o vac\u00EDo para {0}

WSSPIPE0023.error.creating.new.instance.sec.client.pipe=WSSPIPE0023: error al crear una instancia nueva de SecurityClientPipe

WSSPIPE0024.error.securing.outbound.msg=WSSPIPE0024: error al proteger el mensaje saliente.

WSSPIPE0025.error.verify.inbound.msg=WSSPIPE0025: error al verificar la seguridad del mensaje entrante.

WSSPIPE0026.no.policy.found.for.sc=WSSPIPE0026: no se puede iniciar SecureConversation; no se ha encontrado ninguna afirmaci\u00F3n de SecureConversation en la pol\u00EDtica.

WSSPIPE0027.error.configure.client.handler=WSSPIPE0027: error al configurar el elemento CallbackHandler de seguridad del cliente.

WSSPIPE0028.error.creating.new.instance.sec.server.pipe=WSSPIPE0028: error al crear una instancia nueva de SecurityServerPipe

WSSPIPE0029.error.session.creation=WSSPIPE0029: fallo al crear una sesi\u00F3n segura con la solicitud de emisi\u00F3n de token de seguridad de solicitud-token de contexto de seguridad.

WSSPIPE0030.unsupported.operation.exception=WSSPIPE0030: tipo de solicitud {0} no soportado para crear una sesi\u00F3n segura.

WSSPIPE0031.error.invoke.sc.contract=WSSPIPE0031: error al llamar al contrato de la conversaci\u00F3n segura.

WSSPIPE0032.error.configure.server.handler=WSSPIPE0027: error al configurar el elemento CallbackHandler de seguridad del servidor.

WSSPIPE0033.invalid.callback.handler.class=WSSPIPE0033: la clase CallbackHandler {0} especificada no es un valor javax.security.auth.callback.CallbackHandler v\u00E1lido

WSSPIPE0034.faulty.response.msg=WSSPIPE0034: La aplicaci\u00F3n cliente ha recibido un fallo de SOAP: {0}.

WSSPIPE0035.error.issuedtoken.creation=WSSPIPE0035: se ha recibido una excepci\u00F3n durante la creaci\u00F3n de IssuedToken.

#### Info, Fine and Warning messages ####
#### Codes starting from 1000+


# For Tubes

#Logging Error codes

#### Errors and exceptions (1-1000)
WSSTUBE0001.problem.mar.unmar=WSSTUBE001: se ha producido un problema al crear el marshaller/unmarshaller de JAXB con JAXBContext. Compruebe si JAXBcontext se ha inicializado correctamente.

WSSTUBE0002.internal.server.error=WSSTUBE0002: Tubo de seguridad: se ha producido un error interno al intentar crear un elemento SOAPFault.

WSSTUBE0003.problem.printing.msg=WSSTUBE003: se ha producido un error al intentar imprimir el mensaje de SOAP. Puede que exista un problema de formato correcto con el c\u00F3digo XML del mensaje.

WSSTUBE0004.opt.path.not.yet.supported=WSSTUBE0004: la ruta de acceso optimizada de la verificaci\u00F3n de la pol\u00EDtica de fallos a\u00FAn no est\u00E1 soportada.

WSSTUBE0005.problem.proc.soap.message=WSSTUBE0005: Tubo de seguridad: se ha producido un error al convertir el mensaje de JAX-WS en un mensaje de SOAP SAAJ.

WSSTUBE0006.problem.init.out.proc.context=WSSTUBE0006: Tubo de seguridad: se ha producido un error interno al inicializar el contexto de procesamiento de seguridad de salida.

WSSTUBE0007.problem.getting.eff.boot.policy=WSSTUBE0007: Tubo de seguridad: se ha producido un error al intentar obtener la pol\u00EDtica de inicializaci\u00F3n de datos SecureConversation efectiva.

WSSTUBE0008.problem.building.protocol.policy=WSSTUBE0008: Tubo de seguridad: se ha producido un error al intentar crear una pol\u00EDtica de seguridad efectiva para el mensaje de protocolo.

WSSTUBE0009.unsupported.callback.type.encountered=WSSTUBE0009: se ha encontrado un tipo de devoluci\u00F3n de llamada {0} no soportado.

WSSTUBE0010.unknown.validator.type.config=WSSTUBE0010: tipo de validador desconocido {0} en ConfigAssertion.

WSSTUBE0011.could.not.find.user.class=WSSTUBE0011: No se ha encontrado la clase de usuario: {0}.

WSSTUBE0012.problem.checking.reliable.message.enable=WSSTUBE0012: Error interno: no se ha podido detectar si los mensajes fiables est\u00E1n activados.

WSSTUBE0013.sec.policy.not.configured=WSSTUBE0013: SecurityPolicy no se ha configurado para la operaci\u00F3n {0}, pero se ha encontrado SecurityHeader.

WSSTUBE0014.keystore.url.null.config.assertion=WSSTUBE0014: la URL de KeyStore obtenida de ConfigAssertion es nula.

WSSTUBE0015.keystore.password.null.config.assertion=WSSTUBE0015: la contrase\u00F1a de KeyStore obtenida de ConfigAssertion es nula.

WSSTUBE0016.truststore.url.null.config.assertion=WSSTUBE0016: la URL de TrustStore obtenida de ConfigAssertion es nula.

WSSTUBE0017.truststore.password.null.config.assertion=WSSTUBE0017: la contrase\u00F1a de TrustStore obtenida de ConfigAssertion es nula.

WSSTUBE0018.null.or.empty.xwss.callback.handler.classname=WSSTUBE0018: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase xwssCallbackHandler.

WSSTUBE0019.null.or.empty.username.handler.classname=WSSTUBE0019: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase usernameHandler.

WSSTUBE0020.null.or.empty.password.handler.classname=WSSTUBE0020: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase passwordHandler.

WSSTUBE0021.null.or.empty.saml.handler.classname=WSSTUBE0021: se ha especificado un valor nulo o vac\u00EDo para el nombre de clase samlHandler.

# {0} - validator name
WSSTUBE0022.null.or.empty.validator.classname=WSSTUBE0022: se ha definido un nombre de clase de validador nulo o vac\u00EDo para {0}

WSSTUBE0023.error.creating.new.instance.sec.client.tube=WSSTUBE0023: error al crear una instancia nueva de SecurityClientTube

WSSTUBE0024.error.securing.outbound.msg=WSSTUBE0024: error al proteger el mensaje saliente.

WSSTUBE0025.error.verify.inbound.msg=WSSTUBE0025: error al verificar la seguridad del mensaje entrante.

WSSTUBE0026.no.policy.found.for.sc=WSSTUBE0026: no se puede iniciar SecureConversation; no se ha encontrado ninguna afirmaci\u00F3n de SecureConversation en la pol\u00EDtica.

WSSTUBE0027.error.configure.client.handler=WSSTUBE0027: error al configurar el elemento CallbackHandler de seguridad del cliente.

WSSTUBE0028.error.creating.new.instance.sec.server.tube=WSSTUBE0028: error al crear una instancia nueva de SecurityServerTube

WSSTUBE0029.error.session.creation=WSSTUBE0029: fallo al crear una sesi\u00F3n segura con la solicitud de emisi\u00F3n de token de seguridad de solicitud-token de contexto de seguridad.

WSSTUBE0030.unsupported.operation.exception=WSSTUBE0030: tipo de solicitud {0} no soportado para crear una sesi\u00F3n segura.

WSSTUBE0031.error.invoke.sc.contract=WSSTUBE0031: error al llamar al contrato de la conversaci\u00F3n segura.

WSSTUBE0032.error.configure.server.handler=WSSTUBE0027: error al configurar el elemento CallbackHandler de seguridad del servidor.

WSSTUBE0033.invalid.callback.handler.class=WSSTUBE0033: la clase CallbackHandler {0} especificada no es un valor javax.security.auth.callback.CallbackHandler v\u00E1lido

WSSTUBE0034.faulty.response.msg=WSSTUBE0034: La aplicaci\u00F3n cliente ha recibido un fallo de SOAP: {0}.

WSSTUBE0035.error.issuedtoken.creation=WSSTUBE0035: se ha recibido una excepci\u00F3n durante la creaci\u00F3n de IssuedToken.

WSSTUBE0036.error.instatiate.webservice.context.delegate=WSSTUBE: excepci\u00F3n al instanciar el delegado de contexto del servicio web

#### Info, Fine and Warning messages ####
#### Codes starting from 1000+
